stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
typedef struct {                                /*!< TIMx Structure                                                            */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SMCR;                         /*!< (@ 0x00000008) Slave mode control register                                */
  __IO uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IO uint32_t  SR;                           /*!< (@ 0x00000010) Status register                                            */
  __IO  uint32_t  EGR;                          /*!< (@ 0x00000014) Event generation register                                  */
  __IO uint32_t  CCMR1;                        /*!< (@ 0x00000018) Input capture and output compare mode register 1           */
  __IO uint32_t  CCMR2;                        /*!< (@ 0x0000001C) Input capture and output compare mode register 2           */
  __IO uint32_t  CCER;                         /*!< (@ 0x00000020) Capture/compare enable register                            */
  __IO uint32_t  CNT;                          /*!< (@ 0x00000024) Counter                                                    */
  __IO uint32_t  PSC;                          /*!< (@ 0x00000028) Prescaler                                                  */
  __IO uint32_t  ARR;                          /*!< (@ 0x0000002C) Auto-reload register                                       */
  __IO uint32_t  RCR;                          /*!< (@ 0x00000030) Repetition counter register                                */
  __IO uint32_t  CCR1;                         /*!< (@ 0x00000034) Capture/compare register 1                                 */
  __IO uint32_t  CCR2;                         /*!< (@ 0x00000038) Capture/compare register 2                                 */
  __IO uint32_t  CCR3;                         /*!< (@ 0x0000003C) Capture/compare register 3                                 */
  __IO uint32_t  CCR4;                         /*!< (@ 0x00000040) Capture/compare register 4                                 */
  __IO uint32_t  BDTR;                         /*!< (@ 0x00000044) Break and dead-time register                               */
  __IO uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IO uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
  __IO uint32_t  OR;                           /*!< (@ 0x00000050) Option register 1                                          */
  __IO  uint32_t  RESERVED[3];
  __IO uint32_t  AF1;                          /*!< (@ 0x00000060) TIM alternate function option register 1                   */
  __IO  uint32_t  RESERVED1;
  __IO uint32_t  TISEL;                        /*!< (@ 0x00000068) Input selection register                                   */
} TIM_TypeDef;                                  /*!< Size = 108 (0x6C)                                                         */



/* =========================================================================================================================== */
/* ================                                           USART                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver transmitter (USART)
  */

typedef struct {                                /*!< USART Structure                                                           */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IO uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IO uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IO uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __IO  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IO  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __IO  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IO  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IO uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} USART_TypeDef;                                /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */
  __IO uint32_t  TR;                           /*!< (@ 0x00000000) Time register                                              */
  __IO uint32_t  DR;                           /*!< (@ 0x00000004) Date register                                              */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000000C) Initialization and status register                         */
  __IO uint32_t  PRER;                         /*!< (@ 0x00000010) Prescaler register                                         */
  __IO uint32_t  WUTR;                         /*!< (@ 0x00000014) Wakeup timer register                                      */
  __IO  uint32_t  RESERVED;
  __IO uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) Alarm A register                                           */
  __IO  uint32_t  RESERVED1;
  __IO  uint32_t  WPR;                          /*!< (@ 0x00000024) Write protection register                                  */
  __IO  uint32_t  SSR;                          /*!< (@ 0x00000028) Sub second register                                        */
  __IO  uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) Shift control register                                     */
  __IO  uint32_t  TSTR;                         /*!< (@ 0x00000030) Timestamp time register                                    */
  __IO  uint32_t  TSDR;                         /*!< (@ 0x00000034) Timestamp date register                                    */
  __IO  uint32_t  TSSSR;                        /*!< (@ 0x00000038) Timestamp sub second register                              */
  __IO uint32_t  CALR;                         /*!< (@ 0x0000003C) Calibration register                                       */
  __IO uint32_t  TAMPCR;                       /*!< (@ 0x00000040) Tamper configuration register                              */
  __IO uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) Alarm A sub second register                                */
  __IO  uint32_t  RESERVED2;
  __IO uint32_t  OR;                           /*!< (@ 0x0000004C) Option register                                            */
  __IO uint32_t  BKP0R;                        /*!< (@ 0x00000050) Backup register 0                                          */
  __IO uint32_t  BKP1R;                        /*!< (@ 0x00000054) Backup register 1                                          */
} RTC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced encryption standard hardware accelerator (AES)
  */

typedef struct {              /*!< AES Structure                                                                               */
  __IO uint32_t   CR;        /*!< (@ 0x00000000) Control Register                                                             */
  __IO  uint32_t   SR;        /*!< (@ 0x00000004) Status Register                                                              */
  __IO uint32_t   DINR;      /*!< (@ 0x00000008) Data Input register                                                          */
  __IO  uint32_t   DOUTR;     /*!< (@ 0x0000000C) Data Output register                                                         */
  __IO uint32_t   KEYR0;     /*!< (@ 0x00000010) Key register 0                                                               */
  __IO uint32_t   KEYR1;     /*!< (@ 0x00000014) Key register 1                                                               */
  __IO uint32_t   KEYR2;     /*!< (@ 0x00000018) Key register 2                                                               */
  __IO uint32_t   KEYR3;     /*!< (@ 0x0000001C) Key register 3                                                               */
  __IO uint32_t   IVR0;      /*!< (@ 0x00000020) Initialization vector register 0                                             */
  __IO uint32_t   IVR1;      /*!< (@ 0x00000024) Initialization vector register 1                                             */
  __IO uint32_t   IVR2;      /*!< (@ 0x00000028) Initialization vector register 2                                             */
  __IO uint32_t   IVR3;      /*!< (@ 0x0000002C) Initialization vector register 3                                             */
  __IO uint32_t   KEYR4;     /*!< (@ 0x00000030) Key register 4                                                               */
  __IO uint32_t   KEYR5;     /*!< (@ 0x00000034) Key register 5                                                               */
  __IO uint32_t   KEYR6;     /*!< (@ 0x00000038) Key register 6                                                               */
  __IO uint32_t   KEYR7;     /*!< (@ 0x0000003C) Key register 7                                                               */
  __IO uint32_t   SUSP0;     /*!< (@ 0x00000040) Suspend register 0                                                           */
  __IO uint32_t   SUSP1;     /*!< (@ 0x00000044) Suspend register 1                                                           */
  __IO uint32_t   SUSP2;     /*!< (@ 0x00000048) Suspend register 2                                                           */
  __IO uint32_t   SUSP3;     /*!< (@ 0x0000004C) Suspend register 3                                                           */
  __IO uint32_t   SUSP4;     /*!< (@ 0x00000050) Suspend register 4                                                           */
  __IO uint32_t   SUSP5;     /*!< (@ 0x00000054) Suspend register 5                                                           */
  __IO uint32_t   SUSP6;     /*!< (@ 0x00000058) Suspend register 6                                                           */
  __IO uint32_t   SUSP7;     /*!< (@ 0x0000005C) Suspend register 7                                                           */
} AES_TypeDef;                /*!< Size = 96 (0x60)                                                                            */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC (ADC)
  */

typedef struct {                                /*!< ADC Structure                                                             */
  __IO  uint32_t  VERSION_ID;                   /*!< (@ 0x00000000) VERSION_ID register                                        */
  __IO uint32_t  CONF;                         /*!< (@ 0x00000004) ADC configuration register                                 */
  __IO uint32_t  CTRL;                         /*!< (@ 0x00000008) ADC control register                                       */
  __IO  uint32_t  RESERVED[2];
  __IO uint32_t  SWITCH;                       /*!< (@ 0x00000014) ADC switch control for Input Selection                     */
  __IO  uint32_t  RESERVED1;
  __IO uint32_t  DS_CONF;                      /*!< (@ 0x0000001C) Downsampler configuration register                         */
  __IO uint32_t  SEQ_1;                        /*!< (@ 0x00000020) ADC regular sequence programming register 1                */
  __IO uint32_t  SEQ_2;                        /*!< (@ 0x00000024) ADC regular sequence programming register 2                */
  __IO uint32_t  COMP_1;                       /*!< (@ 0x00000028) ADC Gain & offset correction values register 1             */
  __IO uint32_t  COMP_2;                       /*!< (@ 0x0000002C) ADC Gain & offset correction values register 2             */
  __IO uint32_t  COMP_3;                       /*!< (@ 0x00000030) ADC Gain & offset correction values register 3             */
  __IO uint32_t  COMP_4;                       /*!< (@ 0x00000034) ADC Gain & offset correction values register 4             */
  __IO uint32_t  COMP_SEL;                     /*!< (@ 0x00000038) ADC Gain & Offset selection values register                */
  __IO uint32_t  WD_TH;                        /*!< (@ 0x0000003C) ADC watchdog threshold register register                   */
  __IO uint32_t  WD_CONF;                      /*!< (@ 0x00000040) ADC watchdog configuration register                        */
  __IO  uint32_t  DS_DATAOUT;                   /*!< (@ 0x00000044) Downsampler Data output register                           */
  __IO  uint32_t  RESERVED2;
  __IO uint32_t  IRQ_STATUS;                   /*!< (@ 0x0000004C) Interrupt Status register                                  */
  __IO uint32_t  IRQ_ENABLE;                   /*!< (@ 0x00000050) Enable/disable Interrupts                                  */
} ADC_TypeDef;                                  /*!< Size = 84 (0x54)                                                          */



#if defined (STM32WL3XX)
/* =========================================================================================================================== */
/* ================                                     COMP                                                  ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator (COMP)
  */

