stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
typedef struct{ /*!< MR_SUBG_GLOB_DYNAMIC Structure  */
  __IO uint32_t PCKTLEN_CONFIG;       /*!< (@ 0x00000000) PCKTLEN_CONFIG register            */
  __IO uint32_t MOD0_CONFIG;          /*!< (@ 0x00000004) MOD0_CONFIG register               */
  __IO uint32_t MOD1_CONFIG;          /*!< (@ 0x00000008) MOD1_CONFIG register               */
  __IO uint32_t SYNTH_FREQ;           /*!< (@ 0x0000000C) SYNTH_FREQ register                */
  __IO uint32_t VCO_CAL_CONFIG;       /*!< (@ 0x00000010) VCO_CAL_CONFIG register            */
  __IO uint32_t RX_TIMER;             /*!< (@ 0x00000014) RX_TIMER register                  */
  __IO uint32_t DATABUFFER_THR;       /*!< (@ 0x00000018) DATABUFFER_THR register            */
  __IO uint32_t RFSEQ_IRQ_ENABLE;     /*!< (@ 0x0000001C) RFSEQ_IRQ_ENABLE register          */
  __IO uint32_t ADDITIONAL_CTRL;      /*!< (@ 0x00000020) ADDITIONAL_CTRL register           */
  __IO uint32_t FAST_RX_TIMER;        /*!< (@ 0x00000024) FAST_RX_TIMER register             */
  __IO uint32_t COMMAND;              /*!< (@ 0x00000028) COMMAND register                   */
} MR_SUBG_GLOB_DYNAMIC_TypeDef;                         /*!< Size = 44 (0x2C) */


/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_STATUS                                     ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Status
  */

typedef struct{ /*!< MR_SUBG_GLOB_STATUS Structure  */
  __IO uint32_t RFSEQ_IRQ_STATUS;       /*!< (@ 0x00000000) RFSEQ_IRQ_STATUS register             */
  __IO uint32_t RFSEQ_STATUS_DETAIL;    /*!< (@ 0x00000004) RFSEQ_STATUS_DETAIL register          */
  __IO  uint32_t RADIO_FSM_INFO;         /*!< (@ 0x00000008) RADIO_FSM_INFO register               */
  __IO  uint32_t RX_INDICATOR;           /*!< (@ 0x0000000C) RX_INDICATOR register                 */
  __IO  uint32_t RX_INFO_REG;            /*!< (@ 0x00000010) RX_INFO_REG register                  */
  __IO  uint32_t RX_CRC_REG;             /*!< (@ 0x00000014) RX_CRC_REG register                   */
  __IO  uint32_t QI_INFO;                /*!< (@ 0x00000018) QI_INFO register                      */
  __IO  uint32_t DATABUFFER_INFO;        /*!< (@ 0x0000001C) DATABUFFER_INFO register              */
  __IO  uint32_t TIME_CAPTURE;           /*!< (@ 0x00000020) TIME_CAPTURE register                 */
  __IO  uint32_t IQC_CORRECTION_OUT;     /*!< (@ 0x00000024) IQC_CORRECTION_OUT register           */
  __IO  uint32_t PA_SAFEASK_OUT;         /*!< (@ 0x00000028) PA_SAFEASK_OUT register               */
  __IO  uint32_t VCO_CALIB_OUT;          /*!< (@ 0x0000002C) VCO_CALIB_OUT register                */
  __IO  uint32_t SEQ_INFO;               /*!< (@ 0x00000030) SEQ_INFO register                     */
  __IO  uint32_t SEQ_EVENT_STATUS;       /*!< (@ 0x00000034) SEQ_EVENT_STATUS register             */
} MR_SUBG_GLOB_STATUS_TypeDef;                           /*!< Size = 56 (0x38) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_MISC                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Misc
  */

typedef struct{ /*!< MR_SUBG_GLOB_MISC Structure  */
  __IO  uint32_t RFIP_VERSION;       /*!< (@ 0x00000000) RFIP_VERSION register               */
  __IO  uint32_t RRM_UDRA_CTRL;      /*!< (@ 0x00000004) RRM_UDRA_CTRL register              */
  __IO uint32_t SEQUENCER_CTRL;     /*!< (@ 0x00000008) SEQUENCER_CTRL register             */
  __IO  uint32_t ABSOLUTE_TIME;      /*!< (@ 0x0000000C) ABSOLUTE_TIME register              */
  __IO  uint32_t SCM_COUNTER_VAL;    /*!< (@ 0x00000010) SCM_COUNTER_VAL register            */
  __IO uint32_t SCM_MIN_MAX;        /*!< (@ 0x00000014) SCM_MIN_MAX register                */
  __IO uint32_t WAKEUP_IRQ_STATUS;  /*!< (@ 0x00000018) WAKEUP_IRQ_STATUS register          */
} MR_SUBG_GLOB_MISC_TypeDef;                       /*!< Size = 28 (0x1C) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_RETAINED                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Retained
  */

typedef struct{ /*!< MR_SUBG_GLOB_RETAINED Structure  */
  __IO  uint32_t RFIP_WAKEUPTIME;       /*!< (@ 0x00000000) RFIP_WAKEUPTIME register              */
  __IO uint32_t CPU_WAKEUPTIME;        /*!< (@ 0x00000004) CPU_WAKEUPTIME register               */
  __IO uint32_t WAKEUP_CTRL;           /*!< (@ 0x00000008) WAKEUP_CTRL register                  */
  __IO uint32_t RRM_CMDLIST_PTR;       /*!< (@ 0x0000000C) RRM_CMDLIST_PTR register              */
  __IO uint32_t SEQ_GLOBALTABLE_PTR;   /*!< (@ 0x00000010) SEQ_GLOBALTABLE_PTR register          */
} MR_SUBG_GLOB_RETAINED_TypeDef;                          /*!< Size = 20 (0x14) */



#if defined (STM32WL3XX)
/* =========================================================================================================================== */
/* ================                                        LPAWUR                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Power Autonomous Wakeup Radio IP
  */

typedef struct{ /*!< LPAWUR Structure  */
  __IO uint32_t FRAME_CONFIG0;       /*!< (@ 0x00000000) FRAME_CONFIG0 register              */
  __IO uint32_t FRAME_CONFIG1;       /*!< (@ 0x00000004) FRAME_CONFIG1 register              */
  __IO uint32_t FRAME_SYNC_CONFIG;   /*!< (@ 0x00000008) FRAME_SYNC_CONFIG register          */
  __IO uint32_t RFIP_CONFIG;         /*!< (@ 0x0000000C) RFIP_CONFIG register                */
  __IO uint32_t RF_CONFIG;           /*!< (@ 0x00000010) RF_CONFIG register                  */
  __IO uint32_t AGC_CONFIG;          /*!< (@ 0x00000014) AGC_CONFIG register                 */
  __IO  uint32_t RESERVED;
  __IO  uint32_t PAYLOAD_0;           /*!< (@ 0x0000001C) PAYLOAD_0 register                  */
  __IO  uint32_t PAYLOAD_1;           /*!< (@ 0x00000020) PAYLOAD_1 register                  */
  __IO  uint32_t RESERVED1[7];
  __IO  uint32_t RFIP_VERSION;        /*!< (@ 0x00000040) RFIP_VERSION register               */
  __IO uint32_t IRQ_ENABLE;          /*!< (@ 0x00000044) IRQ_ENABLE register                 */
  __IO uint32_t STATUS;              /*!< (@ 0x00000048) STATUS register                     */
} LPAWUR_TypeDef;                        /*!< Size = 76 (0x4C) */
#endif /* (STM32WL3XX) */



