stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */
#define FLASH_BASE             (0x10040000UL) /*!< Main FLASH base address */
#define SRAM_BASE              (0x20000000UL) /*!< SRAM base address       */
#define PERIPH_BASE            (0x40000000UL) /*!< Peripheral base address */


/*!< System Memory, OTP bytes */

/* Base addresses */
#define SYSTEM_MEMORY_BASE     (0x10000000UL)   /*!< System Memory : 6KB (0x10000000 – 0x100017FF)  */
#define OTP_AREA_BASE          (0x10001800UL)   /*!< OTP area : 1kB (0x10001800 – 0x10001BFF)       */

#define SRAM0_BASE             SRAM_BASE                  /*!< SRAM0 (16 KB) base address           */
#define SRAM1_BASE            (SRAM_BASE + 0x00004000UL)  /*!< SRAM1 (16 KB) base address           */

/* End addresses */
#define SRAM0_END_ADDR         (0x20003FFFUL)   /*!< RAM0  : 16KB (0x20000000 – 0x20003FFF)         */
#define SRAM1_END_ADDR         (0x20007FFFUL)   /*!< RAM1  : 16KB (0x20004000 – 0x20007FFF)         */

#define SYSTEM_MEMORY_END_ADDR (0x100017FFUL)   /*!< System Memory : 6KB (0x10000000 – 0x100017FF)  */
#define OTP_AREA_END_ADDR      (0x10001BFFUL)   /*!< OTP area : 1KB (0x10001800 – 0x10001BFF)       */

/*!< Peripheral memory map */
#define APB0PERIPH_BASE        PERIPH_BASE
#define APB1PERIPH_BASE       (PERIPH_BASE + 0x01000000LU)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x08000000LU)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x09000000LU)


/*!< APB0 peripherals */
#define SYSCFG_BASE        (APB0PERIPH_BASE + 0x0000UL)
#define FLASH_R_BASE       (APB0PERIPH_BASE + 0x1000UL)
#define TIM2_BASE          (APB0PERIPH_BASE + 0x2000UL)
#define IWDG_BASE          (APB0PERIPH_BASE + 0x3000UL)
#define RTC_BASE           (APB0PERIPH_BASE + 0x4000UL)
#define TIM16_BASE         (APB0PERIPH_BASE + 0x5000UL)
#if defined (STM32WL3XX)
#define DAC1_BASE          (APB0PERIPH_BASE + 0x6000UL)
#define LCD_BASE           (APB0PERIPH_BASE + 0x7000UL)
#endif /* (STM32WL3XX)*/
#define DBGMCU_BASE        (APB0PERIPH_BASE + 0x8000UL)
#if defined (STM32WL3XX)
#define COMP_BASE          (APB0PERIPH_BASE + 0x9000UL)
#define LCSC_BASE          (APB0PERIPH_BASE + 0xA000UL)
#endif /* (STM32WL3XX)*/


/*!< APB1 peripherals */
#define I2C1_BASE          (APB1PERIPH_BASE + 0x0000UL)
#if defined (STM32WL3XX)
#define I2C2_BASE          (APB1PERIPH_BASE + 0x1000UL)
#define SPI1_BASE          (APB1PERIPH_BASE + 0x2000UL)
#endif /* (STM32WL3XX)*/
#define USART1_BASE        (APB1PERIPH_BASE + 0x4000UL)
#define LPUART1_BASE       (APB1PERIPH_BASE + 0x5000UL)
#define ADC1_BASE           (APB1PERIPH_BASE + 0x6000UL)
#define SPI3_BASE          (APB1PERIPH_BASE + 0x7000UL)

/*!< AHB peripherals */
#define GPIOA_BASE                 (AHBPERIPH_BASE + 0x000000UL)
#define GPIOB_BASE                 (AHBPERIPH_BASE + 0x100000UL)
#define CRC_BASE                   (AHBPERIPH_BASE + 0x200000UL)
#define RCC_BASE                   (AHBPERIPH_BASE + 0x400000UL)
#define PWR_BASE                   (AHBPERIPH_BASE + 0x500000UL)
#define RNG_BASE                   (AHBPERIPH_BASE + 0x600000UL)
#define DMA1_BASE                  (AHBPERIPH_BASE + 0x700000UL)
#define DMAMUX1_BASE               (AHBPERIPH_BASE + 0x800000UL)
#define AES_BASE                   (AHBPERIPH_BASE + 0x900000UL)

#define DMA1_Channel1_BASE         (DMA1_BASE + 0x0008UL)
#define DMA1_Channel2_BASE         (DMA1_BASE + 0x001CUL)
#define DMA1_Channel3_BASE         (DMA1_BASE + 0x0030UL)
#define DMA1_Channel4_BASE         (DMA1_BASE + 0x0044UL)
#define DMA1_Channel5_BASE         (DMA1_BASE + 0x0058UL)
#define DMA1_Channel6_BASE         (DMA1_BASE + 0x006CUL)
#define DMA1_Channel7_BASE         (DMA1_BASE + 0x0080UL)
#define DMA1_Channel8_BASE         (DMA1_BASE + 0x0094UL)

#define DMAMUX1_Channel0_BASE      (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE      (DMAMUX1_BASE + 0x00000004UL)
#define DMAMUX1_Channel2_BASE      (DMAMUX1_BASE + 0x00000008UL)
#define DMAMUX1_Channel3_BASE      (DMAMUX1_BASE + 0x0000000CUL)
#define DMAMUX1_Channel4_BASE      (DMAMUX1_BASE + 0x00000010UL)
#define DMAMUX1_Channel5_BASE      (DMAMUX1_BASE + 0x00000014UL)
#define DMAMUX1_Channel6_BASE      (DMAMUX1_BASE + 0x00000018UL)
#define DMAMUX1_Channel7_BASE      (DMAMUX1_BASE + 0x0000001CUL)

/*!< APB2 peripherals */
#define MR_SUBG_BASE               (APB2PERIPH_BASE + 0x0000UL)
#define MR_SUBG_RADIO_BASE         (MR_SUBG_BASE    + 0x0000UL)
#define MR_SUBG_GLOB_STATIC_BASE   (MR_SUBG_BASE    + 0x0400UL)
#define MR_SUBG_GLOB_DYNAMIC_BASE  (MR_SUBG_BASE    + 0x0500UL)
#define MR_SUBG_GLOB_STATUS_BASE   (MR_SUBG_BASE    + 0x0600UL)
#define MR_SUBG_GLOB_MISC_BASE     (MR_SUBG_BASE    + 0x0700UL)
#define MR_SUBG_GLOB_RETAINED_BASE (MR_SUBG_BASE    + 0x0780UL)
#if defined (STM32WL3XX)
#define LPAWUR_BASE                (APB2PERIPH_BASE + 0x1000UL)
#endif /* (STM32WL3XX) */


/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */


/* Peripherals available on APB0 bus */
#define SYSCFG                      ((SYSCFG_TypeDef*)           SYSCFG_BASE)
#define FLASH                       ((FLASH_TypeDef*)           FLASH_R_BASE)
#define TIM2                        ((TIM_TypeDef*)                TIM2_BASE)
#define IWDG                        ((IWDG_TypeDef*)               IWDG_BASE)
#define RTC                         ((RTC_TypeDef*)                 RTC_BASE)
#define TIM16                       ((TIM_TypeDef*)               TIM16_BASE)
#if defined (STM32WL3XX)
#define DAC1                        ((DAC_TypeDef*)                DAC1_BASE)
#define LCD                         ((LCD_TypeDef*)                 LCD_BASE)
#endif /* (STM32WL3XX) */
#define DBGMCU                      ((DBGMCU_TypeDef*)           DBGMCU_BASE)
#if defined (STM32WL3XX)
#define COMP1                       ((COMP_TypeDef*)               COMP_BASE)
#define LCSC                        ((LCSC_TypeDef*)               LCSC_BASE)
#endif /* (STM32WL3XX) */

