stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* Peripherals available on APB1 bus */
#define I2C1                        ((I2C_TypeDef*)                I2C1_BASE)
#if defined (STM32WL3XX)
#define I2C2                        ((I2C_TypeDef*)                I2C2_BASE)
#define SPI1                        ((SPI_TypeDef*)                SPI1_BASE)
#endif /* (STM32WL3XX) */
#define USART1                      ((USART_TypeDef*)            USART1_BASE)
#define LPUART1                     ((USART_TypeDef*)           LPUART1_BASE)
#define ADC1                        ((ADC_TypeDef*)                ADC1_BASE)
#define SPI3                        ((SPI_TypeDef*)                SPI3_BASE)

/* Peripherals available on AHB bus */
#define GPIOA                       ((GPIO_TypeDef*)                                  GPIOA_BASE)
#define GPIOB                       ((GPIO_TypeDef*)                                  GPIOB_BASE)
#define CRC                         ((CRC_TypeDef*)                                     CRC_BASE)
#define RCC                         ((RCC_TypeDef*)                                     RCC_BASE)
#define PWR                         ((PWR_TypeDef*)                                     PWR_BASE)
#define RNG                         ((RNG_TypeDef*)                                     RNG_BASE)
#define DMA1                        ((DMA_TypeDef*)                                    DMA1_BASE)
#define DMA1_Channel1               ((DMA_Channel_TypeDef *)                  DMA1_Channel1_BASE)
#define DMA1_Channel2               ((DMA_Channel_TypeDef *)                  DMA1_Channel2_BASE)
#define DMA1_Channel3               ((DMA_Channel_TypeDef *)                  DMA1_Channel3_BASE)
#define DMA1_Channel4               ((DMA_Channel_TypeDef *)                  DMA1_Channel4_BASE)
#define DMA1_Channel5               ((DMA_Channel_TypeDef *)                  DMA1_Channel5_BASE)
#define DMA1_Channel6               ((DMA_Channel_TypeDef *)                  DMA1_Channel6_BASE)
#define DMA1_Channel7               ((DMA_Channel_TypeDef *)                  DMA1_Channel7_BASE)
#define DMA1_Channel8               ((DMA_Channel_TypeDef *)                  DMA1_Channel8_BASE)
#define DMAMUX1                     ((DMAMUX_Channel_TypeDef *)                     DMAMUX1_BASE)
#define DMAMUX1_Channel0            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel7_BASE)
#define AES                         ((AES_TypeDef*)                                     AES_BASE)

/* Peripherals available on APB2 bus */
#define MR_SUBG_RADIO               ((MR_SUBG_RADIO_TypeDef*)                 MR_SUBG_RADIO_BASE)
#define MR_SUBG_GLOB_STATIC         ((MR_SUBG_GLOB_STATIC_TypeDef*)     MR_SUBG_GLOB_STATIC_BASE)
#define MR_SUBG_GLOB_DYNAMIC        ((MR_SUBG_GLOB_DYNAMIC_TypeDef*)   MR_SUBG_GLOB_DYNAMIC_BASE)
#define MR_SUBG_GLOB_STATUS         ((MR_SUBG_GLOB_STATUS_TypeDef*)     MR_SUBG_GLOB_STATUS_BASE)
#define MR_SUBG_GLOB_MISC           ((MR_SUBG_GLOB_MISC_TypeDef*)         MR_SUBG_GLOB_MISC_BASE)
#define MR_SUBG_GLOB_RETAINED       ((MR_SUBG_GLOB_RETAINED_TypeDef*) MR_SUBG_GLOB_RETAINED_BASE)
#if defined (STM32WL3XX)
#define LPAWUR                      ((LPAWUR_TypeDef*)                               LPAWUR_BASE)
#endif /* (STM32WL3XX) */

/** @} */ /* End of group Device_Peripheral_declaration */

/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */

/* ============================================================================================================================*/
/*=====================                                      SYSCFG                                      =====================*/
/* ============================================================================================================================*/

/* =====================================================    DIE_ID    =====================================================*/
#define SYSCFG_DIE_ID_PRODUCT_Pos                                          (8UL)        /*!<SYSCFG DIE_ID: PRODUCT (Bit 8) */
#define SYSCFG_DIE_ID_PRODUCT_Msk                                          (0xf00UL)        /*!< SYSCFG DIE_ID: PRODUCT (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_PRODUCT                                              SYSCFG_DIE_ID_PRODUCT_Msk
#define SYSCFG_DIE_ID_PRODUCT_0                                            (0x1U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_1                                            (0x2U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_2                                            (0x4U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_3                                            (0x8U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_VERSION_Pos                                          (4UL)        /*!<SYSCFG DIE_ID: VERSION (Bit 4) */
#define SYSCFG_DIE_ID_VERSION_Msk                                          (0xf0UL)        /*!< SYSCFG DIE_ID: VERSION (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_VERSION                                              SYSCFG_DIE_ID_VERSION_Msk
#define SYSCFG_DIE_ID_VERSION_0                                            (0x1U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_1                                            (0x2U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_2                                            (0x4U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_3                                            (0x8U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_REVISION_Pos                                         (0UL)        /*!<SYSCFG DIE_ID: REVISION (Bit 0) */
#define SYSCFG_DIE_ID_REVISION_Msk                                         (0xfUL)        /*!< SYSCFG DIE_ID: REVISION (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_REVISION                                             SYSCFG_DIE_ID_REVISION_Msk
#define SYSCFG_DIE_ID_REVISION_0                                           (0x1U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_1                                           (0x2U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_2                                           (0x4U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_3                                           (0x8U << SYSCFG_DIE_ID_REVISION_Pos)

/* =====================================================    JTAG_ID    =====================================================*/
#define SYSCFG_JTAG_ID_VERSION_NUMBER_Pos                                  (28UL)        /*!<SYSCFG JTAG_ID: VERSION_NUMBER (Bit 28) */
#define SYSCFG_JTAG_ID_VERSION_NUMBER_Msk                                  (0xf0000000UL)        /*!< SYSCFG JTAG_ID: VERSION_NUMBER (Bitfield-Mask: 0x0f) */
#define SYSCFG_JTAG_ID_VERSION_NUMBER                                      SYSCFG_JTAG_ID_VERSION_NUMBER_Msk
#define SYSCFG_JTAG_ID_VERSION_NUMBER_0                                    (0x1U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_1                                    (0x2U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_2                                    (0x4U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_3                                    (0x8U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_Pos                                     (12UL)        /*!<SYSCFG JTAG_ID: PART_NUMBER (Bit 12) */
#define SYSCFG_JTAG_ID_PART_NUMBER_Msk                                     (0xffff000UL)        /*!< SYSCFG JTAG_ID: PART_NUMBER (Bitfield-Mask: 0xffff) */
#define SYSCFG_JTAG_ID_PART_NUMBER                                         SYSCFG_JTAG_ID_PART_NUMBER_Msk
#define SYSCFG_JTAG_ID_PART_NUMBER_0                                       (0x1U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_1                                       (0x2U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_2                                       (0x4U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_3                                       (0x8U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_4                                       (0x10U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_5                                       (0x20U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_6                                       (0x40U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_7                                       (0x80U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_8                                       (0x100U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_9                                       (0x200U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_10                                      (0x400U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_11                                      (0x800U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_12                                      (0x1000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_13                                      (0x2000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_14                                      (0x4000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_15                                      (0x8000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_Pos                                        (1UL)        /*!<SYSCFG JTAG_ID: MANUF_ID (Bit 1) */
#define SYSCFG_JTAG_ID_MANUF_ID_Msk                                        (0xffeUL)        /*!< SYSCFG JTAG_ID: MANUF_ID (Bitfield-Mask: 0x7ff) */
#define SYSCFG_JTAG_ID_MANUF_ID                                            SYSCFG_JTAG_ID_MANUF_ID_Msk
#define SYSCFG_JTAG_ID_MANUF_ID_0                                          (0x1U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_1                                          (0x2U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_2                                          (0x4U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_3                                          (0x8U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_4                                          (0x10U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_5                                          (0x20U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_6                                          (0x40U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_7                                          (0x80U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_8                                          (0x100U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_9                                          (0x200U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_10                                         (0x400U << SYSCFG_JTAG_ID_MANUF_ID_Pos)

/* =====================================================    I2C_FMP_CTRL    =====================================================*/
#if defined (STM32WL3XX)
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP_Pos                              (9UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C2_PA14_FMP (Bit 9) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP_Msk                              (0x200UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C2_PA14_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP                                  SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP_Pos                              (8UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C2_PA13_FMP (Bit 8) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP_Msk                              (0x100UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C2_PA13_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP                                  SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP_Pos                               (7UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C2_PA7_FMP (Bit 7) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP_Msk                               (0x80UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C2_PA7_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP_Pos                               (6UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C2_PA6_FMP (Bit 6) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP_Msk                               (0x40UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C2_PA6_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP_Msk
#endif /* (STM32WL3XX) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP_Pos                              (5UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB11_FMP (Bit 5) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP_Msk                              (0x20UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB11_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP                                  SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP_Pos                              (4UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB10_FMP (Bit 4) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP_Msk                              (0x10UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB10_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP                                  SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Pos                               (3UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB7_FMP (Bit 3) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Msk                               (0x8UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB7_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Pos                               (2UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB6_FMP (Bit 2) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Msk                               (0x4UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB6_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Pos                               (1UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PA1_FMP (Bit 1) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Msk                               (0x2UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PA1_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Pos                               (0UL)        /*!<SYSCFG I2C_FMP_CTRL: I2C1_PA0_FMP (Bit 0) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Msk                               (0x1UL)        /*!< SYSCFG I2C_FMP_CTRL: I2C1_PA0_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Msk

