stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    ISR    =====================================================*/
#define RTC_ISR_ITSF_Pos                                                   (17UL)        /*!<RTC ISR: ITSF (Bit 17) */
#define RTC_ISR_ITSF_Msk                                                   (0x20000UL)        /*!< RTC ISR: ITSF (Bitfield-Mask: 0x01) */
#define RTC_ISR_ITSF                                                       RTC_ISR_ITSF_Msk
#define RTC_ISR_RECALPF_Pos                                                (16UL)        /*!<RTC ISR: RECALPF (Bit 16) */
#define RTC_ISR_RECALPF_Msk                                                (0x10000UL)        /*!< RTC ISR: RECALPF (Bitfield-Mask: 0x01) */
#define RTC_ISR_RECALPF                                                    RTC_ISR_RECALPF_Msk
#define RTC_ISR_TAMP1F_Pos                                                 (13UL)        /*!<RTC ISR: TAMP1F (Bit 13) */
#define RTC_ISR_TAMP1F_Msk                                                 (0x2000UL)        /*!< RTC ISR: TAMP1F (Bitfield-Mask: 0x01) */
#define RTC_ISR_TAMP1F                                                     RTC_ISR_TAMP1F_Msk
#define RTC_ISR_TSOVF_Pos                                                  (12UL)        /*!<RTC ISR: TSOVF (Bit 12) */
#define RTC_ISR_TSOVF_Msk                                                  (0x1000UL)        /*!< RTC ISR: TSOVF (Bitfield-Mask: 0x01) */
#define RTC_ISR_TSOVF                                                      RTC_ISR_TSOVF_Msk
#define RTC_ISR_TSF_Pos                                                    (11UL)        /*!<RTC ISR: TSF (Bit 11) */
#define RTC_ISR_TSF_Msk                                                    (0x800UL)        /*!< RTC ISR: TSF (Bitfield-Mask: 0x01) */
#define RTC_ISR_TSF                                                        RTC_ISR_TSF_Msk
#define RTC_ISR_WUTF_Pos                                                   (10UL)        /*!<RTC ISR: WUTF (Bit 10) */
#define RTC_ISR_WUTF_Msk                                                   (0x400UL)        /*!< RTC ISR: WUTF (Bitfield-Mask: 0x01) */
#define RTC_ISR_WUTF                                                       RTC_ISR_WUTF_Msk
#define RTC_ISR_ALRAF_Pos                                                  (8UL)        /*!<RTC ISR: ALRAF (Bit 8) */
#define RTC_ISR_ALRAF_Msk                                                  (0x100UL)        /*!< RTC ISR: ALRAF (Bitfield-Mask: 0x01) */
#define RTC_ISR_ALRAF                                                      RTC_ISR_ALRAF_Msk
#define RTC_ISR_INIT_Pos                                                   (7UL)        /*!<RTC ISR: INIT (Bit 7) */
#define RTC_ISR_INIT_Msk                                                   (0x80UL)        /*!< RTC ISR: INIT (Bitfield-Mask: 0x01) */
#define RTC_ISR_INIT                                                       RTC_ISR_INIT_Msk
#define RTC_ISR_INITF_Pos                                                  (6UL)        /*!<RTC ISR: INITF (Bit 6) */
#define RTC_ISR_INITF_Msk                                                  (0x40UL)        /*!< RTC ISR: INITF (Bitfield-Mask: 0x01) */
#define RTC_ISR_INITF                                                      RTC_ISR_INITF_Msk
#define RTC_ISR_RSF_Pos                                                    (5UL)        /*!<RTC ISR: RSF (Bit 5) */
#define RTC_ISR_RSF_Msk                                                    (0x20UL)        /*!< RTC ISR: RSF (Bitfield-Mask: 0x01) */
#define RTC_ISR_RSF                                                        RTC_ISR_RSF_Msk
#define RTC_ISR_INITS_Pos                                                  (4UL)        /*!<RTC ISR: INITS (Bit 4) */
#define RTC_ISR_INITS_Msk                                                  (0x10UL)        /*!< RTC ISR: INITS (Bitfield-Mask: 0x01) */
#define RTC_ISR_INITS                                                      RTC_ISR_INITS_Msk
#define RTC_ISR_SHPF_Pos                                                   (3UL)        /*!<RTC ISR: SHPF (Bit 3) */
#define RTC_ISR_SHPF_Msk                                                   (0x8UL)        /*!< RTC ISR: SHPF (Bitfield-Mask: 0x01) */
#define RTC_ISR_SHPF                                                       RTC_ISR_SHPF_Msk
#define RTC_ISR_WUTWF_Pos                                                  (2UL)        /*!<RTC ISR: WUTWF (Bit 2) */
#define RTC_ISR_WUTWF_Msk                                                  (0x4UL)        /*!< RTC ISR: WUTWF (Bitfield-Mask: 0x01) */
#define RTC_ISR_WUTWF                                                      RTC_ISR_WUTWF_Msk
#define RTC_ISR_ALRAWF_Pos                                                 (0UL)        /*!<RTC ISR: ALRAWF (Bit 0) */
#define RTC_ISR_ALRAWF_Msk                                                 (0x1UL)        /*!< RTC ISR: ALRAWF (Bitfield-Mask: 0x01) */
#define RTC_ISR_ALRAWF                                                     RTC_ISR_ALRAWF_Msk

/* =====================================================    PRER    =====================================================*/
#define RTC_PRER_PREDIV_A_Pos                                              (16UL)        /*!<RTC PRER: PREDIV_A (Bit 16) */
#define RTC_PRER_PREDIV_A_Msk                                              (0x7f0000UL)        /*!< RTC PRER: PREDIV_A (Bitfield-Mask: 0x7f) */
#define RTC_PRER_PREDIV_A                                                  RTC_PRER_PREDIV_A_Msk
#define RTC_PRER_PREDIV_A_0                                                (0x1U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_1                                                (0x2U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_2                                                (0x4U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_3                                                (0x8U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_4                                                (0x10U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_5                                                (0x20U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_6                                                (0x40U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_S_Pos                                              (0UL)        /*!<RTC PRER: PREDIV_S (Bit 0) */
#define RTC_PRER_PREDIV_S_Msk                                              (0x7fffUL)        /*!< RTC PRER: PREDIV_S (Bitfield-Mask: 0x7fff) */
#define RTC_PRER_PREDIV_S                                                  RTC_PRER_PREDIV_S_Msk
#define RTC_PRER_PREDIV_S_0                                                (0x1U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_1                                                (0x2U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_2                                                (0x4U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_3                                                (0x8U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_4                                                (0x10U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_5                                                (0x20U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_6                                                (0x40U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_7                                                (0x80U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_8                                                (0x100U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_9                                                (0x200U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_10                                               (0x400U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_11                                               (0x800U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_12                                               (0x1000U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_13                                               (0x2000U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_14                                               (0x4000U << RTC_PRER_PREDIV_S_Pos)

/* =====================================================    WUTR    =====================================================*/
#define RTC_WUTR_WUT_Pos                                                   (0UL)        /*!<RTC WUTR: WUT (Bit 0) */
#define RTC_WUTR_WUT_Msk                                                   (0xffffUL)        /*!< RTC WUTR: WUT (Bitfield-Mask: 0xffff) */
#define RTC_WUTR_WUT                                                       RTC_WUTR_WUT_Msk
#define RTC_WUTR_WUT_0                                                     (0x1U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_1                                                     (0x2U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_2                                                     (0x4U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_3                                                     (0x8U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_4                                                     (0x10U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_5                                                     (0x20U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_6                                                     (0x40U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_7                                                     (0x80U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_8                                                     (0x100U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_9                                                     (0x200U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_10                                                    (0x400U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_11                                                    (0x800U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_12                                                    (0x1000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_13                                                    (0x2000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_14                                                    (0x4000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_15                                                    (0x8000U << RTC_WUTR_WUT_Pos)

