stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    CLR    =====================================================*/
#define LCD_CLR_UDDC_Pos                                                   (3UL)        /*!<LCD CLR: UDDC (Bit 3) */
#define LCD_CLR_UDDC_Msk                                                   (0x8UL)        /*!< LCD CLR: UDDC (Bitfield-Mask: 0x01) */
#define LCD_CLR_UDDC                                                       LCD_CLR_UDDC_Msk
#define LCD_CLR_SOFC_Pos                                                   (1UL)        /*!<LCD CLR: SOFC (Bit 1) */
#define LCD_CLR_SOFC_Msk                                                   (0x2UL)        /*!< LCD CLR: SOFC (Bitfield-Mask: 0x01) */
#define LCD_CLR_SOFC                                                       LCD_CLR_SOFC_Msk

/* =====================================================    RAM_COM0    =====================================================*/
#define LCD_RAM_COM0_SEGMENT_DATA_Pos                                      (0UL)        /*!<LCD RAM_COM0: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM0_SEGMENT_DATA_Msk                                      (0xffffUL)        /*!< LCD RAM_COM0: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM0_SEGMENT_DATA                                          LCD_RAM_COM0_SEGMENT_DATA_Msk
#define LCD_RAM_COM0_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_12                                       (0x1000U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_13                                       (0x2000U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_14                                       (0x4000U << LCD_RAM_COM0_SEGMENT_DATA_Pos)
#define LCD_RAM_COM0_SEGMENT_DATA_15                                       (0x8000U << LCD_RAM_COM0_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM1    =====================================================*/
#define LCD_RAM_COM1_SEGMENT_DATA_Pos                                      (0UL)        /*!<LCD RAM_COM1: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM1_SEGMENT_DATA_Msk                                      (0xffffUL)        /*!< LCD RAM_COM1: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM1_SEGMENT_DATA                                          LCD_RAM_COM1_SEGMENT_DATA_Msk
#define LCD_RAM_COM1_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_12                                       (0x1000U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_13                                       (0x2000U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_14                                       (0x4000U << LCD_RAM_COM1_SEGMENT_DATA_Pos)
#define LCD_RAM_COM1_SEGMENT_DATA_15                                       (0x8000U << LCD_RAM_COM1_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM2    =====================================================*/
#define LCD_RAM_COM2_SEGMENT_DATA_Pos                                      (0UL)        /*!<LCD RAM_COM2: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM2_SEGMENT_DATA_Msk                                      (0xffffUL)        /*!< LCD RAM_COM2: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM2_SEGMENT_DATA                                          LCD_RAM_COM2_SEGMENT_DATA_Msk
#define LCD_RAM_COM2_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_12                                       (0x1000U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_13                                       (0x2000U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_14                                       (0x4000U << LCD_RAM_COM2_SEGMENT_DATA_Pos)
#define LCD_RAM_COM2_SEGMENT_DATA_15                                       (0x8000U << LCD_RAM_COM2_SEGMENT_DATA_Pos)

