stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* ============================================================================================================================*/
/*=====================                                        DAC                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define DAC_CR_VCMON_Pos                                                   (16UL)        /*!<DAC CR: VCMON (Bit 16) */
#define DAC_CR_VCMON_Msk                                                   (0x10000UL)        /*!< DAC CR: VCMON (Bitfield-Mask: 0x01) */
#define DAC_CR_VCMON                                                       DAC_CR_VCMON_Msk
#define DAC_CR_VCMEN_Pos                                                   (15UL)        /*!<DAC CR: VCMEN (Bit 15) */
#define DAC_CR_VCMEN_Msk                                                   (0x8000UL)        /*!< DAC CR: VCMEN (Bitfield-Mask: 0x01) */
#define DAC_CR_VCMEN                                                       DAC_CR_VCMEN_Msk
#define DAC_CR_CMPEN_Pos                                                   (14UL)        /*!<DAC CR: CMPEN (Bit 14) */
#define DAC_CR_CMPEN_Msk                                                   (0x4000UL)        /*!< DAC CR: CMPEN (Bitfield-Mask: 0x01) */
#define DAC_CR_CMPEN                                                       DAC_CR_CMPEN_Msk
#define DAC_CR_DMAUDRIE_Pos                                                (13UL)        /*!<DAC CR: DMAUDRIE (Bit 13) */
#define DAC_CR_DMAUDRIE_Msk                                                (0x2000UL)        /*!< DAC CR: DMAUDRIE (Bitfield-Mask: 0x01) */
#define DAC_CR_DMAUDRIE                                                    DAC_CR_DMAUDRIE_Msk
#define DAC_CR_DMAEN_Pos                                                   (12UL)        /*!<DAC CR: DMAEN (Bit 12) */
#define DAC_CR_DMAEN_Msk                                                   (0x1000UL)        /*!< DAC CR: DMAEN (Bitfield-Mask: 0x01) */
#define DAC_CR_DMAEN                                                       DAC_CR_DMAEN_Msk
#define DAC_CR_MAMP_Pos                                                    (8UL)        /*!<DAC CR: MAMP (Bit 8) */
#define DAC_CR_MAMP_Msk                                                    (0xf00UL)        /*!< DAC CR: MAMP (Bitfield-Mask: 0x0f) */
#define DAC_CR_MAMP                                                        DAC_CR_MAMP_Msk
#define DAC_CR_MAMP_0                                                      (0x1U << DAC_CR_MAMP_Pos)
#define DAC_CR_MAMP_1                                                      (0x2U << DAC_CR_MAMP_Pos)
#define DAC_CR_MAMP_2                                                      (0x4U << DAC_CR_MAMP_Pos)
#define DAC_CR_MAMP_3                                                      (0x8U << DAC_CR_MAMP_Pos)
#define DAC_CR_WAVE_Pos                                                    (6UL)        /*!<DAC CR: WAVE (Bit 6) */
#define DAC_CR_WAVE_Msk                                                    (0xc0UL)        /*!< DAC CR: WAVE (Bitfield-Mask: 0x03) */
#define DAC_CR_WAVE                                                        DAC_CR_WAVE_Msk
#define DAC_CR_WAVE_0                                                      (0x1U << DAC_CR_WAVE_Pos)
#define DAC_CR_WAVE_1                                                      (0x2U << DAC_CR_WAVE_Pos)
#define DAC_CR_TSEL_Pos                                                    (3UL)        /*!<DAC CR: TSEL (Bit 3) */
#define DAC_CR_TSEL_Msk                                                    (0x38UL)        /*!< DAC CR: TSEL (Bitfield-Mask: 0x07) */
#define DAC_CR_TSEL                                                        DAC_CR_TSEL_Msk
#define DAC_CR_TSEL_0                                                      (0x1U << DAC_CR_TSEL_Pos)
#define DAC_CR_TSEL_1                                                      (0x2U << DAC_CR_TSEL_Pos)
#define DAC_CR_TSEL_2                                                      (0x4U << DAC_CR_TSEL_Pos)
#define DAC_CR_TEN_Pos                                                     (2UL)        /*!<DAC CR: TEN (Bit 2) */
#define DAC_CR_TEN_Msk                                                     (0x4UL)        /*!< DAC CR: TEN (Bitfield-Mask: 0x01) */
#define DAC_CR_TEN                                                         DAC_CR_TEN_Msk
#define DAC_CR_BON_Pos                                                     (1UL)        /*!<DAC CR: BON (Bit 1) */
#define DAC_CR_BON_Msk                                                     (0x2UL)        /*!< DAC CR: BON (Bitfield-Mask: 0x01) */
#define DAC_CR_BON                                                         DAC_CR_BON_Msk
#define DAC_CR_EN_Pos                                                      (0UL)        /*!<DAC CR: EN (Bit 0) */
#define DAC_CR_EN_Msk                                                      (0x1UL)        /*!< DAC CR: EN (Bitfield-Mask: 0x01) */
#define DAC_CR_EN                                                          DAC_CR_EN_Msk

/* =====================================================    SWTRIGR    =====================================================*/
#define DAC_SWTRIGR_SWTRIG_Pos                                             (0UL)        /*!<DAC SWTRIGR: SWTRIG (Bit 0) */
#define DAC_SWTRIGR_SWTRIG_Msk                                             (0x1UL)        /*!< DAC SWTRIGR: SWTRIG (Bitfield-Mask: 0x01) */
#define DAC_SWTRIGR_SWTRIG                                                 DAC_SWTRIGR_SWTRIG_Msk

/* =====================================================    DHR    =====================================================*/
#define DAC_DHR_DACDHR_Pos                                                 (0UL)        /*!<DAC DHR: DACDHR (Bit 0) */
#define DAC_DHR_DACDHR_Msk                                                 (0x3fUL)        /*!< DAC DHR: DACDHR (Bitfield-Mask: 0x3f) */
#define DAC_DHR_DACDHR                                                     DAC_DHR_DACDHR_Msk
#define DAC_DHR_DACDHR_0                                                   (0x1U << DAC_DHR_DACDHR_Pos)
#define DAC_DHR_DACDHR_1                                                   (0x2U << DAC_DHR_DACDHR_Pos)
#define DAC_DHR_DACDHR_2                                                   (0x4U << DAC_DHR_DACDHR_Pos)
#define DAC_DHR_DACDHR_3                                                   (0x8U << DAC_DHR_DACDHR_Pos)
#define DAC_DHR_DACDHR_4                                                   (0x10U << DAC_DHR_DACDHR_Pos)
#define DAC_DHR_DACDHR_5                                                   (0x20U << DAC_DHR_DACDHR_Pos)

/* =====================================================    DOR    =====================================================*/
#define DAC_DOR_DACDOR_Pos                                                 (0UL)        /*!<DAC DOR: DACDOR (Bit 0) */
#define DAC_DOR_DACDOR_Msk                                                 (0x3fUL)        /*!< DAC DOR: DACDOR (Bitfield-Mask: 0x3f) */
#define DAC_DOR_DACDOR                                                     DAC_DOR_DACDOR_Msk
#define DAC_DOR_DACDOR_0                                                   (0x1U << DAC_DOR_DACDOR_Pos)
#define DAC_DOR_DACDOR_1                                                   (0x2U << DAC_DOR_DACDOR_Pos)
#define DAC_DOR_DACDOR_2                                                   (0x4U << DAC_DOR_DACDOR_Pos)
#define DAC_DOR_DACDOR_3                                                   (0x8U << DAC_DOR_DACDOR_Pos)
#define DAC_DOR_DACDOR_4                                                   (0x10U << DAC_DOR_DACDOR_Pos)
#define DAC_DOR_DACDOR_5                                                   (0x20U << DAC_DOR_DACDOR_Pos)

/* =====================================================    SR    =====================================================*/
#define DAC_SR_DMAUDR_Pos                                                  (13UL)        /*!<DAC SR: DMAUDR (Bit 13) */
#define DAC_SR_DMAUDR_Msk                                                  (0x2000UL)        /*!< DAC SR: DMAUDR (Bitfield-Mask: 0x01) */
#define DAC_SR_DMAUDR                                                      DAC_SR_DMAUDR_Msk


