stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    ENR    =====================================================*/
#define LCSC_ENR_LCSC_EN_Pos                                               (31UL)        /*!<LCSC ENR: LCSC_EN (Bit 31) */
#define LCSC_ENR_LCSC_EN_Msk                                               (0x80000000UL)        /*!< LCSC ENR: LCSC_EN (Bitfield-Mask: 0x01) */
#define LCSC_ENR_LCSC_EN                                                   LCSC_ENR_LCSC_EN_Msk
#define LCSC_ENR_CNT_OFB_WKP_IE_Pos                                        (3UL)        /*!<LCSC ENR: CNT_OFB_WKP_IE (Bit 3) */
#define LCSC_ENR_CNT_OFB_WKP_IE_Msk                                        (0x8UL)        /*!< LCSC ENR: CNT_OFB_WKP_IE (Bitfield-Mask: 0x01) */
#define LCSC_ENR_CNT_OFB_WKP_IE                                            LCSC_ENR_CNT_OFB_WKP_IE_Msk
#define LCSC_ENR_TAMP_IE_Pos                                               (2UL)        /*!<LCSC ENR: TAMP_IE (Bit 2) */
#define LCSC_ENR_TAMP_IE_Msk                                               (0x4UL)        /*!< LCSC ENR: TAMP_IE (Bitfield-Mask: 0x01) */
#define LCSC_ENR_TAMP_IE                                                   LCSC_ENR_TAMP_IE_Msk
#define LCSC_ENR_ACLKWISE_IE_Pos                                           (1UL)        /*!<LCSC ENR: ACLKWISE_IE (Bit 1) */
#define LCSC_ENR_ACLKWISE_IE_Msk                                           (0x2UL)        /*!< LCSC ENR: ACLKWISE_IE (Bitfield-Mask: 0x01) */
#define LCSC_ENR_ACLKWISE_IE                                               LCSC_ENR_ACLKWISE_IE_Msk
#define LCSC_ENR_CLKWISE_IE_Pos                                            (0UL)        /*!<LCSC ENR: CLKWISE_IE (Bit 0) */
#define LCSC_ENR_CLKWISE_IE_Msk                                            (0x1UL)        /*!< LCSC ENR: CLKWISE_IE (Bitfield-Mask: 0x01) */
#define LCSC_ENR_CLKWISE_IE                                                LCSC_ENR_CLKWISE_IE_Msk

/* =====================================================    WHEEL_SR    =====================================================*/
#define LCSC_WHEEL_SR_ACLKWISE_Pos                                         (16UL)        /*!<LCSC WHEEL_SR: ACLKWISE (Bit 16) */
#define LCSC_WHEEL_SR_ACLKWISE_Msk                                         (0xffff0000UL)        /*!< LCSC WHEEL_SR: ACLKWISE (Bitfield-Mask: 0xffff) */
#define LCSC_WHEEL_SR_ACLKWISE                                             LCSC_WHEEL_SR_ACLKWISE_Msk
#define LCSC_WHEEL_SR_ACLKWISE_0                                           (0x1U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_1                                           (0x2U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_2                                           (0x4U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_3                                           (0x8U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_4                                           (0x10U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_5                                           (0x20U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_6                                           (0x40U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_7                                           (0x80U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_8                                           (0x100U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_9                                           (0x200U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_10                                          (0x400U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_11                                          (0x800U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_12                                          (0x1000U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_13                                          (0x2000U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_14                                          (0x4000U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_ACLKWISE_15                                          (0x8000U << LCSC_WHEEL_SR_ACLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_Pos                                          (0UL)        /*!<LCSC WHEEL_SR: CLKWISE (Bit 0) */
#define LCSC_WHEEL_SR_CLKWISE_Msk                                          (0xffffUL)        /*!< LCSC WHEEL_SR: CLKWISE (Bitfield-Mask: 0xffff) */
#define LCSC_WHEEL_SR_CLKWISE                                              LCSC_WHEEL_SR_CLKWISE_Msk
#define LCSC_WHEEL_SR_CLKWISE_0                                            (0x1U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_1                                            (0x2U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_2                                            (0x4U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_3                                            (0x8U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_4                                            (0x10U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_5                                            (0x20U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_6                                            (0x40U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_7                                            (0x80U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_8                                            (0x100U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_9                                            (0x200U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_10                                           (0x400U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_11                                           (0x800U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_12                                           (0x1000U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_13                                           (0x2000U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_14                                           (0x4000U << LCSC_WHEEL_SR_CLKWISE_Pos)
#define LCSC_WHEEL_SR_CLKWISE_15                                           (0x8000U << LCSC_WHEEL_SR_CLKWISE_Pos)

/* =====================================================    CONFR    =====================================================*/
#define LCSC_CONFR_ACLKWISE_THRES_Pos                                      (16UL)        /*!<LCSC CONFR: ACLKWISE_THRES (Bit 16) */
#define LCSC_CONFR_ACLKWISE_THRES_Msk                                      (0xffff0000UL)        /*!< LCSC CONFR: ACLKWISE_THRES (Bitfield-Mask: 0xffff) */
#define LCSC_CONFR_ACLKWISE_THRES                                          LCSC_CONFR_ACLKWISE_THRES_Msk
#define LCSC_CONFR_ACLKWISE_THRES_0                                        (0x1U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_1                                        (0x2U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_2                                        (0x4U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_3                                        (0x8U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_4                                        (0x10U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_5                                        (0x20U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_6                                        (0x40U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_7                                        (0x80U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_8                                        (0x100U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_9                                        (0x200U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_10                                       (0x400U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_11                                       (0x800U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_12                                       (0x1000U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_13                                       (0x2000U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_14                                       (0x4000U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_ACLKWISE_THRES_15                                       (0x8000U << LCSC_CONFR_ACLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_Pos                                       (0UL)        /*!<LCSC CONFR: CLKWISE_THRES (Bit 0) */
#define LCSC_CONFR_CLKWISE_THRES_Msk                                       (0xffffUL)        /*!< LCSC CONFR: CLKWISE_THRES (Bitfield-Mask: 0xffff) */
#define LCSC_CONFR_CLKWISE_THRES                                           LCSC_CONFR_CLKWISE_THRES_Msk
#define LCSC_CONFR_CLKWISE_THRES_0                                         (0x1U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_1                                         (0x2U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_2                                         (0x4U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_3                                         (0x8U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_4                                         (0x10U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_5                                         (0x20U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_6                                         (0x40U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_7                                         (0x80U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_8                                         (0x100U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_9                                         (0x200U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_10                                        (0x400U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_11                                        (0x800U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_12                                        (0x1000U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_13                                        (0x2000U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_14                                        (0x4000U << LCSC_CONFR_CLKWISE_THRES_Pos)
#define LCSC_CONFR_CLKWISE_THRES_15                                        (0x8000U << LCSC_CONFR_CLKWISE_THRES_Pos)

/* =====================================================    COMP_CNT    =====================================================*/
#define LCSC_COMP_CNT_CMP_LCT_CNT_Pos                                      (20UL)        /*!<LCSC COMP_CNT: CMP_LCT_CNT (Bit 20) */
#define LCSC_COMP_CNT_CMP_LCT_CNT_Msk                                      (0xff00000UL)        /*!< LCSC COMP_CNT: CMP_LCT_CNT (Bitfield-Mask: 0xff) */
#define LCSC_COMP_CNT_CMP_LCT_CNT                                          LCSC_COMP_CNT_CMP_LCT_CNT_Msk
#define LCSC_COMP_CNT_CMP_LCT_CNT_0                                        (0x1U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_1                                        (0x2U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_2                                        (0x4U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_3                                        (0x8U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_4                                        (0x10U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_5                                        (0x20U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_6                                        (0x40U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCT_CNT_7                                        (0x80U << LCSC_COMP_CNT_CMP_LCT_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_Pos                                      (10UL)        /*!<LCSC COMP_CNT: CMP_LCB_CNT (Bit 10) */
#define LCSC_COMP_CNT_CMP_LCB_CNT_Msk                                      (0x3fc00UL)        /*!< LCSC COMP_CNT: CMP_LCB_CNT (Bitfield-Mask: 0xff) */
#define LCSC_COMP_CNT_CMP_LCB_CNT                                          LCSC_COMP_CNT_CMP_LCB_CNT_Msk
#define LCSC_COMP_CNT_CMP_LCB_CNT_0                                        (0x1U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_1                                        (0x2U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_2                                        (0x4U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_3                                        (0x8U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_4                                        (0x10U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_5                                        (0x20U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_6                                        (0x40U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCB_CNT_7                                        (0x80U << LCSC_COMP_CNT_CMP_LCB_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_Pos                                      (0UL)        /*!<LCSC COMP_CNT: CMP_LCA_CNT (Bit 0) */
#define LCSC_COMP_CNT_CMP_LCA_CNT_Msk                                      (0xffUL)        /*!< LCSC COMP_CNT: CMP_LCA_CNT (Bitfield-Mask: 0xff) */
#define LCSC_COMP_CNT_CMP_LCA_CNT                                          LCSC_COMP_CNT_CMP_LCA_CNT_Msk
#define LCSC_COMP_CNT_CMP_LCA_CNT_0                                        (0x1U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_1                                        (0x2U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_2                                        (0x4U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_3                                        (0x8U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_4                                        (0x10U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_5                                        (0x20U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_6                                        (0x40U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)
#define LCSC_COMP_CNT_CMP_LCA_CNT_7                                        (0x80U << LCSC_COMP_CNT_CMP_LCA_CNT_Pos)

/* =====================================================    SR    =====================================================*/
#define LCSC_SR_LAST_DIR_Pos                                               (4UL)        /*!<LCSC SR: LAST_DIR (Bit 4) */
#define LCSC_SR_LAST_DIR_Msk                                               (0x30UL)        /*!< LCSC SR: LAST_DIR (Bitfield-Mask: 0x03) */
#define LCSC_SR_LAST_DIR                                                   LCSC_SR_LAST_DIR_Msk
#define LCSC_SR_LAST_DIR_0                                                 (0x1U << LCSC_SR_LAST_DIR_Pos)
#define LCSC_SR_LAST_DIR_1                                                 (0x2U << LCSC_SR_LAST_DIR_Pos)
#define LCSC_SR_ACLKWISE_STATE_Pos                                         (2UL)        /*!<LCSC SR: ACLKWISE_STATE (Bit 2) */
#define LCSC_SR_ACLKWISE_STATE_Msk                                         (0xcUL)        /*!< LCSC SR: ACLKWISE_STATE (Bitfield-Mask: 0x03) */
#define LCSC_SR_ACLKWISE_STATE                                             LCSC_SR_ACLKWISE_STATE_Msk
#define LCSC_SR_ACLKWISE_STATE_0                                           (0x1U << LCSC_SR_ACLKWISE_STATE_Pos)
#define LCSC_SR_ACLKWISE_STATE_1                                           (0x2U << LCSC_SR_ACLKWISE_STATE_Pos)
#define LCSC_SR_CLKWISE_STATE_Pos                                          (0UL)        /*!<LCSC SR: CLKWISE_STATE (Bit 0) */
#define LCSC_SR_CLKWISE_STATE_Msk                                          (0x3UL)        /*!< LCSC SR: CLKWISE_STATE (Bitfield-Mask: 0x03) */
#define LCSC_SR_CLKWISE_STATE                                              LCSC_SR_CLKWISE_STATE_Msk
#define LCSC_SR_CLKWISE_STATE_0                                            (0x1U << LCSC_SR_CLKWISE_STATE_Pos)
#define LCSC_SR_CLKWISE_STATE_1                                            (0x2U << LCSC_SR_CLKWISE_STATE_Pos)

