stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    STAT    =====================================================*/
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos                                   (24UL)        /*!<LCSC STAT: MAX_LCAB_CNT_BOUND (Bit 24) */
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_Msk                                   (0xff000000UL)        /*!< LCSC STAT: MAX_LCAB_CNT_BOUND (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MAX_LCAB_CNT_BOUND                                       LCSC_STAT_MAX_LCAB_CNT_BOUND_Msk
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_0                                     (0x1U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_1                                     (0x2U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_2                                     (0x4U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_3                                     (0x8U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_4                                     (0x10U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_5                                     (0x20U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_6                                     (0x40U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_7                                     (0x80U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos                                   (16UL)        /*!<LCSC STAT: MIN_LCAB_CNT_BOUND (Bit 16) */
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_Msk                                   (0xff0000UL)        /*!< LCSC STAT: MIN_LCAB_CNT_BOUND (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MIN_LCAB_CNT_BOUND                                       LCSC_STAT_MIN_LCAB_CNT_BOUND_Msk
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_0                                     (0x1U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_1                                     (0x2U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_2                                     (0x4U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_3                                     (0x8U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_4                                     (0x10U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_5                                     (0x20U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_6                                     (0x40U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_7                                     (0x80U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_Pos                                         (8UL)        /*!<LCSC STAT: MAX_LCAB_CNT (Bit 8) */
#define LCSC_STAT_MAX_LCAB_CNT_Msk                                         (0xff00UL)        /*!< LCSC STAT: MAX_LCAB_CNT (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MAX_LCAB_CNT                                             LCSC_STAT_MAX_LCAB_CNT_Msk
#define LCSC_STAT_MAX_LCAB_CNT_0                                           (0x1U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_1                                           (0x2U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_2                                           (0x4U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_3                                           (0x8U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_4                                           (0x10U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_5                                           (0x20U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_6                                           (0x40U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_7                                           (0x80U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_Pos                                         (0UL)        /*!<LCSC STAT: MIN_LCAB_CNT (Bit 0) */
#define LCSC_STAT_MIN_LCAB_CNT_Msk                                         (0xffUL)        /*!< LCSC STAT: MIN_LCAB_CNT (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MIN_LCAB_CNT                                             LCSC_STAT_MIN_LCAB_CNT_Msk
#define LCSC_STAT_MIN_LCAB_CNT_0                                           (0x1U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_1                                           (0x2U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_2                                           (0x4U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_3                                           (0x8U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_4                                           (0x10U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_5                                           (0x20U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_6                                           (0x40U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_7                                           (0x80U << LCSC_STAT_MIN_LCAB_CNT_Pos)

/* =====================================================    ISR    =====================================================*/
#define LCSC_ISR_CNT_OFB_F_Pos                                             (3UL)        /*!<LCSC ISR: CNT_OFB_F (Bit 3) */
#define LCSC_ISR_CNT_OFB_F_Msk                                             (0x8UL)        /*!< LCSC ISR: CNT_OFB_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_CNT_OFB_F                                                 LCSC_ISR_CNT_OFB_F_Msk
#define LCSC_ISR_TAMP_F_Pos                                                (2UL)        /*!<LCSC ISR: TAMP_F (Bit 2) */
#define LCSC_ISR_TAMP_F_Msk                                                (0x4UL)        /*!< LCSC ISR: TAMP_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_TAMP_F                                                    LCSC_ISR_TAMP_F_Msk
#define LCSC_ISR_ACLKWISE_F_Pos                                            (1UL)        /*!<LCSC ISR: ACLKWISE_F (Bit 1) */
#define LCSC_ISR_ACLKWISE_F_Msk                                            (0x2UL)        /*!< LCSC ISR: ACLKWISE_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_ACLKWISE_F                                                LCSC_ISR_ACLKWISE_F_Msk
#define LCSC_ISR_CLKWISE_F_Pos                                             (0UL)        /*!<LCSC ISR: CLKWISE_F (Bit 0) */
#define LCSC_ISR_CLKWISE_F_Msk                                             (0x1UL)        /*!< LCSC ISR: CLKWISE_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_CLKWISE_F                                                 LCSC_ISR_CLKWISE_F_Msk

#endif /* (STM32WL3XX) */

