stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* ============================================================================================================================*/
/*=====================                                        SPI                                        =====================*/
/* ============================================================================================================================*/
#if defined (STM32WL3XX)
#define SPI_I2S_SUPPORT                       /*!< I2S support */
#endif /* (STM32WL3XX) */

/* =====================================================    CR1    =====================================================*/
#define SPI_CR1_BIDIMODE_Pos                                               (15UL)        /*!<SPI CR1: BIDIMODE (Bit 15) */
#define SPI_CR1_BIDIMODE_Msk                                               (0x8000UL)        /*!< SPI CR1: BIDIMODE (Bitfield-Mask: 0x01) */
#define SPI_CR1_BIDIMODE                                                   SPI_CR1_BIDIMODE_Msk
#define SPI_CR1_BIDIOE_Pos                                                 (14UL)        /*!<SPI CR1: BIDIOE (Bit 14) */
#define SPI_CR1_BIDIOE_Msk                                                 (0x4000UL)        /*!< SPI CR1: BIDIOE (Bitfield-Mask: 0x01) */
#define SPI_CR1_BIDIOE                                                     SPI_CR1_BIDIOE_Msk
#define SPI_CR1_CRCEN_Pos                                                  (13UL)        /*!<SPI CR1: CRCEN (Bit 13) */
#define SPI_CR1_CRCEN_Msk                                                  (0x2000UL)        /*!< SPI CR1: CRCEN (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCEN                                                      SPI_CR1_CRCEN_Msk
#define SPI_CR1_CRCNEXT_Pos                                                (12UL)        /*!<SPI CR1: CRCNEXT (Bit 12) */
#define SPI_CR1_CRCNEXT_Msk                                                (0x1000UL)        /*!< SPI CR1: CRCNEXT (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCNEXT                                                    SPI_CR1_CRCNEXT_Msk
#define SPI_CR1_CRCL_Pos                                                   (11UL)        /*!<SPI CR1: CRCL (Bit 11) */
#define SPI_CR1_CRCL_Msk                                                   (0x800UL)        /*!< SPI CR1: CRCL (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCL                                                       SPI_CR1_CRCL_Msk
#define SPI_CR1_RXONLY_Pos                                                 (10UL)        /*!<SPI CR1: RXONLY (Bit 10) */
#define SPI_CR1_RXONLY_Msk                                                 (0x400UL)        /*!< SPI CR1: RXONLY (Bitfield-Mask: 0x01) */
#define SPI_CR1_RXONLY                                                     SPI_CR1_RXONLY_Msk
#define SPI_CR1_SSM_Pos                                                    (9UL)        /*!<SPI CR1: SSM (Bit 9) */
#define SPI_CR1_SSM_Msk                                                    (0x200UL)        /*!< SPI CR1: SSM (Bitfield-Mask: 0x01) */
#define SPI_CR1_SSM                                                        SPI_CR1_SSM_Msk
#define SPI_CR1_SSI_Pos                                                    (8UL)        /*!<SPI CR1: SSI (Bit 8) */
#define SPI_CR1_SSI_Msk                                                    (0x100UL)        /*!< SPI CR1: SSI (Bitfield-Mask: 0x01) */
#define SPI_CR1_SSI                                                        SPI_CR1_SSI_Msk
#define SPI_CR1_LSBFIRST_Pos                                               (7UL)        /*!<SPI CR1: LSBFIRST (Bit 7) */
#define SPI_CR1_LSBFIRST_Msk                                               (0x80UL)        /*!< SPI CR1: LSBFIRST (Bitfield-Mask: 0x01) */
#define SPI_CR1_LSBFIRST                                                   SPI_CR1_LSBFIRST_Msk
#define SPI_CR1_SPE_Pos                                                    (6UL)        /*!<SPI CR1: SPE (Bit 6) */
#define SPI_CR1_SPE_Msk                                                    (0x40UL)        /*!< SPI CR1: SPE (Bitfield-Mask: 0x01) */
#define SPI_CR1_SPE                                                        SPI_CR1_SPE_Msk
#define SPI_CR1_BR_Pos                                                     (3UL)        /*!<SPI CR1: BR (Bit 3) */
#define SPI_CR1_BR_Msk                                                     (0x38UL)        /*!< SPI CR1: BR (Bitfield-Mask: 0x07) */
#define SPI_CR1_BR                                                         SPI_CR1_BR_Msk
#define SPI_CR1_BR_0                                                       (0x1U << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_1                                                       (0x2U << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_2                                                       (0x4U << SPI_CR1_BR_Pos)
#define SPI_CR1_MSTR_Pos                                                   (2UL)        /*!<SPI CR1: MSTR (Bit 2) */
#define SPI_CR1_MSTR_Msk                                                   (0x4UL)        /*!< SPI CR1: MSTR (Bitfield-Mask: 0x01) */
#define SPI_CR1_MSTR                                                       SPI_CR1_MSTR_Msk
#define SPI_CR1_CPOL_Pos                                                   (1UL)        /*!<SPI CR1: CPOL (Bit 1) */
#define SPI_CR1_CPOL_Msk                                                   (0x2UL)        /*!< SPI CR1: CPOL (Bitfield-Mask: 0x01) */
#define SPI_CR1_CPOL                                                       SPI_CR1_CPOL_Msk
#define SPI_CR1_CPHA_Pos                                                   (0UL)        /*!<SPI CR1: CPHA (Bit 0) */
#define SPI_CR1_CPHA_Msk                                                   (0x1UL)        /*!< SPI CR1: CPHA (Bitfield-Mask: 0x01) */
#define SPI_CR1_CPHA                                                       SPI_CR1_CPHA_Msk

/* =====================================================    CR2    =====================================================*/
#define SPI_CR2_LDMATX_Pos                                                 (14UL)        /*!<SPI CR2: LDMATX (Bit 14) */
#define SPI_CR2_LDMATX_Msk                                                 (0x4000UL)        /*!< SPI CR2: LDMATX (Bitfield-Mask: 0x01) */
#define SPI_CR2_LDMATX                                                     SPI_CR2_LDMATX_Msk
#define SPI_CR2_LDMARX_Pos                                                 (13UL)        /*!<SPI CR2: LDMARX (Bit 13) */
#define SPI_CR2_LDMARX_Msk                                                 (0x2000UL)        /*!< SPI CR2: LDMARX (Bitfield-Mask: 0x01) */
#define SPI_CR2_LDMARX                                                     SPI_CR2_LDMARX_Msk
#define SPI_CR2_FRXTH_Pos                                                  (12UL)        /*!<SPI CR2: FRXTH (Bit 12) */
#define SPI_CR2_FRXTH_Msk                                                  (0x1000UL)        /*!< SPI CR2: FRXTH (Bitfield-Mask: 0x01) */
#define SPI_CR2_FRXTH                                                      SPI_CR2_FRXTH_Msk
#define SPI_CR2_DS_Pos                                                     (8UL)        /*!<SPI CR2: DS (Bit 8) */
#define SPI_CR2_DS_Msk                                                     (0xf00UL)        /*!< SPI CR2: DS (Bitfield-Mask: 0x0f) */
#define SPI_CR2_DS                                                         SPI_CR2_DS_Msk
#define SPI_CR2_DS_0                                                       (0x1U << SPI_CR2_DS_Pos)
#define SPI_CR2_DS_1                                                       (0x2U << SPI_CR2_DS_Pos)
#define SPI_CR2_DS_2                                                       (0x4U << SPI_CR2_DS_Pos)
#define SPI_CR2_DS_3                                                       (0x8U << SPI_CR2_DS_Pos)
#define SPI_CR2_TXEIE_Pos                                                  (7UL)        /*!<SPI CR2: TXEIE (Bit 7) */
#define SPI_CR2_TXEIE_Msk                                                  (0x80UL)        /*!< SPI CR2: TXEIE (Bitfield-Mask: 0x01) */
#define SPI_CR2_TXEIE                                                      SPI_CR2_TXEIE_Msk
#define SPI_CR2_RXNEIE_Pos                                                 (6UL)        /*!<SPI CR2: RXNEIE (Bit 6) */
#define SPI_CR2_RXNEIE_Msk                                                 (0x40UL)        /*!< SPI CR2: RXNEIE (Bitfield-Mask: 0x01) */
#define SPI_CR2_RXNEIE                                                     SPI_CR2_RXNEIE_Msk
#define SPI_CR2_ERRIE_Pos                                                  (5UL)        /*!<SPI CR2: ERRIE (Bit 5) */
#define SPI_CR2_ERRIE_Msk                                                  (0x20UL)        /*!< SPI CR2: ERRIE (Bitfield-Mask: 0x01) */
#define SPI_CR2_ERRIE                                                      SPI_CR2_ERRIE_Msk
#define SPI_CR2_FRF_Pos                                                    (4UL)        /*!<SPI CR2: FRF (Bit 4) */
#define SPI_CR2_FRF_Msk                                                    (0x10UL)        /*!< SPI CR2: FRF (Bitfield-Mask: 0x01) */
#define SPI_CR2_FRF                                                        SPI_CR2_FRF_Msk
#define SPI_CR2_NSSP_Pos                                                   (3UL)        /*!<SPI CR2: NSSP (Bit 3) */
#define SPI_CR2_NSSP_Msk                                                   (0x8UL)        /*!< SPI CR2: NSSP (Bitfield-Mask: 0x01) */
#define SPI_CR2_NSSP                                                       SPI_CR2_NSSP_Msk
#define SPI_CR2_SSOE_Pos                                                   (2UL)        /*!<SPI CR2: SSOE (Bit 2) */
#define SPI_CR2_SSOE_Msk                                                   (0x4UL)        /*!< SPI CR2: SSOE (Bitfield-Mask: 0x01) */
#define SPI_CR2_SSOE                                                       SPI_CR2_SSOE_Msk
#define SPI_CR2_TXDMAEN_Pos                                                (1UL)        /*!<SPI CR2: TXDMAEN (Bit 1) */
#define SPI_CR2_TXDMAEN_Msk                                                (0x2UL)        /*!< SPI CR2: TXDMAEN (Bitfield-Mask: 0x01) */
#define SPI_CR2_TXDMAEN                                                    SPI_CR2_TXDMAEN_Msk
#define SPI_CR2_RXDMAEN_Pos                                                (0UL)        /*!<SPI CR2: RXDMAEN (Bit 0) */
#define SPI_CR2_RXDMAEN_Msk                                                (0x1UL)        /*!< SPI CR2: RXDMAEN (Bitfield-Mask: 0x01) */
#define SPI_CR2_RXDMAEN                                                    SPI_CR2_RXDMAEN_Msk

/* =====================================================    SR    =====================================================*/
#define SPI_SR_FTLVL_Pos                                                   (11UL)        /*!<SPI SR: FTLVL (Bit 11) */
#define SPI_SR_FTLVL_Msk                                                   (0x1800UL)        /*!< SPI SR: FTLVL (Bitfield-Mask: 0x03) */
#define SPI_SR_FTLVL                                                       SPI_SR_FTLVL_Msk
#define SPI_SR_FTLVL_0                                                     (0x1U << SPI_SR_FTLVL_Pos)
#define SPI_SR_FTLVL_1                                                     (0x2U << SPI_SR_FTLVL_Pos)
#define SPI_SR_FRLVL_Pos                                                   (9UL)        /*!<SPI SR: FRLVL (Bit 9) */
#define SPI_SR_FRLVL_Msk                                                   (0x600UL)        /*!< SPI SR: FRLVL (Bitfield-Mask: 0x03) */
#define SPI_SR_FRLVL                                                       SPI_SR_FRLVL_Msk
#define SPI_SR_FRLVL_0                                                     (0x1U << SPI_SR_FRLVL_Pos)
#define SPI_SR_FRLVL_1                                                     (0x2U << SPI_SR_FRLVL_Pos)
#define SPI_SR_FRE_Pos                                                     (8UL)        /*!<SPI SR: FRE (Bit 8) */
#define SPI_SR_FRE_Msk                                                     (0x100UL)        /*!< SPI SR: FRE (Bitfield-Mask: 0x01) */
#define SPI_SR_FRE                                                         SPI_SR_FRE_Msk
#define SPI_SR_BSY_Pos                                                     (7UL)        /*!<SPI SR: BSY (Bit 7) */
#define SPI_SR_BSY_Msk                                                     (0x80UL)        /*!< SPI SR: BSY (Bitfield-Mask: 0x01) */
#define SPI_SR_BSY                                                         SPI_SR_BSY_Msk
#define SPI_SR_OVR_Pos                                                     (6UL)        /*!<SPI SR: OVR (Bit 6) */
#define SPI_SR_OVR_Msk                                                     (0x40UL)        /*!< SPI SR: OVR (Bitfield-Mask: 0x01) */
#define SPI_SR_OVR                                                         SPI_SR_OVR_Msk
#define SPI_SR_MODF_Pos                                                    (5UL)        /*!<SPI SR: MODF (Bit 5) */
#define SPI_SR_MODF_Msk                                                    (0x20UL)        /*!< SPI SR: MODF (Bitfield-Mask: 0x01) */
#define SPI_SR_MODF                                                        SPI_SR_MODF_Msk
#define SPI_SR_CRCERR_Pos                                                  (4UL)        /*!<SPI SR: CRCERR (Bit 4) */
#define SPI_SR_CRCERR_Msk                                                  (0x10UL)        /*!< SPI SR: CRCERR (Bitfield-Mask: 0x01) */
#define SPI_SR_CRCERR                                                      SPI_SR_CRCERR_Msk
#define SPI_SR_UDR_Pos                                                     (3UL)        /*!<SPI SR: UDR (Bit 3) */
#define SPI_SR_UDR_Msk                                                     (0x8UL)        /*!< SPI SR: UDR (Bitfield-Mask: 0x01) */
#define SPI_SR_UDR                                                         SPI_SR_UDR_Msk
#define SPI_SR_CHSIDE_Pos                                                  (2UL)        /*!<SPI SR: CHSIDE (Bit 2) */
#define SPI_SR_CHSIDE_Msk                                                  (0x4UL)        /*!< SPI SR: CHSIDE (Bitfield-Mask: 0x01) */
#define SPI_SR_CHSIDE                                                      SPI_SR_CHSIDE_Msk
#define SPI_SR_TXE_Pos                                                     (1UL)        /*!<SPI SR: TXE (Bit 1) */
#define SPI_SR_TXE_Msk                                                     (0x2UL)        /*!< SPI SR: TXE (Bitfield-Mask: 0x01) */
#define SPI_SR_TXE                                                         SPI_SR_TXE_Msk
#define SPI_SR_RXNE_Pos                                                    (0UL)        /*!<SPI SR: RXNE (Bit 0) */
#define SPI_SR_RXNE_Msk                                                    (0x1UL)        /*!< SPI SR: RXNE (Bitfield-Mask: 0x01) */
#define SPI_SR_RXNE                                                        SPI_SR_RXNE_Msk

/* =====================================================    DR    =====================================================*/
#define SPI_DR_DR_Pos                                                      (0UL)        /*!<SPI DR: DR (Bit 0) */
#define SPI_DR_DR_Msk                                                      (0xffffUL)        /*!< SPI DR: DR (Bitfield-Mask: 0xffff) */
#define SPI_DR_DR                                                          SPI_DR_DR_Msk
#define SPI_DR_DR_0                                                        (0x1U << SPI_DR_DR_Pos)
#define SPI_DR_DR_1                                                        (0x2U << SPI_DR_DR_Pos)
#define SPI_DR_DR_2                                                        (0x4U << SPI_DR_DR_Pos)
#define SPI_DR_DR_3                                                        (0x8U << SPI_DR_DR_Pos)
#define SPI_DR_DR_4                                                        (0x10U << SPI_DR_DR_Pos)
#define SPI_DR_DR_5                                                        (0x20U << SPI_DR_DR_Pos)
#define SPI_DR_DR_6                                                        (0x40U << SPI_DR_DR_Pos)
#define SPI_DR_DR_7                                                        (0x80U << SPI_DR_DR_Pos)
#define SPI_DR_DR_8                                                        (0x100U << SPI_DR_DR_Pos)
#define SPI_DR_DR_9                                                        (0x200U << SPI_DR_DR_Pos)
#define SPI_DR_DR_10                                                       (0x400U << SPI_DR_DR_Pos)
#define SPI_DR_DR_11                                                       (0x800U << SPI_DR_DR_Pos)
#define SPI_DR_DR_12                                                       (0x1000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_13                                                       (0x2000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_14                                                       (0x4000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_15                                                       (0x8000U << SPI_DR_DR_Pos)

/* =====================================================    CRCPR    =====================================================*/
#define SPI_CRCPR_CRCPOLY_Pos                                              (0UL)        /*!<SPI CRCPR: CRCPOLY (Bit 0) */
#define SPI_CRCPR_CRCPOLY_Msk                                              (0xffffUL)        /*!< SPI CRCPR: CRCPOLY (Bitfield-Mask: 0xffff) */
#define SPI_CRCPR_CRCPOLY                                                  SPI_CRCPR_CRCPOLY_Msk
#define SPI_CRCPR_CRCPOLY_0                                                (0x1U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_1                                                (0x2U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_2                                                (0x4U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_3                                                (0x8U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_4                                                (0x10U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_5                                                (0x20U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_6                                                (0x40U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_7                                                (0x80U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_8                                                (0x100U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_9                                                (0x200U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_10                                               (0x400U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_11                                               (0x800U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_12                                               (0x1000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_13                                               (0x2000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_14                                               (0x4000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_15                                               (0x8000U << SPI_CRCPR_CRCPOLY_Pos)

/* =====================================================    RXCRCR    =====================================================*/
#define SPI_RXCRCR_RXCRC_Pos                                               (0UL)        /*!<SPI RXCRCR: RXCRC (Bit 0) */
#define SPI_RXCRCR_RXCRC_Msk                                               (0xffffUL)        /*!< SPI RXCRCR: RXCRC (Bitfield-Mask: 0xffff) */
#define SPI_RXCRCR_RXCRC                                                   SPI_RXCRCR_RXCRC_Msk
#define SPI_RXCRCR_RXCRC_0                                                 (0x1U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_1                                                 (0x2U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_2                                                 (0x4U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_3                                                 (0x8U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_4                                                 (0x10U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_5                                                 (0x20U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_6                                                 (0x40U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_7                                                 (0x80U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_8                                                 (0x100U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_9                                                 (0x200U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_10                                                (0x400U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_11                                                (0x800U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_12                                                (0x1000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_13                                                (0x2000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_14                                                (0x4000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_15                                                (0x8000U << SPI_RXCRCR_RXCRC_Pos)

/* =====================================================    TXCRCR    =====================================================*/
#define SPI_TXCRCR_TXCRC_Pos                                               (0UL)        /*!<SPI TXCRCR: TXCRC (Bit 0) */
#define SPI_TXCRCR_TXCRC_Msk                                               (0xffffUL)        /*!< SPI TXCRCR: TXCRC (Bitfield-Mask: 0xffff) */
#define SPI_TXCRCR_TXCRC                                                   SPI_TXCRCR_TXCRC_Msk
#define SPI_TXCRCR_TXCRC_0                                                 (0x1U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_1                                                 (0x2U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_2                                                 (0x4U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_3                                                 (0x8U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_4                                                 (0x10U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_5                                                 (0x20U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_6                                                 (0x40U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_7                                                 (0x80U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_8                                                 (0x100U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_9                                                 (0x200U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_10                                                (0x400U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_11                                                (0x800U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_12                                                (0x1000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_13                                                (0x2000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_14                                                (0x4000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_15                                                (0x8000U << SPI_TXCRCR_TXCRC_Pos)

