stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    APB0RSTR    =====================================================*/
#define RCC_APB0RSTR_DBGMCURST_Pos                                         (15UL)        /*!<RCC APB0RSTR: DBGMCURST (Bit 15) */
#define RCC_APB0RSTR_DBGMCURST_Msk                                         (0x8000UL)        /*!< RCC APB0RSTR: DBGMCURST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_DBGMCURST                                             RCC_APB0RSTR_DBGMCURST_Msk
#define RCC_APB0RSTR_WDGRST_Pos                                            (14UL)        /*!<RCC APB0RSTR: WDGRST (Bit 14) */
#define RCC_APB0RSTR_WDGRST_Msk                                            (0x4000UL)        /*!< RCC APB0RSTR: WDGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_WDGRST                                                RCC_APB0RSTR_WDGRST_Msk
#if defined (STM32WL3XX)
#define RCC_APB0RSTR_LCSCRST_Pos                                           (13UL)        /*!<RCC APB0RSTR: LCSCRST (Bit 13) */
#define RCC_APB0RSTR_LCSCRST_Msk                                           (0x2000UL)        /*!< RCC APB0RSTR: LCSCRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_LCSCRST                                               RCC_APB0RSTR_LCSCRST_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0RSTR_RTCRST_Pos                                            (12UL)        /*!<RCC APB0RSTR: RTCRST (Bit 12) */
#define RCC_APB0RSTR_RTCRST_Msk                                            (0x1000UL)        /*!< RCC APB0RSTR: RTCRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_RTCRST                                                RCC_APB0RSTR_RTCRST_Msk
#if defined (STM32WL3XX)
#define RCC_APB0RSTR_DACRST_Pos                                            (11UL)        /*!<RCC APB0RSTR: DACRST (Bit 11) */
#define RCC_APB0RSTR_DACRST_Msk                                            (0x800UL)        /*!< RCC APB0RSTR: DACRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_DACRST                                                RCC_APB0RSTR_DACRST_Msk
#define RCC_APB0RSTR_COMPRST_Pos                                           (10UL)        /*!<RCC APB0RSTR: COMPRST (Bit 10) */
#define RCC_APB0RSTR_COMPRST_Msk                                           (0x400UL)        /*!< RCC APB0RSTR: COMPRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_COMPRST                                               RCC_APB0RSTR_COMPRST_Msk
#define RCC_APB0RSTR_LCDCRST_Pos                                           (9UL)        /*!<RCC APB0RSTR: LCDCRST (Bit 9) */
#define RCC_APB0RSTR_LCDCRST_Msk                                           (0x200UL)        /*!< RCC APB0RSTR: LCDCRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_LCDCRST                                               RCC_APB0RSTR_LCDCRST_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0RSTR_SYSCFGRST_Pos                                         (8UL)        /*!<RCC APB0RSTR: SYSCFGRST (Bit 8) */
#define RCC_APB0RSTR_SYSCFGRST_Msk                                         (0x100UL)        /*!< RCC APB0RSTR: SYSCFGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_SYSCFGRST                                             RCC_APB0RSTR_SYSCFGRST_Msk
#define RCC_APB0RSTR_TIM16RST_Pos                                          (1UL)        /*!<RCC APB0RSTR: TIM16RST (Bit 1) */
#define RCC_APB0RSTR_TIM16RST_Msk                                          (0x2UL)        /*!< RCC APB0RSTR: TIM16RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM16RST                                              RCC_APB0RSTR_TIM16RST_Msk
#define RCC_APB0RSTR_TIM2RST_Pos                                           (0UL)        /*!<RCC APB0RSTR: TIM2RST (Bit 0) */
#define RCC_APB0RSTR_TIM2RST_Msk                                           (0x1UL)        /*!< RCC APB0RSTR: TIM2RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM2RST                                               RCC_APB0RSTR_TIM2RST_Msk

/* =====================================================    APB1RSTR    =====================================================*/
#if defined (STM32WL3XX)
#define RCC_APB1RSTR_I2C2RST_Pos                                           (23UL)        /*!<RCC APB1RSTR: I2C2RST (Bit 23) */
#define RCC_APB1RSTR_I2C2RST_Msk                                           (0x800000UL)        /*!< RCC APB1RSTR: I2C2RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_I2C2RST                                               RCC_APB1RSTR_I2C2RST_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB1RSTR_I2C1RST_Pos                                           (21UL)        /*!<RCC APB1RSTR: I2C1RST (Bit 21) */
#define RCC_APB1RSTR_I2C1RST_Msk                                           (0x200000UL)        /*!< RCC APB1RSTR: I2C1RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_I2C1RST                                               RCC_APB1RSTR_I2C1RST_Msk
#define RCC_APB1RSTR_SPI3RST_Pos                                           (14UL)        /*!<RCC APB1RSTR: SPI3RST (Bit 14) */
#define RCC_APB1RSTR_SPI3RST_Msk                                           (0x4000UL)        /*!< RCC APB1RSTR: SPI3RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_SPI3RST                                               RCC_APB1RSTR_SPI3RST_Msk
#define RCC_APB1RSTR_USARTRST_Pos                                          (10UL)        /*!<RCC APB1RSTR: USARTRST (Bit 10) */
#define RCC_APB1RSTR_USARTRST_Msk                                          (0x400UL)        /*!< RCC APB1RSTR: USARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_USARTRST                                              RCC_APB1RSTR_USARTRST_Msk
#define RCC_APB1RSTR_LPUARTRST_Pos                                         (8UL)        /*!<RCC APB1RSTR: LPUARTRST (Bit 8) */
#define RCC_APB1RSTR_LPUARTRST_Msk                                         (0x100UL)        /*!< RCC APB1RSTR: LPUARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_LPUARTRST                                             RCC_APB1RSTR_LPUARTRST_Msk
#define RCC_APB1RSTR_ADCRST_Pos                                            (4UL)        /*!<RCC APB1RSTR: ADCRST (Bit 4) */
#define RCC_APB1RSTR_ADCRST_Msk                                            (0x10UL)        /*!< RCC APB1RSTR: ADCRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_ADCRST                                                RCC_APB1RSTR_ADCRST_Msk
#if defined (STM32WL3XX)
#define RCC_APB1RSTR_SPI1RST_Pos                                           (0UL)        /*!<RCC APB1RSTR: SPI1RST (Bit 0) */
#define RCC_APB1RSTR_SPI1RST_Msk                                           (0x1UL)        /*!< RCC APB1RSTR: SPI1RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_SPI1RST                                               RCC_APB1RSTR_SPI1RST_Msk
#endif /* (STM32WL3XX) */

/* =====================================================    APB2RSTR    =====================================================*/
#if defined (STM32WL3XX)
#define RCC_APB2RSTR_LPAWURRST_Pos                                         (3UL)        /*!<RCC APB2RSTR: LPAWURRST (Bit 3) */
#define RCC_APB2RSTR_LPAWURRST_Msk                                         (0x8UL)        /*!< RCC APB2RSTR: LPAWURRST (Bitfield-Mask: 0x01) */
#define RCC_APB2RSTR_LPAWURRST                                             RCC_APB2RSTR_LPAWURRST_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB2RSTR_MRSUBGRST_Pos                                         (0UL)        /*!<RCC APB2RSTR: MRSUBGRST (Bit 0) */
#define RCC_APB2RSTR_MRSUBGRST_Msk                                         (0x1UL)        /*!< RCC APB2RSTR: MRSUBGRST (Bitfield-Mask: 0x01) */
#define RCC_APB2RSTR_MRSUBGRST                                             RCC_APB2RSTR_MRSUBGRST_Msk

/* =====================================================    AHBENR    =====================================================*/
#define RCC_AHBENR_AESEN_Pos                                               (20UL)        /*!<RCC AHBENR: AESEN (Bit 20) */
#define RCC_AHBENR_AESEN_Msk                                               (0x100000UL)        /*!< RCC AHBENR: AESEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_AESEN                                                   RCC_AHBENR_AESEN_Msk
#define RCC_AHBENR_RNGEN_Pos                                               (18UL)        /*!<RCC AHBENR: RNGEN (Bit 18) */
#define RCC_AHBENR_RNGEN_Msk                                               (0x40000UL)        /*!< RCC AHBENR: RNGEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_RNGEN                                                   RCC_AHBENR_RNGEN_Msk
#define RCC_AHBENR_CRCEN_Pos                                               (12UL)        /*!<RCC AHBENR: CRCEN (Bit 12) */
#define RCC_AHBENR_CRCEN_Msk                                               (0x1000UL)        /*!< RCC AHBENR: CRCEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_CRCEN                                                   RCC_AHBENR_CRCEN_Msk
#define RCC_AHBENR_GPIOBEN_Pos                                             (3UL)        /*!<RCC AHBENR: GPIOBEN (Bit 3) */
#define RCC_AHBENR_GPIOBEN_Msk                                             (0x8UL)        /*!< RCC AHBENR: GPIOBEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOBEN                                                 RCC_AHBENR_GPIOBEN_Msk
#define RCC_AHBENR_GPIOAEN_Pos                                             (2UL)        /*!<RCC AHBENR: GPIOAEN (Bit 2) */
#define RCC_AHBENR_GPIOAEN_Msk                                             (0x4UL)        /*!< RCC AHBENR: GPIOAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOAEN                                                 RCC_AHBENR_GPIOAEN_Msk
#define RCC_AHBENR_DMAEN_Pos                                               (0UL)        /*!<RCC AHBENR: DMAEN (Bit 0) */
#define RCC_AHBENR_DMAEN_Msk                                               (0x1UL)        /*!< RCC AHBENR: DMAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_DMAEN                                                   RCC_AHBENR_DMAEN_Msk

/* =====================================================    APB0ENR    =====================================================*/
#define RCC_APB0ENR_DBGMCUEN_Pos                                           (15UL)        /*!<RCC APB0ENR: DBGMCUEN (Bit 15) */
#define RCC_APB0ENR_DBGMCUEN_Msk                                           (0x8000UL)        /*!< RCC APB0ENR: DBGMCUEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_DBGMCUEN                                               RCC_APB0ENR_DBGMCUEN_Msk
#define RCC_APB0ENR_WDGEN_Pos                                              (14UL)        /*!<RCC APB0ENR: WDGEN (Bit 14) */
#define RCC_APB0ENR_WDGEN_Msk                                              (0x4000UL)        /*!< RCC APB0ENR: WDGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_WDGEN                                                  RCC_APB0ENR_WDGEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB0ENR_LCSCEN_Pos                                             (13UL)        /*!<RCC APB0ENR: LCSCEN (Bit 13) */
#define RCC_APB0ENR_LCSCEN_Msk                                             (0x2000UL)        /*!< RCC APB0ENR: LCSCEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_LCSCEN                                                 RCC_APB0ENR_LCSCEN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0ENR_RTCEN_Pos                                              (12UL)        /*!<RCC APB0ENR: RTCEN (Bit 12) */
#define RCC_APB0ENR_RTCEN_Msk                                              (0x1000UL)        /*!< RCC APB0ENR: RTCEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_RTCEN                                                  RCC_APB0ENR_RTCEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB0ENR_DACEN_Pos                                              (11UL)        /*!<RCC APB0ENR: DACEN (Bit 11) */
#define RCC_APB0ENR_DACEN_Msk                                              (0x800UL)        /*!< RCC APB0ENR: DACEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_DACEN                                                  RCC_APB0ENR_DACEN_Msk
#define RCC_APB0ENR_COMPEN_Pos                                             (10UL)        /*!<RCC APB0ENR: COMPEN (Bit 10) */
#define RCC_APB0ENR_COMPEN_Msk                                             (0x400UL)        /*!< RCC APB0ENR: COMPEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_COMPEN                                                 RCC_APB0ENR_COMPEN_Msk
#define RCC_APB0ENR_LCDEN_Pos                                              (9UL)        /*!<RCC APB0ENR: LCDEN (Bit 9) */
#define RCC_APB0ENR_LCDEN_Msk                                              (0x200UL)        /*!< RCC APB0ENR: LCDEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_LCDEN                                                  RCC_APB0ENR_LCDEN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0ENR_SYSCFGEN_Pos                                           (8UL)        /*!<RCC APB0ENR: SYSCFGEN (Bit 8) */
#define RCC_APB0ENR_SYSCFGEN_Msk                                           (0x100UL)        /*!< RCC APB0ENR: SYSCFGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_SYSCFGEN                                               RCC_APB0ENR_SYSCFGEN_Msk
#define RCC_APB0ENR_TIM16EN_Pos                                            (1UL)        /*!<RCC APB0ENR: TIM16EN (Bit 1) */
#define RCC_APB0ENR_TIM16EN_Msk                                            (0x2UL)        /*!< RCC APB0ENR: TIM16EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM16EN                                                RCC_APB0ENR_TIM16EN_Msk
#define RCC_APB0ENR_TIM2EN_Pos                                             (0UL)        /*!<RCC APB0ENR: TIM2EN (Bit 0) */
#define RCC_APB0ENR_TIM2EN_Msk                                             (0x1UL)        /*!< RCC APB0ENR: TIM2EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM2EN                                                 RCC_APB0ENR_TIM2EN_Msk

/* =====================================================    APB1ENR    =====================================================*/
#if defined (STM32WL3XX)
#define RCC_APB1ENR_I2C2EN_Pos                                             (23UL)        /*!<RCC APB1ENR: I2C2EN (Bit 23) */
#define RCC_APB1ENR_I2C2EN_Msk                                             (0x800000UL)        /*!< RCC APB1ENR: I2C2EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_I2C2EN                                                 RCC_APB1ENR_I2C2EN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB1ENR_I2C1EN_Pos                                             (21UL)        /*!<RCC APB1ENR: I2C1EN (Bit 21) */
#define RCC_APB1ENR_I2C1EN_Msk                                             (0x200000UL)        /*!< RCC APB1ENR: I2C1EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_I2C1EN                                                 RCC_APB1ENR_I2C1EN_Msk
#define RCC_APB1ENR_SPI3EN_Pos                                             (14UL)        /*!<RCC APB1ENR: SPI3EN (Bit 14) */
#define RCC_APB1ENR_SPI3EN_Msk                                             (0x4000UL)        /*!< RCC APB1ENR: SPI3EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_SPI3EN                                                 RCC_APB1ENR_SPI3EN_Msk
#define RCC_APB1ENR_USARTEN_Pos                                            (10UL)        /*!<RCC APB1ENR: USARTEN (Bit 10) */
#define RCC_APB1ENR_USARTEN_Msk                                            (0x400UL)        /*!< RCC APB1ENR: USARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_USARTEN                                                RCC_APB1ENR_USARTEN_Msk
#define RCC_APB1ENR_LPUARTEN_Pos                                           (8UL)        /*!<RCC APB1ENR: LPUARTEN (Bit 8) */
#define RCC_APB1ENR_LPUARTEN_Msk                                           (0x100UL)        /*!< RCC APB1ENR: LPUARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_LPUARTEN                                               RCC_APB1ENR_LPUARTEN_Msk
#define RCC_APB1ENR_ADCANAEN_Pos                                           (5UL)        /*!<RCC APB1ENR: ADCANAEN (Bit 5) */
#define RCC_APB1ENR_ADCANAEN_Msk                                           (0x20UL)        /*!< RCC APB1ENR: ADCANAEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCANAEN                                               RCC_APB1ENR_ADCANAEN_Msk
#define RCC_APB1ENR_ADCDIGEN_Pos                                           (4UL)        /*!<RCC APB1ENR: ADCDIGEN (Bit 4) */
#define RCC_APB1ENR_ADCDIGEN_Msk                                           (0x10UL)        /*!< RCC APB1ENR: ADCDIGEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCDIGEN                                               RCC_APB1ENR_ADCDIGEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB1ENR_SPI1EN_Pos                                             (0UL)        /*!<RCC APB1ENR: SPI1EN (Bit 0) */
#define RCC_APB1ENR_SPI1EN_Msk                                             (0x1UL)        /*!< RCC APB1ENR: SPI1EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_SPI1EN                                                 RCC_APB1ENR_SPI1EN_Msk
#endif /* (STM32WL3XX) */

/* =====================================================    APB2ENR    =====================================================*/
#if defined (STM32WL3XX)
#define RCC_APB2ENR_LPAWUREN_Pos                                           (3UL)        /*!<RCC APB2ENR: LPAWUREN (Bit 3) */
#define RCC_APB2ENR_LPAWUREN_Msk                                           (0x8UL)        /*!< RCC APB2ENR: LPAWUREN (Bitfield-Mask: 0x01) */
#define RCC_APB2ENR_LPAWUREN                                               RCC_APB2ENR_LPAWUREN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB2ENR_MRSUBGEN_Pos                                           (0UL)        /*!<RCC APB2ENR: MRSUBGEN (Bit 0) */
#define RCC_APB2ENR_MRSUBGEN_Msk                                           (0x1UL)        /*!< RCC APB2ENR: MRSUBGEN (Bitfield-Mask: 0x01) */
#define RCC_APB2ENR_MRSUBGEN                                               RCC_APB2ENR_MRSUBGEN_Msk

/* =====================================================    CSR    =====================================================*/
#define RCC_CSR_LOCKUPRSTF_Pos                                             (30UL)        /*!<RCC CSR: LOCKUPRSTF (Bit 30) */
#define RCC_CSR_LOCKUPRSTF_Msk                                             (0x40000000UL)        /*!< RCC CSR: LOCKUPRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_LOCKUPRSTF                                                 RCC_CSR_LOCKUPRSTF_Msk
#define RCC_CSR_WDGRSTF_Pos                                                (29UL)        /*!<RCC CSR: WDGRSTF (Bit 29) */
#define RCC_CSR_WDGRSTF_Msk                                                (0x20000000UL)        /*!< RCC CSR: WDGRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_WDGRSTF                                                    RCC_CSR_WDGRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                                                (28UL)        /*!<RCC CSR: SFTRSTF (Bit 28) */
#define RCC_CSR_SFTRSTF_Msk                                                (0x10000000UL)        /*!< RCC CSR: SFTRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_SFTRSTF                                                    RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_PORRSTF_Pos                                                (27UL)        /*!<RCC CSR: PORRSTF (Bit 27) */
#define RCC_CSR_PORRSTF_Msk                                                (0x8000000UL)        /*!< RCC CSR: PORRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PORRSTF                                                    RCC_CSR_PORRSTF_Msk
#define RCC_CSR_PADRSTF_Pos                                                (26UL)        /*!<RCC CSR: PADRSTF (Bit 26) */
#define RCC_CSR_PADRSTF_Msk                                                (0x4000000UL)        /*!< RCC CSR: PADRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PADRSTF                                                    RCC_CSR_PADRSTF_Msk
#define RCC_CSR_RMVF_Pos                                                   (23UL)        /*!<RCC CSR: RMVF (Bit 23) */
#define RCC_CSR_RMVF_Msk                                                   (0x800000UL)        /*!< RCC CSR: RMVF (Bitfield-Mask: 0x01) */
#define RCC_CSR_RMVF                                                       RCC_CSR_RMVF_Msk

