stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    RFSWHSECR    =====================================================*/
#define RCC_RFSWHSECR_AMPLTHRESH_Pos                                       (16UL)        /*!<RCC RFSWHSECR: AMPLTHRESH (Bit 16) */
#define RCC_RFSWHSECR_AMPLTHRESH_Msk                                       (0x70000UL)        /*!< RCC RFSWHSECR: AMPLTHRESH (Bitfield-Mask: 0x07) */
#define RCC_RFSWHSECR_AMPLTHRESH                                           RCC_RFSWHSECR_AMPLTHRESH_Msk
#define RCC_RFSWHSECR_AMPLTHRESH_0                                         (0x1U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_AMPLTHRESH_1                                         (0x2U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_AMPLTHRESH_2                                         (0x4U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_ISTARTUP_Pos                                         (14UL)        /*!<RCC RFSWHSECR: ISTARTUP (Bit 14) */
#define RCC_RFSWHSECR_ISTARTUP_Msk                                         (0xc000UL)        /*!< RCC RFSWHSECR: ISTARTUP (Bitfield-Mask: 0x03) */
#define RCC_RFSWHSECR_ISTARTUP                                             RCC_RFSWHSECR_ISTARTUP_Msk
#define RCC_RFSWHSECR_ISTARTUP_0                                           (0x1U << RCC_RFSWHSECR_ISTARTUP_Pos)
#define RCC_RFSWHSECR_ISTARTUP_1                                           (0x2U << RCC_RFSWHSECR_ISTARTUP_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_Pos                                         (8UL)        /*!<RCC RFSWHSECR: SWXOTUNE (Bit 8) */
#define RCC_RFSWHSECR_SWXOTUNE_Msk                                         (0x3f00UL)        /*!< RCC RFSWHSECR: SWXOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFSWHSECR_SWXOTUNE                                             RCC_RFSWHSECR_SWXOTUNE_Msk
#define RCC_RFSWHSECR_SWXOTUNE_0                                           (0x1U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_1                                           (0x2U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_2                                           (0x4U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_3                                           (0x8U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_4                                           (0x10U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_5                                           (0x20U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNEEN_Pos                                       (7UL)        /*!<RCC RFSWHSECR: SWXOTUNEEN (Bit 7) */
#define RCC_RFSWHSECR_SWXOTUNEEN_Msk                                       (0x80UL)        /*!< RCC RFSWHSECR: SWXOTUNEEN (Bitfield-Mask: 0x01) */
#define RCC_RFSWHSECR_SWXOTUNEEN                                           RCC_RFSWHSECR_SWXOTUNEEN_Msk
#define RCC_RFSWHSECR_GMC_Pos                                              (0UL)        /*!<RCC RFSWHSECR: GMC (Bit 0) */
#define RCC_RFSWHSECR_GMC_Msk                                              (0x7fUL)        /*!< RCC RFSWHSECR: GMC (Bitfield-Mask: 0x7f) */
#define RCC_RFSWHSECR_GMC                                                  RCC_RFSWHSECR_GMC_Msk
#define RCC_RFSWHSECR_GMC_0                                                (0x1U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_1                                                (0x2U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_2                                                (0x4U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_3                                                (0x8U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_4                                                (0x10U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_5                                                (0x20U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_6                                                (0x40U << RCC_RFSWHSECR_GMC_Pos)

/* =====================================================    RFHSECR    =====================================================*/
#define RCC_RFHSECR_AMPLREADY_Pos                                          (6UL)        /*!<RCC RFHSECR: AMPLREADY (Bit 6) */
#define RCC_RFHSECR_AMPLREADY_Msk                                          (0x40UL)        /*!< RCC RFHSECR: AMPLREADY (Bitfield-Mask: 0x01) */
#define RCC_RFHSECR_AMPLREADY                                              RCC_RFHSECR_AMPLREADY_Msk
#define RCC_RFHSECR_XOTUNE_Pos                                             (0UL)        /*!<RCC RFHSECR: XOTUNE (Bit 0) */
#define RCC_RFHSECR_XOTUNE_Msk                                             (0x3fUL)        /*!< RCC RFHSECR: XOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFHSECR_XOTUNE                                                 RCC_RFHSECR_XOTUNE_Msk
#define RCC_RFHSECR_XOTUNE_0                                               (0x1U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_1                                               (0x2U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_2                                               (0x4U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_3                                               (0x8U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_4                                               (0x10U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_5                                               (0x20U << RCC_RFHSECR_XOTUNE_Pos)

/* =====================================================    AHBSMENR    =====================================================*/
#define RCC_AHBSMENR_AESSMEN_Pos                                           (20UL)        /*!<RCC AHBSMENR: AESSMEN (Bit 20) */
#define RCC_AHBSMENR_AESSMEN_Msk                                           (0x100000UL)        /*!< RCC AHBSMENR: AESSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_AESSMEN                                               RCC_AHBSMENR_AESSMEN_Msk
#define RCC_AHBSMENR_RNGSMEN_Pos                                           (18UL)        /*!<RCC AHBSMENR: RNGSMEN (Bit 18) */
#define RCC_AHBSMENR_RNGSMEN_Msk                                           (0x40000UL)        /*!< RCC AHBSMENR: RNGSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_RNGSMEN                                               RCC_AHBSMENR_RNGSMEN_Msk
#define RCC_AHBSMENR_CRCSMEN_Pos                                           (12UL)        /*!<RCC AHBSMENR: CRCSMEN (Bit 12) */
#define RCC_AHBSMENR_CRCSMEN_Msk                                           (0x1000UL)        /*!< RCC AHBSMENR: CRCSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_CRCSMEN                                               RCC_AHBSMENR_CRCSMEN_Msk
#define RCC_AHBSMENR_SRAM1SMEN_Pos                                         (10UL)        /*!<RCC AHBSMENR: SRAM1SMEN (Bit 10) */
#define RCC_AHBSMENR_SRAM1SMEN_Msk                                         (0x400UL)        /*!< RCC AHBSMENR: SRAM1SMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_SRAM1SMEN                                             RCC_AHBSMENR_SRAM1SMEN_Msk
#define RCC_AHBSMENR_SRAM0SMEN_Pos                                         (9UL)        /*!<RCC AHBSMENR: SRAM0SMEN (Bit 9) */
#define RCC_AHBSMENR_SRAM0SMEN_Msk                                         (0x200UL)        /*!< RCC AHBSMENR: SRAM0SMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_SRAM0SMEN                                             RCC_AHBSMENR_SRAM0SMEN_Msk
#define RCC_AHBSMENR_GPIOBSMEN_Pos                                         (3UL)        /*!<RCC AHBSMENR: GPIOBSMEN (Bit 3) */
#define RCC_AHBSMENR_GPIOBSMEN_Msk                                         (0x8UL)        /*!< RCC AHBSMENR: GPIOBSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_GPIOBSMEN                                             RCC_AHBSMENR_GPIOBSMEN_Msk
#define RCC_AHBSMENR_GPIOASMEN_Pos                                         (2UL)        /*!<RCC AHBSMENR: GPIOASMEN (Bit 2) */
#define RCC_AHBSMENR_GPIOASMEN_Msk                                         (0x4UL)        /*!< RCC AHBSMENR: GPIOASMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_GPIOASMEN                                             RCC_AHBSMENR_GPIOASMEN_Msk
#define RCC_AHBSMENR_DMASMEN_Pos                                           (0UL)        /*!<RCC AHBSMENR: DMASMEN (Bit 0) */
#define RCC_AHBSMENR_DMASMEN_Msk                                           (0x1UL)        /*!< RCC AHBSMENR: DMASMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_DMASMEN                                               RCC_AHBSMENR_DMASMEN_Msk

