stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    APB0SMENR    =====================================================*/
#define RCC_APB0SMENR_DBGMCUSMEN_Pos                                       (15UL)        /*!<RCC APB0SMENR: DBGMCUSMEN (Bit 15) */
#define RCC_APB0SMENR_DBGMCUSMEN_Msk                                       (0x8000UL)        /*!< RCC APB0SMENR: DBGMCUSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_DBGMCUSMEN                                           RCC_APB0SMENR_DBGMCUSMEN_Msk
#define RCC_APB0SMENR_WDGSMEN_Pos                                          (14UL)        /*!<RCC APB0SMENR: WDGSMEN (Bit 14) */
#define RCC_APB0SMENR_WDGSMEN_Msk                                          (0x4000UL)        /*!< RCC APB0SMENR: WDGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_WDGSMEN                                              RCC_APB0SMENR_WDGSMEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB0SMENR_LCSCSMEN_Pos                                         (13UL)        /*!<RCC APB0SMENR: LCSCSMEN (Bit 13) */
#define RCC_APB0SMENR_LCSCSMEN_Msk                                         (0x2000UL)        /*!< RCC APB0SMENR: LCSCSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_LCSCSMEN                                             RCC_APB0SMENR_LCSCSMEN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0SMENR_RTCSMEN_Pos                                          (12UL)        /*!<RCC APB0SMENR: RTCSMEN (Bit 12) */
#define RCC_APB0SMENR_RTCSMEN_Msk                                          (0x1000UL)        /*!< RCC APB0SMENR: RTCSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_RTCSMEN                                              RCC_APB0SMENR_RTCSMEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB0SMENR_DACSMEN_Pos                                          (11UL)        /*!<RCC APB0SMENR: DACSMEN (Bit 11) */
#define RCC_APB0SMENR_DACSMEN_Msk                                          (0x800UL)        /*!< RCC APB0SMENR: DACSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_DACSMEN                                              RCC_APB0SMENR_DACSMEN_Msk
#define RCC_APB0SMENR_COMPSMEN_Pos                                         (10UL)        /*!<RCC APB0SMENR: COMPSMEN (Bit 10) */
#define RCC_APB0SMENR_COMPSMEN_Msk                                         (0x400UL)        /*!< RCC APB0SMENR: COMPSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_COMPSMEN                                             RCC_APB0SMENR_COMPSMEN_Msk
#define RCC_APB0SMENR_LCDCSMEN_Pos                                         (9UL)        /*!<RCC APB0SMENR: LCDCSMEN (Bit 9) */
#define RCC_APB0SMENR_LCDCSMEN_Msk                                         (0x200UL)        /*!< RCC APB0SMENR: LCDCSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_LCDCSMEN                                             RCC_APB0SMENR_LCDCSMEN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB0SMENR_SYSCFGSMEN_Pos                                       (8UL)        /*!<RCC APB0SMENR: SYSCFGSMEN (Bit 8) */
#define RCC_APB0SMENR_SYSCFGSMEN_Msk                                       (0x100UL)        /*!< RCC APB0SMENR: SYSCFGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_SYSCFGSMEN                                           RCC_APB0SMENR_SYSCFGSMEN_Msk
#define RCC_APB0SMENR_TIM16SMEN_Pos                                        (1UL)        /*!<RCC APB0SMENR: TIM16SMEN (Bit 1) */
#define RCC_APB0SMENR_TIM16SMEN_Msk                                        (0x2UL)        /*!< RCC APB0SMENR: TIM16SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_TIM16SMEN                                            RCC_APB0SMENR_TIM16SMEN_Msk
#define RCC_APB0SMENR_TIM2SMEN_Pos                                         (0UL)        /*!<RCC APB0SMENR: TIM2SMEN (Bit 0) */
#define RCC_APB0SMENR_TIM2SMEN_Msk                                         (0x1UL)        /*!< RCC APB0SMENR: TIM2SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_TIM2SMEN                                             RCC_APB0SMENR_TIM2SMEN_Msk

/* =====================================================    APB1SMENR    =====================================================*/
#if defined (STM32WL3XX)
#define RCC_APB1SMENR_I2C2SMEN_Pos                                         (23UL)        /*!<RCC APB1SMENR: I2C2SMEN (Bit 23) */
#define RCC_APB1SMENR_I2C2SMEN_Msk                                         (0x800000UL)        /*!< RCC APB1SMENR: I2C2SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_I2C2SMEN                                             RCC_APB1SMENR_I2C2SMEN_Msk
#endif /* (STM32WL3XX) */
#define RCC_APB1SMENR_I2C1SMEN_Pos                                         (21UL)        /*!<RCC APB1SMENR: I2C1SMEN (Bit 21) */
#define RCC_APB1SMENR_I2C1SMEN_Msk                                         (0x200000UL)        /*!< RCC APB1SMENR: I2C1SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_I2C1SMEN                                             RCC_APB1SMENR_I2C1SMEN_Msk
#define RCC_APB1SMENR_SPI3SMEN_Pos                                         (14UL)        /*!<RCC APB1SMENR: SPI3SMEN (Bit 14) */
#define RCC_APB1SMENR_SPI3SMEN_Msk                                         (0x4000UL)        /*!< RCC APB1SMENR: SPI3SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_SPI3SMEN                                             RCC_APB1SMENR_SPI3SMEN_Msk
#define RCC_APB1SMENR_USARTSMEN_Pos                                        (10UL)        /*!<RCC APB1SMENR: USARTSMEN (Bit 10) */
#define RCC_APB1SMENR_USARTSMEN_Msk                                        (0x400UL)        /*!< RCC APB1SMENR: USARTSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_USARTSMEN                                            RCC_APB1SMENR_USARTSMEN_Msk
#define RCC_APB1SMENR_LPUARTSMEN_Pos                                       (8UL)        /*!<RCC APB1SMENR: LPUARTSMEN (Bit 8) */
#define RCC_APB1SMENR_LPUARTSMEN_Msk                                       (0x100UL)        /*!< RCC APB1SMENR: LPUARTSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_LPUARTSMEN                                           RCC_APB1SMENR_LPUARTSMEN_Msk
#define RCC_APB1SMENR_ADCANASMEN_Pos                                       (5UL)        /*!<RCC APB1SMENR: ADCANASMEN (Bit 5) */
#define RCC_APB1SMENR_ADCANASMEN_Msk                                       (0x20UL)        /*!< RCC APB1SMENR: ADCANASMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_ADCANASMEN                                           RCC_APB1SMENR_ADCANASMEN_Msk
#define RCC_APB1SMENR_ADCDIGSMEN_Pos                                       (4UL)        /*!<RCC APB1SMENR: ADCDIGSMEN (Bit 4) */
#define RCC_APB1SMENR_ADCDIGSMEN_Msk                                       (0x10UL)        /*!< RCC APB1SMENR: ADCDIGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_ADCDIGSMEN                                           RCC_APB1SMENR_ADCDIGSMEN_Msk
#if defined (STM32WL3XX)
#define RCC_APB1SMENR_SPI1SMEN_Pos                                         (0UL)        /*!<RCC APB1SMENR: SPI1SMEN (Bit 0) */
#define RCC_APB1SMENR_SPI1SMEN_Msk                                         (0x1UL)        /*!< RCC APB1SMENR: SPI1SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_SPI1SMEN                                             RCC_APB1SMENR_SPI1SMEN_Msk
#endif /* (STM32WL3XX) */


