stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    SDWN_WUEN    =====================================================*/
#define PWR_SDWN_WUEN_WUEN_Pos                                             (0UL)        /*!<PWR SDWN_WUEN: WUEN (Bit 0) */
#define PWR_SDWN_WUEN_WUEN_Msk                                             (0x1UL)        /*!< PWR SDWN_WUEN: WUEN (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUEN_WUEN                                                 PWR_SDWN_WUEN_WUEN_Msk

/* =====================================================    SDWN_WUPOL    =====================================================*/
#define PWR_SDWN_WUPOL_WUPOL_Pos                                           (0UL)        /*!<PWR SDWN_WUPOL: WUPOL (Bit 0) */
#define PWR_SDWN_WUPOL_WUPOL_Msk                                           (0x1UL)        /*!< PWR SDWN_WUPOL: WUPOL (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUPOL_WUPOL                                               PWR_SDWN_WUPOL_WUPOL_Msk

/* =====================================================    SDWN_WUF    =====================================================*/
#define PWR_SDWN_WUF_WUF_Pos                                               (0UL)        /*!<PWR SDWN_WUF: WUF (Bit 0) */
#define PWR_SDWN_WUF_WUF_Msk                                               (0x1UL)        /*!< PWR SDWN_WUF: WUF (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUF_WUF                                                   PWR_SDWN_WUF_WUF_Msk

/* =====================================================    BOF_TUNE    =====================================================*/
#define PWR_BOF_TUNE_BOF_TUNE_Pos                                          (0UL)        /*!<PWR BOF_TUNE: BOF_TUNE (Bit 0) */
#define PWR_BOF_TUNE_BOF_TUNE_Msk                                          (0x7UL)        /*!< PWR BOF_TUNE: BOF_TUNE (Bitfield-Mask: 0x07) */
#define PWR_BOF_TUNE_BOF_TUNE                                              PWR_BOF_TUNE_BOF_TUNE_Msk
#define PWR_BOF_TUNE_BOF_TUNE_0                                            (0x1U << PWR_BOF_TUNE_BOF_TUNE_Pos)
#define PWR_BOF_TUNE_BOF_TUNE_1                                            (0x2U << PWR_BOF_TUNE_BOF_TUNE_Pos)
#define PWR_BOF_TUNE_BOF_TUNE_2                                            (0x4U << PWR_BOF_TUNE_BOF_TUNE_Pos)

/* =====================================================    DBGR    =====================================================*/
#define PWR_DBGR_DEEPSTOP2_Pos                                             (0UL)        /*!<PWR DBGR: DEEPSTOP2 (Bit 0) */
#define PWR_DBGR_DEEPSTOP2_Msk                                             (0x1UL)        /*!< PWR DBGR: DEEPSTOP2 (Bitfield-Mask: 0x01) */
#define PWR_DBGR_DEEPSTOP2                                                 PWR_DBGR_DEEPSTOP2_Msk

/* =====================================================    EXTSRR    =====================================================*/
#define PWR_EXTSRR_RFPHASEF_Pos                                            (10UL)        /*!<PWR EXTSRR: RFPHASEF (Bit 10) */
#define PWR_EXTSRR_RFPHASEF_Msk                                            (0x400UL)        /*!< PWR EXTSRR: RFPHASEF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_RFPHASEF                                                PWR_EXTSRR_RFPHASEF_Msk
#define PWR_EXTSRR_DEEPSTOPF_Pos                                           (9UL)        /*!<PWR EXTSRR: DEEPSTOPF (Bit 9) */
#define PWR_EXTSRR_DEEPSTOPF_Msk                                           (0x200UL)        /*!< PWR EXTSRR: DEEPSTOPF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_DEEPSTOPF                                               PWR_EXTSRR_DEEPSTOPF_Msk

/* =====================================================    TRIMR    =====================================================*/
#define PWR_TRIMR_SMPS_TRIM_Pos                                            (8UL)        /*!<PWR TRIMR: SMPS_TRIM (Bit 8) */
#define PWR_TRIMR_SMPS_TRIM_Msk                                            (0x700UL)        /*!< PWR TRIMR: SMPS_TRIM (Bitfield-Mask: 0x07) */
#define PWR_TRIMR_SMPS_TRIM                                                PWR_TRIMR_SMPS_TRIM_Msk
#define PWR_TRIMR_SMPS_TRIM_0                                              (0x1U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_1                                              (0x2U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_2                                              (0x4U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_TRIM_MR_Pos                                              (4UL)        /*!<PWR TRIMR: TRIM_MR (Bit 4) */
#define PWR_TRIMR_TRIM_MR_Msk                                              (0xf0UL)        /*!< PWR TRIMR: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_TRIM_MR                                                  PWR_TRIMR_TRIM_MR_Msk
#define PWR_TRIMR_TRIM_MR_0                                                (0x1U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_1                                                (0x2U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_2                                                (0x4U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_3                                                (0x8U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_Pos                                         (0UL)        /*!<PWR TRIMR: RFD_REG_TRIM (Bit 0) */
#define PWR_TRIMR_RFD_REG_TRIM_Msk                                         (0x7UL)        /*!< PWR TRIMR: RFD_REG_TRIM (Bitfield-Mask: 0x07) */
#define PWR_TRIMR_RFD_REG_TRIM                                             PWR_TRIMR_RFD_REG_TRIM_Msk
#define PWR_TRIMR_RFD_REG_TRIM_0                                           (0x1U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_1                                           (0x2U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_2                                           (0x4U << PWR_TRIMR_RFD_REG_TRIM_Pos)

/* =====================================================    ENGTRIM    =====================================================*/
#define PWR_ENGTRIM_SMPS_TRIM_Pos                                          (11UL)        /*!<PWR ENGTRIM: SMPS_TRIM (Bit 11) */
#define PWR_ENGTRIM_SMPS_TRIM_Msk                                          (0x3800UL)        /*!< PWR ENGTRIM: SMPS_TRIM (Bitfield-Mask: 0x07) */
#define PWR_ENGTRIM_SMPS_TRIM                                              PWR_ENGTRIM_SMPS_TRIM_Msk
#define PWR_ENGTRIM_SMPS_TRIM_0                                            (0x1U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPS_TRIM_1                                            (0x2U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPS_TRIM_2                                            (0x4U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPSTRIMEN_Pos                                         (10UL)        /*!<PWR ENGTRIM: SMPSTRIMEN (Bit 10) */
#define PWR_ENGTRIM_SMPSTRIMEN_Msk                                         (0x400UL)        /*!< PWR ENGTRIM: SMPSTRIMEN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_SMPSTRIMEN                                             PWR_ENGTRIM_SMPSTRIMEN_Msk
#define PWR_ENGTRIM_TRIM_MR_Pos                                            (6UL)        /*!<PWR ENGTRIM: TRIM_MR (Bit 6) */
#define PWR_ENGTRIM_TRIM_MR_Msk                                            (0x3c0UL)        /*!< PWR ENGTRIM: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_ENGTRIM_TRIM_MR                                                PWR_ENGTRIM_TRIM_MR_Msk
#define PWR_ENGTRIM_TRIM_MR_0                                              (0x1U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_1                                              (0x2U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_2                                              (0x4U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_3                                              (0x8U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIMMREN_Pos                                           (5UL)        /*!<PWR ENGTRIM: TRIMMREN (Bit 5) */
#define PWR_ENGTRIM_TRIMMREN_Msk                                           (0x20UL)        /*!< PWR ENGTRIM: TRIMMREN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_TRIMMREN                                               PWR_ENGTRIM_TRIMMREN_Msk
#define PWR_ENGTRIM_TRIM_RFDREG_Pos                                        (1UL)        /*!<PWR ENGTRIM: TRIM_RFDREG (Bit 1) */
#define PWR_ENGTRIM_TRIM_RFDREG_Msk                                        (0xeUL)        /*!< PWR ENGTRIM: TRIM_RFDREG (Bitfield-Mask: 0x07) */
#define PWR_ENGTRIM_TRIM_RFDREG                                            PWR_ENGTRIM_TRIM_RFDREG_Msk
#define PWR_ENGTRIM_TRIM_RFDREG_0                                          (0x1U << PWR_ENGTRIM_TRIM_RFDREG_Pos)
#define PWR_ENGTRIM_TRIM_RFDREG_1                                          (0x2U << PWR_ENGTRIM_TRIM_RFDREG_Pos)
#define PWR_ENGTRIM_TRIM_RFDREG_2                                          (0x4U << PWR_ENGTRIM_TRIM_RFDREG_Pos)
#define PWR_ENGTRIM_TRIMRFDREGEN_Pos                                       (0UL)        /*!<PWR ENGTRIM: TRIMRFDREGEN (Bit 0) */
#define PWR_ENGTRIM_TRIMRFDREGEN_Msk                                       (0x1UL)        /*!< PWR ENGTRIM: TRIMRFDREGEN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_TRIMRFDREGEN                                           PWR_ENGTRIM_TRIMRFDREGEN_Msk

/* =====================================================    ENGTRIM2    =====================================================*/
#define PWR_ENGTRIM2_BOF_TRIM_Pos                                          (1UL)        /*!<PWR ENGTRIM2: BOF_TRIM (Bit 1) */
#define PWR_ENGTRIM2_BOF_TRIM_Msk                                          (0xeUL)        /*!< PWR ENGTRIM2: BOF_TRIM (Bitfield-Mask: 0x07) */
#define PWR_ENGTRIM2_BOF_TRIM                                              PWR_ENGTRIM2_BOF_TRIM_Msk
#define PWR_ENGTRIM2_BOF_TRIM_0                                            (0x1U << PWR_ENGTRIM2_BOF_TRIM_Pos)
#define PWR_ENGTRIM2_BOF_TRIM_1                                            (0x2U << PWR_ENGTRIM2_BOF_TRIM_Pos)
#define PWR_ENGTRIM2_BOF_TRIM_2                                            (0x4U << PWR_ENGTRIM2_BOF_TRIM_Pos)
#define PWR_ENGTRIM2_BOFTRIMEN_Pos                                         (0UL)        /*!<PWR ENGTRIM2: BOFTRIMEN (Bit 0) */
#define PWR_ENGTRIM2_BOFTRIMEN_Msk                                         (0x1UL)        /*!< PWR ENGTRIM2: BOFTRIMEN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM2_BOFTRIMEN                                             PWR_ENGTRIM2_BOFTRIMEN_Msk


