stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    KEYR0    =====================================================*/
#define AES_KEYR0_KEY_Pos                                                  (0UL)        /*!<AES KEYR0: KEY (Bit 0) */
#define AES_KEYR0_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR0: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR0_KEY                                                      AES_KEYR0_KEY_Msk
#define AES_KEYR0_KEY_0                                                    (0x1U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_1                                                    (0x2U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_2                                                    (0x4U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_3                                                    (0x8U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_4                                                    (0x10U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_5                                                    (0x20U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_6                                                    (0x40U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_7                                                    (0x80U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_8                                                    (0x100U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_9                                                    (0x200U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_10                                                   (0x400U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_11                                                   (0x800U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_12                                                   (0x1000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_13                                                   (0x2000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_14                                                   (0x4000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_15                                                   (0x8000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_16                                                   (0x10000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_17                                                   (0x20000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_18                                                   (0x40000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_19                                                   (0x80000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_20                                                   (0x100000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_21                                                   (0x200000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_22                                                   (0x400000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_23                                                   (0x800000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_24                                                   (0x1000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_25                                                   (0x2000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_26                                                   (0x4000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_27                                                   (0x8000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_28                                                   (0x10000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_29                                                   (0x20000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_30                                                   (0x40000000U << AES_KEYR0_KEY_Pos)
#define AES_KEYR0_KEY_31                                                   (0x80000000UL << AES_KEYR0_KEY_Pos)

/* =====================================================    KEYR1    =====================================================*/
#define AES_KEYR1_KEY_Pos                                                  (0UL)        /*!<AES KEYR1: KEY (Bit 0) */
#define AES_KEYR1_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR1: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR1_KEY                                                      AES_KEYR1_KEY_Msk
#define AES_KEYR1_KEY_0                                                    (0x1U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_1                                                    (0x2U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_2                                                    (0x4U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_3                                                    (0x8U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_4                                                    (0x10U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_5                                                    (0x20U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_6                                                    (0x40U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_7                                                    (0x80U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_8                                                    (0x100U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_9                                                    (0x200U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_10                                                   (0x400U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_11                                                   (0x800U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_12                                                   (0x1000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_13                                                   (0x2000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_14                                                   (0x4000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_15                                                   (0x8000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_16                                                   (0x10000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_17                                                   (0x20000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_18                                                   (0x40000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_19                                                   (0x80000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_20                                                   (0x100000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_21                                                   (0x200000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_22                                                   (0x400000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_23                                                   (0x800000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_24                                                   (0x1000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_25                                                   (0x2000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_26                                                   (0x4000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_27                                                   (0x8000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_28                                                   (0x10000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_29                                                   (0x20000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_30                                                   (0x40000000U << AES_KEYR1_KEY_Pos)
#define AES_KEYR1_KEY_31                                                   (0x80000000UL << AES_KEYR1_KEY_Pos)

/* =====================================================    KEYR2    =====================================================*/
#define AES_KEYR2_KEY_Pos                                                  (0UL)        /*!<AES KEYR2: KEY (Bit 0) */
#define AES_KEYR2_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR2: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR2_KEY                                                      AES_KEYR2_KEY_Msk
#define AES_KEYR2_KEY_0                                                    (0x1U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_1                                                    (0x2U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_2                                                    (0x4U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_3                                                    (0x8U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_4                                                    (0x10U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_5                                                    (0x20U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_6                                                    (0x40U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_7                                                    (0x80U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_8                                                    (0x100U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_9                                                    (0x200U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_10                                                   (0x400U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_11                                                   (0x800U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_12                                                   (0x1000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_13                                                   (0x2000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_14                                                   (0x4000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_15                                                   (0x8000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_16                                                   (0x10000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_17                                                   (0x20000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_18                                                   (0x40000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_19                                                   (0x80000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_20                                                   (0x100000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_21                                                   (0x200000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_22                                                   (0x400000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_23                                                   (0x800000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_24                                                   (0x1000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_25                                                   (0x2000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_26                                                   (0x4000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_27                                                   (0x8000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_28                                                   (0x10000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_29                                                   (0x20000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_30                                                   (0x40000000U << AES_KEYR2_KEY_Pos)
#define AES_KEYR2_KEY_31                                                   (0x80000000UL << AES_KEYR2_KEY_Pos)

/* =====================================================    KEYR3    =====================================================*/
#define AES_KEYR3_KEY_Pos                                                  (0UL)        /*!<AES KEYR3: KEY (Bit 0) */
#define AES_KEYR3_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR3: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR3_KEY                                                      AES_KEYR3_KEY_Msk
#define AES_KEYR3_KEY_0                                                    (0x1U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_1                                                    (0x2U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_2                                                    (0x4U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_3                                                    (0x8U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_4                                                    (0x10U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_5                                                    (0x20U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_6                                                    (0x40U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_7                                                    (0x80U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_8                                                    (0x100U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_9                                                    (0x200U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_10                                                   (0x400U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_11                                                   (0x800U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_12                                                   (0x1000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_13                                                   (0x2000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_14                                                   (0x4000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_15                                                   (0x8000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_16                                                   (0x10000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_17                                                   (0x20000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_18                                                   (0x40000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_19                                                   (0x80000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_20                                                   (0x100000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_21                                                   (0x200000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_22                                                   (0x400000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_23                                                   (0x800000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_24                                                   (0x1000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_25                                                   (0x2000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_26                                                   (0x4000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_27                                                   (0x8000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_28                                                   (0x10000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_29                                                   (0x20000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_30                                                   (0x40000000U << AES_KEYR3_KEY_Pos)
#define AES_KEYR3_KEY_31                                                   (0x80000000UL << AES_KEYR3_KEY_Pos)

