stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    IVR3    =====================================================*/
#define AES_IVR3_IVI_Pos                                                   (0UL)        /*!<AES IVR3: IVI (Bit 0) */
#define AES_IVR3_IVI_Msk                                                   (0xffffffffUL)        /*!< AES IVR3: IVI (Bitfield-Mask: 0xffffffff) */
#define AES_IVR3_IVI                                                       AES_IVR3_IVI_Msk
#define AES_IVR3_IVI_0                                                     (0x1U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_1                                                     (0x2U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_2                                                     (0x4U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_3                                                     (0x8U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_4                                                     (0x10U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_5                                                     (0x20U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_6                                                     (0x40U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_7                                                     (0x80U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_8                                                     (0x100U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_9                                                     (0x200U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_10                                                    (0x400U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_11                                                    (0x800U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_12                                                    (0x1000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_13                                                    (0x2000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_14                                                    (0x4000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_15                                                    (0x8000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_16                                                    (0x10000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_17                                                    (0x20000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_18                                                    (0x40000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_19                                                    (0x80000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_20                                                    (0x100000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_21                                                    (0x200000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_22                                                    (0x400000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_23                                                    (0x800000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_24                                                    (0x1000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_25                                                    (0x2000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_26                                                    (0x4000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_27                                                    (0x8000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_28                                                    (0x10000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_29                                                    (0x20000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_30                                                    (0x40000000U << AES_IVR3_IVI_Pos)
#define AES_IVR3_IVI_31                                                    (0x80000000UL << AES_IVR3_IVI_Pos)

/* =====================================================    KEYR4    =====================================================*/
#define AES_KEYR4_KEY_Pos                                                  (0UL)        /*!<AES KEYR4: KEY (Bit 0) */
#define AES_KEYR4_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR4: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR4_KEY                                                      AES_KEYR4_KEY_Msk
#define AES_KEYR4_KEY_0                                                    (0x1U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_1                                                    (0x2U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_2                                                    (0x4U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_3                                                    (0x8U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_4                                                    (0x10U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_5                                                    (0x20U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_6                                                    (0x40U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_7                                                    (0x80U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_8                                                    (0x100U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_9                                                    (0x200U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_10                                                   (0x400U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_11                                                   (0x800U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_12                                                   (0x1000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_13                                                   (0x2000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_14                                                   (0x4000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_15                                                   (0x8000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_16                                                   (0x10000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_17                                                   (0x20000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_18                                                   (0x40000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_19                                                   (0x80000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_20                                                   (0x100000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_21                                                   (0x200000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_22                                                   (0x400000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_23                                                   (0x800000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_24                                                   (0x1000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_25                                                   (0x2000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_26                                                   (0x4000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_27                                                   (0x8000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_28                                                   (0x10000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_29                                                   (0x20000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_30                                                   (0x40000000U << AES_KEYR4_KEY_Pos)
#define AES_KEYR4_KEY_31                                                   (0x80000000UL << AES_KEYR4_KEY_Pos)

