stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    SUSP3    =====================================================*/
#define AES_SUSP3_SUSP_Pos                                                 (0UL)        /*!<AES SUSP3: SUSP (Bit 0) */
#define AES_SUSP3_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP3: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP3_SUSP                                                     AES_SUSP3_SUSP_Msk
#define AES_SUSP3_SUSP_0                                                   (0x1U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_1                                                   (0x2U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_2                                                   (0x4U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_3                                                   (0x8U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_4                                                   (0x10U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_5                                                   (0x20U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_6                                                   (0x40U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_7                                                   (0x80U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_8                                                   (0x100U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_9                                                   (0x200U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_10                                                  (0x400U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_11                                                  (0x800U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_12                                                  (0x1000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_13                                                  (0x2000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_14                                                  (0x4000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_15                                                  (0x8000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_16                                                  (0x10000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_17                                                  (0x20000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_18                                                  (0x40000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_19                                                  (0x80000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_20                                                  (0x100000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_21                                                  (0x200000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_22                                                  (0x400000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_23                                                  (0x800000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_24                                                  (0x1000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_25                                                  (0x2000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_26                                                  (0x4000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_27                                                  (0x8000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_28                                                  (0x10000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_29                                                  (0x20000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_30                                                  (0x40000000U << AES_SUSP3_SUSP_Pos)
#define AES_SUSP3_SUSP_31                                                  (0x80000000UL << AES_SUSP3_SUSP_Pos)

/* =====================================================    SUSP4    =====================================================*/
#define AES_SUSP4_SUSP_Pos                                                 (0UL)        /*!<AES SUSP4: SUSP (Bit 0) */
#define AES_SUSP4_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP4: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP4_SUSP                                                     AES_SUSP4_SUSP_Msk
#define AES_SUSP4_SUSP_0                                                   (0x1U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_1                                                   (0x2U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_2                                                   (0x4U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_3                                                   (0x8U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_4                                                   (0x10U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_5                                                   (0x20U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_6                                                   (0x40U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_7                                                   (0x80U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_8                                                   (0x100U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_9                                                   (0x200U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_10                                                  (0x400U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_11                                                  (0x800U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_12                                                  (0x1000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_13                                                  (0x2000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_14                                                  (0x4000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_15                                                  (0x8000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_16                                                  (0x10000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_17                                                  (0x20000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_18                                                  (0x40000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_19                                                  (0x80000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_20                                                  (0x100000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_21                                                  (0x200000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_22                                                  (0x400000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_23                                                  (0x800000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_24                                                  (0x1000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_25                                                  (0x2000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_26                                                  (0x4000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_27                                                  (0x8000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_28                                                  (0x10000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_29                                                  (0x20000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_30                                                  (0x40000000U << AES_SUSP4_SUSP_Pos)
#define AES_SUSP4_SUSP_31                                                  (0x80000000UL << AES_SUSP4_SUSP_Pos)

