stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    SUSP5    =====================================================*/
#define AES_SUSP5_SUSP_Pos                                                 (0UL)        /*!<AES SUSP5: SUSP (Bit 0) */
#define AES_SUSP5_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP5: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP5_SUSP                                                     AES_SUSP5_SUSP_Msk
#define AES_SUSP5_SUSP_0                                                   (0x1U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_1                                                   (0x2U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_2                                                   (0x4U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_3                                                   (0x8U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_4                                                   (0x10U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_5                                                   (0x20U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_6                                                   (0x40U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_7                                                   (0x80U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_8                                                   (0x100U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_9                                                   (0x200U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_10                                                  (0x400U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_11                                                  (0x800U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_12                                                  (0x1000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_13                                                  (0x2000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_14                                                  (0x4000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_15                                                  (0x8000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_16                                                  (0x10000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_17                                                  (0x20000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_18                                                  (0x40000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_19                                                  (0x80000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_20                                                  (0x100000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_21                                                  (0x200000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_22                                                  (0x400000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_23                                                  (0x800000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_24                                                  (0x1000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_25                                                  (0x2000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_26                                                  (0x4000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_27                                                  (0x8000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_28                                                  (0x10000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_29                                                  (0x20000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_30                                                  (0x40000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_31                                                  (0x80000000UL << AES_SUSP5_SUSP_Pos)

/* =====================================================    SUSP6    =====================================================*/
#define AES_SUSP6_SUSP_Pos                                                 (0UL)        /*!<AES SUSP6: SUSP (Bit 0) */
#define AES_SUSP6_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP6: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP6_SUSP                                                     AES_SUSP6_SUSP_Msk
#define AES_SUSP6_SUSP_0                                                   (0x1U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_1                                                   (0x2U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_2                                                   (0x4U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_3                                                   (0x8U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_4                                                   (0x10U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_5                                                   (0x20U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_6                                                   (0x40U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_7                                                   (0x80U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_8                                                   (0x100U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_9                                                   (0x200U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_10                                                  (0x400U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_11                                                  (0x800U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_12                                                  (0x1000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_13                                                  (0x2000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_14                                                  (0x4000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_15                                                  (0x8000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_16                                                  (0x10000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_17                                                  (0x20000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_18                                                  (0x40000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_19                                                  (0x80000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_20                                                  (0x100000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_21                                                  (0x200000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_22                                                  (0x400000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_23                                                  (0x800000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_24                                                  (0x1000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_25                                                  (0x2000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_26                                                  (0x4000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_27                                                  (0x8000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_28                                                  (0x10000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_29                                                  (0x20000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_30                                                  (0x40000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_31                                                  (0x80000000UL << AES_SUSP6_SUSP_Pos)

/* =====================================================    SUSP7    =====================================================*/
#define AES_SUSP7_SUSP_Pos                                                 (0UL)        /*!<AES SUSP7: SUSP (Bit 0) */
#define AES_SUSP7_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP7: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP7_SUSP                                                     AES_SUSP7_SUSP_Msk
#define AES_SUSP7_SUSP_0                                                   (0x1U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_1                                                   (0x2U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_2                                                   (0x4U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_3                                                   (0x8U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_4                                                   (0x10U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_5                                                   (0x20U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_6                                                   (0x40U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_7                                                   (0x80U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_8                                                   (0x100U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_9                                                   (0x200U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_10                                                  (0x400U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_11                                                  (0x800U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_12                                                  (0x1000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_13                                                  (0x2000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_14                                                  (0x4000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_15                                                  (0x8000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_16                                                  (0x10000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_17                                                  (0x20000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_18                                                  (0x40000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_19                                                  (0x80000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_20                                                  (0x100000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_21                                                  (0x200000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_22                                                  (0x400000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_23                                                  (0x800000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_24                                                  (0x1000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_25                                                  (0x2000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_26                                                  (0x4000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_27                                                  (0x8000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_28                                                  (0x10000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_29                                                  (0x20000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_30                                                  (0x40000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_31                                                  (0x80000000UL << AES_SUSP7_SUSP_Pos)


#if defined (STM32WL3XX)
/* ============================================================================================================================*/
/*=====================                                      LPAWUR                                      =====================*/
/* ============================================================================================================================*/

/* =====================================================    FRAME_CONFIG0    =====================================================*/
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos                (21UL)        /*!<LPAWUR FRAME_CONFIG0: SLOW_CLK_CYCLE_PER_BIT_CNT (Bit 21) */
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Msk                (0x3e00000UL)        /*!< LPAWUR FRAME_CONFIG0: SLOW_CLK_CYCLE_PER_BIT_CNT (Bitfield-Mask: 0x1f) */
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT                    LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Msk
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_0                  (0x1U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_1                  (0x2U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_2                  (0x4U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_3                  (0x8U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_4                  (0x10U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos                            (16UL)        /*!<LPAWUR FRAME_CONFIG0: PAYLOAD_LENGTH (Bit 16) */
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Msk                            (0xf0000UL)        /*!< LPAWUR FRAME_CONFIG0: PAYLOAD_LENGTH (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH                                LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Msk
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_0                              (0x1U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_1                              (0x2U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_2                              (0x4U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_3                              (0x8U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos                      (10UL)        /*!<LPAWUR FRAME_CONFIG0: SYNC_THRESHOLD_COUNT (Bit 10) */
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Msk                      (0xfc00UL)        /*!< LPAWUR FRAME_CONFIG0: SYNC_THRESHOLD_COUNT (Bitfield-Mask: 0x3f) */
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT                          LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Msk
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_0                        (0x1U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_1                        (0x2U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_2                        (0x4U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_3                        (0x8U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_4                        (0x10U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_5                        (0x20U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Pos                               (8UL)        /*!<LPAWUR FRAME_CONFIG0: SYNC_LENGTH (Bit 8) */
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Msk                               (0x100UL)        /*!< LPAWUR FRAME_CONFIG0: SYNC_LENGTH (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH                                   LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Msk
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos                  (0UL)        /*!<LPAWUR FRAME_CONFIG0: PREAMBLE_THRESHOLD_COUNT (Bit 0) */
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Msk                  (0xffUL)        /*!< LPAWUR FRAME_CONFIG0: PREAMBLE_THRESHOLD_COUNT (Bitfield-Mask: 0xff) */
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT                      LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Msk
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_0                    (0x1U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_1                    (0x2U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_2                    (0x4U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_3                    (0x8U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_4                    (0x10U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_5                    (0x20U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_6                    (0x40U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_7                    (0x80U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)

/* =====================================================    FRAME_CONFIG1    =====================================================*/
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Pos                        (18UL)        /*!<LPAWUR FRAME_CONFIG1: TREC_LOOP_ALGO_SEL (Bit 18) */
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Msk                        (0x40000UL)        /*!< LPAWUR FRAME_CONFIG1: TREC_LOOP_ALGO_SEL (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL                            LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Msk
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Pos                           (17UL)        /*!<LPAWUR FRAME_CONFIG1: PREAMBLE_ENABLE (Bit 17) */
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Msk                           (0x20000UL)        /*!< LPAWUR FRAME_CONFIG1: PREAMBLE_ENABLE (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE                               LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Msk
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos                (8UL)        /*!<LPAWUR FRAME_CONFIG1: FRAME_SYNC_COUNTER_TIMEOUT (Bit 8) */
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Msk                (0xff00UL)        /*!< LPAWUR FRAME_CONFIG1: FRAME_SYNC_COUNTER_TIMEOUT (Bitfield-Mask: 0xff) */
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT                    LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Msk
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_0                  (0x1U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_1                  (0x2U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_2                  (0x4U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_3                  (0x8U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_4                  (0x10U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_5                  (0x20U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_6                  (0x40U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_7                  (0x80U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_Pos                                        (4UL)        /*!<LPAWUR FRAME_CONFIG1: KP (Bit 4) */
#define LPAWUR_FRAME_CONFIG1_KP_Msk                                        (0xf0UL)        /*!< LPAWUR FRAME_CONFIG1: KP (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG1_KP                                            LPAWUR_FRAME_CONFIG1_KP_Msk
#define LPAWUR_FRAME_CONFIG1_KP_0                                          (0x1U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_1                                          (0x2U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_2                                          (0x4U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_3                                          (0x8U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_Pos                                        (0UL)        /*!<LPAWUR FRAME_CONFIG1: KI (Bit 0) */
#define LPAWUR_FRAME_CONFIG1_KI_Msk                                        (0xfUL)        /*!< LPAWUR FRAME_CONFIG1: KI (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG1_KI                                            LPAWUR_FRAME_CONFIG1_KI_Msk
#define LPAWUR_FRAME_CONFIG1_KI_0                                          (0x1U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_1                                          (0x2U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_2                                          (0x4U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_3                                          (0x8U << LPAWUR_FRAME_CONFIG1_KI_Pos)

