stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    FRAME_SYNC_CONFIG    =====================================================*/
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos                  (16UL)        /*!<LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_H (Bit 16) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Msk                  (0xffff0000UL)        /*!< LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_H (Bitfield-Mask: 0xffff) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H                      LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Msk
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_0                    (0x1U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_1                    (0x2U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_2                    (0x4U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_3                    (0x8U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_4                    (0x10U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_5                    (0x20U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_6                    (0x40U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_7                    (0x80U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_8                    (0x100U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_9                    (0x200U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_10                   (0x400U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_11                   (0x800U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_12                   (0x1000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_13                   (0x2000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_14                   (0x4000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_15                   (0x8000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos                  (0UL)        /*!<LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_L (Bit 0) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Msk                  (0xffffUL)        /*!< LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_L (Bitfield-Mask: 0xffff) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L                      LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Msk
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_0                    (0x1U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_1                    (0x2U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_2                    (0x4U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_3                    (0x8U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_4                    (0x10U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_5                    (0x20U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_6                    (0x40U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_7                    (0x80U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_8                    (0x100U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_9                    (0x200U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_10                   (0x400U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_11                   (0x800U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_12                   (0x1000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_13                   (0x2000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_14                   (0x4000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_15                   (0x8000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)

/* =====================================================    RFIP_CONFIG    =====================================================*/
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos                                (1UL)        /*!<LPAWUR RFIP_CONFIG: WAKEUP_LEVEL (Bit 1) */
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Msk                                (0x6UL)        /*!< LPAWUR RFIP_CONFIG: WAKEUP_LEVEL (Bitfield-Mask: 0x03) */
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL                                    LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Msk
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_0                                  (0x1U << LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos)
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_1                                  (0x2U << LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos)
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Pos                               (0UL)        /*!<LPAWUR RFIP_CONFIG: LPAWUR_ENABLE (Bit 0) */
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Msk                               (0x1UL)        /*!< LPAWUR RFIP_CONFIG: LPAWUR_ENABLE (Bitfield-Mask: 0x01) */
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE                                   LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Msk

/* =====================================================    RF_CONFIG    =====================================================*/
#define LPAWUR_RF_CONFIG_ED_ICAL_Pos                                       (18UL)        /*!<LPAWUR RF_CONFIG: ED_ICAL (Bit 18) */
#define LPAWUR_RF_CONFIG_ED_ICAL_Msk                                       (0x1c0000UL)        /*!< LPAWUR RF_CONFIG: ED_ICAL (Bitfield-Mask: 0x07) */
#define LPAWUR_RF_CONFIG_ED_ICAL                                           LPAWUR_RF_CONFIG_ED_ICAL_Msk
#define LPAWUR_RF_CONFIG_ED_ICAL_0                                         (0x1U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_ED_ICAL_1                                         (0x2U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_ED_ICAL_2                                         (0x4U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos                                  (14UL)        /*!<LPAWUR RF_CONFIG: AGC_HIGH_LVL (Bit 14) */
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Msk                                  (0x3c000UL)        /*!< LPAWUR RF_CONFIG: AGC_HIGH_LVL (Bitfield-Mask: 0x0f) */
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL                                      LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Msk
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_0                                    (0x1U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_1                                    (0x2U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_2                                    (0x4U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_3                                    (0x8U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_ED_DC_CTRL_Pos                                    (13UL)        /*!<LPAWUR RF_CONFIG: ED_DC_CTRL (Bit 13) */
#define LPAWUR_RF_CONFIG_ED_DC_CTRL_Msk                                    (0x2000UL)        /*!< LPAWUR RF_CONFIG: ED_DC_CTRL (Bitfield-Mask: 0x01) */
#define LPAWUR_RF_CONFIG_ED_DC_CTRL                                        LPAWUR_RF_CONFIG_ED_DC_CTRL_Msk
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos                                   (11UL)        /*!<LPAWUR RF_CONFIG: AGC_LOW_LVL (Bit 11) */
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_Msk                                   (0x1800UL)        /*!< LPAWUR RF_CONFIG: AGC_LOW_LVL (Bitfield-Mask: 0x03) */
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL                                       LPAWUR_RF_CONFIG_AGC_LOW_LVL_Msk
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_0                                     (0x1U << LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_1                                     (0x2U << LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_Pos                                        (1UL)        /*!<LPAWUR RF_CONFIG: CLKDIV (Bit 1) */
#define LPAWUR_RF_CONFIG_CLKDIV_Msk                                        (0x1eUL)        /*!< LPAWUR RF_CONFIG: CLKDIV (Bitfield-Mask: 0x0f) */
#define LPAWUR_RF_CONFIG_CLKDIV                                            LPAWUR_RF_CONFIG_CLKDIV_Msk
#define LPAWUR_RF_CONFIG_CLKDIV_0                                          (0x1U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_1                                          (0x2U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_2                                          (0x4U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_3                                          (0x8U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_ED_SWITCH_Pos                                     (0UL)        /*!<LPAWUR RF_CONFIG: ED_SWITCH (Bit 0) */
#define LPAWUR_RF_CONFIG_ED_SWITCH_Msk                                     (0x1UL)        /*!< LPAWUR RF_CONFIG: ED_SWITCH (Bitfield-Mask: 0x01) */
#define LPAWUR_RF_CONFIG_ED_SWITCH                                         LPAWUR_RF_CONFIG_ED_SWITCH_Msk

/* =====================================================    AGC_CONFIG    =====================================================*/
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Pos                               (3UL)        /*!<LPAWUR AGC_CONFIG: AGC_RESET_MODE (Bit 3) */
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Msk                               (0x8UL)        /*!< LPAWUR AGC_CONFIG: AGC_RESET_MODE (Bitfield-Mask: 0x01) */
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE                                   LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Pos                                (2UL)        /*!<LPAWUR AGC_CONFIG: AGC_HOLD_MODE (Bit 2) */
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Msk                                (0x4UL)        /*!< LPAWUR AGC_CONFIG: AGC_HOLD_MODE (Bitfield-Mask: 0x01) */
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE                                    LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_MODE_Pos                                     (0UL)        /*!<LPAWUR AGC_CONFIG: AGC_MODE (Bit 0) */
#define LPAWUR_AGC_CONFIG_AGC_MODE_Msk                                     (0x3UL)        /*!< LPAWUR AGC_CONFIG: AGC_MODE (Bitfield-Mask: 0x03) */
#define LPAWUR_AGC_CONFIG_AGC_MODE                                         LPAWUR_AGC_CONFIG_AGC_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_MODE_0                                       (0x1U << LPAWUR_AGC_CONFIG_AGC_MODE_Pos)
#define LPAWUR_AGC_CONFIG_AGC_MODE_1                                       (0x2U << LPAWUR_AGC_CONFIG_AGC_MODE_Pos)

/* =====================================================    PAYLOAD_0    =====================================================*/
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos                                     (0UL)        /*!<LPAWUR PAYLOAD_0: PAYLOAD_0 (Bit 0) */
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_Msk                                     (0xffffffffUL)        /*!< LPAWUR PAYLOAD_0: PAYLOAD_0 (Bitfield-Mask: 0xffffffff) */
#define LPAWUR_PAYLOAD_0_PAYLOAD_0                                         LPAWUR_PAYLOAD_0_PAYLOAD_0_Msk
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_0                                       (0x1U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_1                                       (0x2U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_2                                       (0x4U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_3                                       (0x8U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_4                                       (0x10U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_5                                       (0x20U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_6                                       (0x40U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_7                                       (0x80U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_8                                       (0x100U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_9                                       (0x200U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_10                                      (0x400U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_11                                      (0x800U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_12                                      (0x1000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_13                                      (0x2000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_14                                      (0x4000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_15                                      (0x8000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_16                                      (0x10000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_17                                      (0x20000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_18                                      (0x40000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_19                                      (0x80000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_20                                      (0x100000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_21                                      (0x200000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_22                                      (0x400000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_23                                      (0x800000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_24                                      (0x1000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_25                                      (0x2000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_26                                      (0x4000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_27                                      (0x8000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_28                                      (0x10000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_29                                      (0x20000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_30                                      (0x40000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_31                                      (0x80000000UL << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)

/* =====================================================    PAYLOAD_1    =====================================================*/
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos                                     (0UL)        /*!<LPAWUR PAYLOAD_1: PAYLOAD_1 (Bit 0) */
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_Msk                                     (0xffffffffUL)        /*!< LPAWUR PAYLOAD_1: PAYLOAD_1 (Bitfield-Mask: 0xffffffff) */
#define LPAWUR_PAYLOAD_1_PAYLOAD_1                                         LPAWUR_PAYLOAD_1_PAYLOAD_1_Msk
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_0                                       (0x1U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_1                                       (0x2U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_2                                       (0x4U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_3                                       (0x8U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_4                                       (0x10U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_5                                       (0x20U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_6                                       (0x40U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_7                                       (0x80U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_8                                       (0x100U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_9                                       (0x200U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_10                                      (0x400U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_11                                      (0x800U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_12                                      (0x1000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_13                                      (0x2000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_14                                      (0x4000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_15                                      (0x8000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_16                                      (0x10000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_17                                      (0x20000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_18                                      (0x40000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_19                                      (0x80000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_20                                      (0x100000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_21                                      (0x200000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_22                                      (0x400000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_23                                      (0x800000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_24                                      (0x1000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_25                                      (0x2000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_26                                      (0x4000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_27                                      (0x8000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_28                                      (0x10000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_29                                      (0x20000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_30                                      (0x40000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_31                                      (0x80000000UL << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)

/* =====================================================    RFIP_VERSION    =====================================================*/
#define LPAWUR_RFIP_VERSION_PRODUCT_Pos                                    (12UL)        /*!<LPAWUR RFIP_VERSION: PRODUCT (Bit 12) */
#define LPAWUR_RFIP_VERSION_PRODUCT_Msk                                    (0xf000UL)        /*!< LPAWUR RFIP_VERSION: PRODUCT (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_PRODUCT                                        LPAWUR_RFIP_VERSION_PRODUCT_Msk
#define LPAWUR_RFIP_VERSION_PRODUCT_0                                      (0x1U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_1                                      (0x2U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_2                                      (0x4U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_3                                      (0x8U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_Pos                                    (8UL)        /*!<LPAWUR RFIP_VERSION: VERSION (Bit 8) */
#define LPAWUR_RFIP_VERSION_VERSION_Msk                                    (0xf00UL)        /*!< LPAWUR RFIP_VERSION: VERSION (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_VERSION                                        LPAWUR_RFIP_VERSION_VERSION_Msk
#define LPAWUR_RFIP_VERSION_VERSION_0                                      (0x1U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_1                                      (0x2U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_2                                      (0x4U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_3                                      (0x8U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_Pos                                   (4UL)        /*!<LPAWUR RFIP_VERSION: REVISION (Bit 4) */
#define LPAWUR_RFIP_VERSION_REVISION_Msk                                   (0xf0UL)        /*!< LPAWUR RFIP_VERSION: REVISION (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_REVISION                                       LPAWUR_RFIP_VERSION_REVISION_Msk
#define LPAWUR_RFIP_VERSION_REVISION_0                                     (0x1U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_1                                     (0x2U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_2                                     (0x4U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_3                                     (0x8U << LPAWUR_RFIP_VERSION_REVISION_Pos)

