stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    RFSEQ_IRQ_ENABLE    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AGC_CALIB_DONE_E_Pos         (31UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: AGC_CALIB_DONE_E (Bit 31) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AGC_CALIB_DONE_E_Msk         (0x80000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: AGC_CALIB_DONE_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AGC_CALIB_DONE_E             MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AGC_CALIB_DONE_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SAFEASK_CALIB_DONE_E_Pos     (30UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SAFEASK_CALIB_DONE_E (Bit 30) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SAFEASK_CALIB_DONE_E_Msk     (0x40000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SAFEASK_CALIB_DONE_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SAFEASK_CALIB_DONE_E         MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SAFEASK_CALIB_DONE_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_END_E_Pos            (28UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RRM_CMD_END_E (Bit 28) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_END_E_Msk            (0x10000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RRM_CMD_END_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_END_E                MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_END_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_START_E_Pos          (27UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RRM_CMD_START_E (Bit 27) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_START_E_Msk          (0x8000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RRM_CMD_START_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_START_E              MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RRM_CMD_START_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SEQ_E_Pos                    (26UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SEQ_E (Bit 26) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SEQ_E_Msk                    (0x4000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SEQ_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SEQ_E                        MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SEQ_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_HW_ANA_FAILURE_E_Pos         (24UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: HW_ANA_FAILURE_E (Bit 24) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_HW_ANA_FAILURE_E_Msk         (0x1000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: HW_ANA_FAILURE_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_HW_ANA_FAILURE_E             MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_HW_ANA_FAILURE_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AHB_ACCESS_ERROR_E_Pos       (22UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: AHB_ACCESS_ERROR_E (Bit 22) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AHB_ACCESS_ERROR_E_Msk       (0x400000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: AHB_ACCESS_ERROR_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AHB_ACCESS_ERROR_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_AHB_ACCESS_ERROR_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_1_E_Pos      (21UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_ALMOST_EMPTY_1_E (Bit 21) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_1_E_Msk      (0x200000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_ALMOST_EMPTY_1_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_1_E          MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_1_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_0_E_Pos      (20UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_ALMOST_EMPTY_0_E (Bit 20) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_0_E_Msk      (0x100000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_ALMOST_EMPTY_0_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_0_E          MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_0_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_1_E_Pos       (19UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_ALMOST_FULL_1_E (Bit 19) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_1_E_Msk       (0x80000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_ALMOST_FULL_1_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_1_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_1_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E_Pos       (18UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_ALMOST_FULL_0_E (Bit 18) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E_Msk       (0x40000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_ALMOST_FULL_0_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER1_USED_E_Pos       (17UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: DATABUFFER1_USED_E (Bit 17) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER1_USED_E_Msk       (0x20000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: DATABUFFER1_USED_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER1_USED_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER1_USED_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER0_USED_E_Pos       (16UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: DATABUFFER0_USED_E (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER0_USED_E_Msk       (0x10000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: DATABUFFER0_USED_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER0_USED_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_DATABUFFER0_USED_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E_Pos             (14UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SYNC_VALID_E (Bit 14) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E_Msk             (0x4000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SYNC_VALID_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E                 MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E_Pos         (13UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: PREAMBLE_VALID_E (Bit 13) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E_Msk         (0x2000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: PREAMBLE_VALID_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E             MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_CS_E_Pos                     (12UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: CS_E (Bit 12) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_CS_E_Msk                     (0x1000UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: CS_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_CS_E                         MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_CS_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_COMMAND_REJECTED_E_Pos       (9UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: COMMAND_REJECTED_E (Bit 9) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_COMMAND_REJECTED_E_Msk       (0x200UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: COMMAND_REJECTED_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_COMMAND_REJECTED_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_COMMAND_REJECTED_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E_Pos            (8UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SABORT_DONE_E (Bit 8) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E_Msk            (0x100UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: SABORT_DONE_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E                MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RXTIMER_STOP_CDT_E_Pos       (7UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RXTIMER_STOP_CDT_E (Bit 7) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RXTIMER_STOP_CDT_E_Msk       (0x80UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RXTIMER_STOP_CDT_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RXTIMER_STOP_CDT_E           MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RXTIMER_STOP_CDT_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_FAST_RX_TERM_E_Pos           (4UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: FAST_RX_TERM_E (Bit 4) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_FAST_RX_TERM_E_Msk           (0x10UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: FAST_RX_TERM_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_FAST_RX_TERM_E               MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_FAST_RX_TERM_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_CRC_ERROR_E_Pos           (3UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_CRC_ERROR_E (Bit 3) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_CRC_ERROR_E_Msk           (0x8UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_CRC_ERROR_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_CRC_ERROR_E               MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_CRC_ERROR_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E_Pos             (2UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_TIMEOUT_E (Bit 2) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E_Msk             (0x4UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_TIMEOUT_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E                 MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E_Pos                  (1UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_OK_E (Bit 1) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E_Msk                  (0x2UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: RX_OK_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E                      MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E_Pos                (0UL)        /*!<MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_DONE_E (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E_Msk                (0x1UL)        /*!< MR_SUBG_GLOB_DYNAMIC RFSEQ_IRQ_ENABLE: TX_DONE_E (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E                    MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E_Msk

/* =====================================================    ADDITIONAL_CTRL    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_AS_ENABLE_Pos                 (31UL)        /*!<MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: AS_ENABLE (Bit 31) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_AS_ENABLE_Msk                 (0x80000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: AS_ENABLE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_AS_ENABLE                     MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_AS_ENABLE_Msk
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Pos           (20UL)        /*!<MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: TIME_CAPTURESEL (Bit 20) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Msk           (0x700000UL)        /*!< MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: TIME_CAPTURESEL (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL               MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Msk
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_0             (0x1U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_1             (0x2U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_2             (0x4U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_TIME_CAPTURESEL_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_Pos                     (16UL)        /*!<MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: PA_FC (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_Msk                     (0x30000UL)        /*!< MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: PA_FC (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC                         MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_Msk
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_0                       (0x1U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_1                       (0x2U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_PA_FC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos                (8UL)        /*!<MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: CH_SPACING (Bit 8) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Msk                (0xff00UL)        /*!< MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: CH_SPACING (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING                    MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Msk
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_0                  (0x1U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_1                  (0x2U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_2                  (0x4U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_3                  (0x8U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_4                  (0x10U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_5                  (0x20U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_6                  (0x40U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_7                  (0x80U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos                    (0UL)        /*!<MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: CH_NUM (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Msk                    (0xffUL)        /*!< MR_SUBG_GLOB_DYNAMIC ADDITIONAL_CTRL: CH_NUM (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM                        MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Msk
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_0                      (0x1U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_1                      (0x2U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_2                      (0x4U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_3                      (0x8U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_4                      (0x10U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_5                      (0x20U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_6                      (0x40U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)
#define MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_7                      (0x80U << MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM_Pos)

/* =====================================================    FAST_RX_TIMER    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN_Pos             (8UL)        /*!<MR_SUBG_GLOB_DYNAMIC FAST_RX_TIMER: FAST_CS_TERM_EN (Bit 8) */
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN_Msk             (0x100UL)        /*!< MR_SUBG_GLOB_DYNAMIC FAST_RX_TIMER: FAST_CS_TERM_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN                 MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN_Msk
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos             (0UL)        /*!<MR_SUBG_GLOB_DYNAMIC FAST_RX_TIMER: FAST_RX_TIMEOUT (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Msk             (0xffUL)        /*!< MR_SUBG_GLOB_DYNAMIC FAST_RX_TIMER: FAST_RX_TIMEOUT (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT                 MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Msk
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_0               (0x1U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_1               (0x2U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_2               (0x4U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_3               (0x8U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_4               (0x10U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_5               (0x20U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_6               (0x40U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_7               (0x80U << MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_RX_TIMEOUT_Pos)

/* =====================================================    COMMAND    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2LOCKON_Pos                       (26UL)        /*!<MR_SUBG_GLOB_DYNAMIC COMMAND: BACK2LOCKON (Bit 26) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2LOCKON_Msk                       (0x4000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC COMMAND: BACK2LOCKON (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2LOCKON                           MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2LOCKON_Msk
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2ACTIVE_Pos                       (25UL)        /*!<MR_SUBG_GLOB_DYNAMIC COMMAND: BACK2ACTIVE (Bit 25) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2ACTIVE_Msk                       (0x2000000UL)        /*!< MR_SUBG_GLOB_DYNAMIC COMMAND: BACK2ACTIVE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2ACTIVE                           MR_SUBG_GLOB_DYNAMIC_COMMAND_BACK2ACTIVE_Msk
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Pos                        (0UL)        /*!<MR_SUBG_GLOB_DYNAMIC COMMAND: COMMAND_ID (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Msk                        (0xfUL)        /*!< MR_SUBG_GLOB_DYNAMIC COMMAND: COMMAND_ID (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID                            MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Msk
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_0                          (0x1U << MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Pos)
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_1                          (0x2U << MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Pos)
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_2                          (0x4U << MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Pos)
#define MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_3                          (0x8U << MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID_Pos)


