stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    CRC_INIT    =====================================================*/
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos                      (0UL)        /*!<MR_SUBG_GLOB_STATIC CRC_INIT: CRC_INIT_VAL (Bit 0) */
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Msk                      (0xffffffffUL)        /*!< MR_SUBG_GLOB_STATIC CRC_INIT: CRC_INIT_VAL (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL                          MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Msk
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_0                        (0x1U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_1                        (0x2U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_2                        (0x4U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_3                        (0x8U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_4                        (0x10U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_5                        (0x20U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_6                        (0x40U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_7                        (0x80U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_8                        (0x100U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_9                        (0x200U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_10                       (0x400U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_11                       (0x800U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_12                       (0x1000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_13                       (0x2000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_14                       (0x4000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_15                       (0x8000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_16                       (0x10000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_17                       (0x20000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_18                       (0x40000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_19                       (0x80000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_20                       (0x100000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_21                       (0x200000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_22                       (0x400000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_23                       (0x800000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_24                       (0x1000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_25                       (0x2000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_26                       (0x4000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_27                       (0x8000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_28                       (0x10000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_29                       (0x20000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_30                       (0x40000000U << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)
#define MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_31                       (0x80000000UL << MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL_Pos)

/* =====================================================    PCKT_CTRL    =====================================================*/
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE_Pos             (31UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: FORCE_2FSK_SYNC_MODE (Bit 31) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE_Msk             (0x80000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: FORCE_2FSK_SYNC_MODE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE                 MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PN_SEL_Pos                           (29UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: PN_SEL (Bit 29) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PN_SEL_Msk                           (0x20000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: PN_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PN_SEL                               MR_SUBG_GLOB_STATIC_PCKT_CTRL_PN_SEL_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN_Pos                    (28UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: MOD_INTERP_EN (Bit 28) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN_Msk                    (0x10000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: MOD_INTERP_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN                        MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FCS_TYPE_4G_Pos                      (27UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: FCS_TYPE_4G (Bit 27) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FCS_TYPE_4G_Msk                      (0x8000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: FCS_TYPE_4G (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FCS_TYPE_4G                          MR_SUBG_GLOB_STATIC_PCKT_CTRL_FCS_TYPE_4G_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FEC_TYPE_4G_Pos                      (26UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: FEC_TYPE_4G (Bit 26) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FEC_TYPE_4G_Msk                      (0x4000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: FEC_TYPE_4G (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FEC_TYPE_4G                          MR_SUBG_GLOB_STATIC_PCKT_CTRL_FEC_TYPE_4G_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_INT_EN_4G_Pos                        (25UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: INT_EN_4G (Bit 25) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_INT_EN_4G_Msk                        (0x2000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: INT_EN_4G (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_INT_EN_4G                            MR_SUBG_GLOB_STATIC_PCKT_CTRL_INT_EN_4G_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MANCHESTER_TYPE_Pos                  (24UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: MANCHESTER_TYPE (Bit 24) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MANCHESTER_TYPE_Msk                  (0x1000000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: MANCHESTER_TYPE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_MANCHESTER_TYPE                      MR_SUBG_GLOB_STATIC_PCKT_CTRL_MANCHESTER_TYPE_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_Pos                       (21UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: CODING_SEL (Bit 21) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_Msk                       (0x600000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: CODING_SEL (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL                           MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_0                         (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_1                         (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos                        (12UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_INIT (Bit 12) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Msk                        (0x1ff000UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_INIT (Bitfield-Mask: 0x1ff) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT                            MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_0                          (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_1                          (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_2                          (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_3                          (0x8U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_4                          (0x10U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_5                          (0x20U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_6                          (0x40U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_7                          (0x80U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_8                          (0x100U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN_Pos                          (11UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_EN (Bit 11) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN_Msk                          (0x800UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN                              MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC_Pos                      (10UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_BF_FEC (Bit 10) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC_Msk                      (0x400UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: WHIT_BF_FEC (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC                          MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_Pos                          (7UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: TX_MODE (Bit 7) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_Msk                          (0x180UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: TX_MODE (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE                              MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_0                            (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_1                            (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Pos                          (4UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: RX_MODE (Bit 4) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Msk                          (0x70UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: RX_MODE (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE                              MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_0                            (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_1                            (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_2                            (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP_Pos                (3UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: FOUR_FSK_SYM_SWAP (Bit 3) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP_Msk                (0x8UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: FOUR_FSK_SYM_SWAP (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP                    MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP_Pos                        (2UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: BYTE_SWAP (Bit 2) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP_Msk                        (0x4UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: BYTE_SWAP (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP                            MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT_Pos                      (0UL)        /*!<MR_SUBG_GLOB_STATIC PCKT_CTRL: PCKT_FORMAT (Bit 0) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT_Msk                      (0x1UL)        /*!< MR_SUBG_GLOB_STATIC PCKT_CTRL: PCKT_FORMAT (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT                          MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT_Msk

/* =====================================================    DATABUFFER0_PTR    =====================================================*/
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos            (2UL)        /*!<MR_SUBG_GLOB_STATIC DATABUFFER0_PTR: DATABUFFER0_PTR (Bit 2) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Msk            (0xfffffffcUL)        /*!< MR_SUBG_GLOB_STATIC DATABUFFER0_PTR: DATABUFFER0_PTR (Bitfield-Mask: 0x3fffffff) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR                MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Msk
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_0              (0x1U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_1              (0x2U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_2              (0x4U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_3              (0x8U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_4              (0x10U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_5              (0x20U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_6              (0x40U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_7              (0x80U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_8              (0x100U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_9              (0x200U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_10             (0x400U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_11             (0x800U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_12             (0x1000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_13             (0x2000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_14             (0x4000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_15             (0x8000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_16             (0x10000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_17             (0x20000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_18             (0x40000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_19             (0x80000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_20             (0x100000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_21             (0x200000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_22             (0x400000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_23             (0x800000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_24             (0x1000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_25             (0x2000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_26             (0x4000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_27             (0x8000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_28             (0x10000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_29             (0x20000000U << MR_SUBG_GLOB_STATIC_DATABUFFER0_PTR_DATABUFFER0_PTR_Pos)

/* =====================================================    DATABUFFER1_PTR    =====================================================*/
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos            (2UL)        /*!<MR_SUBG_GLOB_STATIC DATABUFFER1_PTR: DATABUFFER1_PTR (Bit 2) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Msk            (0xfffffffcUL)        /*!< MR_SUBG_GLOB_STATIC DATABUFFER1_PTR: DATABUFFER1_PTR (Bitfield-Mask: 0x3fffffff) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR                MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Msk
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_0              (0x1U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_1              (0x2U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_2              (0x4U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_3              (0x8U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_4              (0x10U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_5              (0x20U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_6              (0x40U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_7              (0x80U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_8              (0x100U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_9              (0x200U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_10             (0x400U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_11             (0x800U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_12             (0x1000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_13             (0x2000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_14             (0x4000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_15             (0x8000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_16             (0x10000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_17             (0x20000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_18             (0x40000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_19             (0x80000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_20             (0x100000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_21             (0x200000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_22             (0x400000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_23             (0x800000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_24             (0x1000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_25             (0x2000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_26             (0x4000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_27             (0x8000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_28             (0x10000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_29             (0x20000000U << MR_SUBG_GLOB_STATIC_DATABUFFER1_PTR_DATABUFFER1_PTR_Pos)

