stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* ============================================================================================================================*/
/*=====================                                MR_SUBG_GLOB_STATUS                                =====================*/
/* ============================================================================================================================*/

/* =====================================================    RFSEQ_IRQ_STATUS    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AGC_CALIB_DONE_F_Pos          (31UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: AGC_CALIB_DONE_F (Bit 31) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AGC_CALIB_DONE_F_Msk          (0x80000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: AGC_CALIB_DONE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AGC_CALIB_DONE_F              MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AGC_CALIB_DONE_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SAFEASK_CALIB_DONE_F_Pos      (30UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SAFEASK_CALIB_DONE_F (Bit 30) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SAFEASK_CALIB_DONE_F_Msk      (0x40000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SAFEASK_CALIB_DONE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SAFEASK_CALIB_DONE_F          MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SAFEASK_CALIB_DONE_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_END_F_Pos             (28UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RRM_CMD_END_F (Bit 28) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_END_F_Msk             (0x10000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RRM_CMD_END_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_END_F                 MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_END_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_START_F_Pos           (27UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RRM_CMD_START_F (Bit 27) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_START_F_Msk           (0x8000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RRM_CMD_START_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_START_F               MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RRM_CMD_START_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SEQ_F_Pos                     (26UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SEQ_F (Bit 26) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SEQ_F_Msk                     (0x4000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SEQ_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SEQ_F                         MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SEQ_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_HW_ANA_FAILURE_F_Pos          (24UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: HW_ANA_FAILURE_F (Bit 24) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_HW_ANA_FAILURE_F_Msk          (0x1000000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: HW_ANA_FAILURE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_HW_ANA_FAILURE_F              MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_HW_ANA_FAILURE_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AHB_ACCESS_ERROR_F_Pos        (22UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: AHB_ACCESS_ERROR_F (Bit 22) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AHB_ACCESS_ERROR_F_Msk        (0x400000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: AHB_ACCESS_ERROR_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AHB_ACCESS_ERROR_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_AHB_ACCESS_ERROR_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F_Pos       (21UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_ALMOST_EMPTY_1_F (Bit 21) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F_Msk       (0x200000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_ALMOST_EMPTY_1_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F           MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F_Pos       (20UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_ALMOST_EMPTY_0_F (Bit 20) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F_Msk       (0x100000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_ALMOST_EMPTY_0_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F           MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_1_F_Pos        (19UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_ALMOST_FULL_1_F (Bit 19) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_1_F_Msk        (0x80000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_ALMOST_FULL_1_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_1_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_1_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F_Pos        (18UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_ALMOST_FULL_0_F (Bit 18) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F_Msk        (0x40000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_ALMOST_FULL_0_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER1_USED_F_Pos        (17UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: DATABUFFER1_USED_F (Bit 17) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER1_USED_F_Msk        (0x20000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: DATABUFFER1_USED_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER1_USED_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER1_USED_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER0_USED_F_Pos        (16UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: DATABUFFER0_USED_F (Bit 16) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER0_USED_F_Msk        (0x10000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: DATABUFFER0_USED_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER0_USED_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_DATABUFFER0_USED_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F_Pos              (14UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SYNC_VALID_F (Bit 14) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F_Msk              (0x4000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SYNC_VALID_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F                  MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F_Pos          (13UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: PREAMBLE_VALID_F (Bit 13) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F_Msk          (0x2000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: PREAMBLE_VALID_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F              MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_CS_F_Pos                      (12UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: CS_F (Bit 12) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_CS_F_Msk                      (0x1000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: CS_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_CS_F                          MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_CS_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_COMMAND_REJECTED_F_Pos        (9UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: COMMAND_REJECTED_F (Bit 9) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_COMMAND_REJECTED_F_Msk        (0x200UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: COMMAND_REJECTED_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_COMMAND_REJECTED_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_COMMAND_REJECTED_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F_Pos             (8UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SABORT_DONE_F (Bit 8) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F_Msk             (0x100UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: SABORT_DONE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F                 MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RXTIMER_STOP_CDT_F_Pos        (7UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RXTIMER_STOP_CDT_F (Bit 7) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RXTIMER_STOP_CDT_F_Msk        (0x80UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RXTIMER_STOP_CDT_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RXTIMER_STOP_CDT_F            MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RXTIMER_STOP_CDT_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_FAST_RX_TERM_F_Pos            (4UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: FAST_RX_TERM_F (Bit 4) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_FAST_RX_TERM_F_Msk            (0x10UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: FAST_RX_TERM_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_FAST_RX_TERM_F                MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_FAST_RX_TERM_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_CRC_ERROR_F_Pos            (3UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_CRC_ERROR_F (Bit 3) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_CRC_ERROR_F_Msk            (0x8UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_CRC_ERROR_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_CRC_ERROR_F                MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_CRC_ERROR_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F_Pos              (2UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_TIMEOUT_F (Bit 2) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F_Msk              (0x4UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_TIMEOUT_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F                  MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F_Pos                   (1UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_OK_F (Bit 1) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F_Msk                   (0x2UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: RX_OK_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F                       MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F_Pos                 (0UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_DONE_F (Bit 0) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F_Msk                 (0x1UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_IRQ_STATUS: TX_DONE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F                     MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F_Msk

