stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    RFSEQ_STATUS_DETAIL    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_COMPLETE_F_Pos         (15UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: SEQ_COMPLETE_F (Bit 15) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_COMPLETE_F_Msk         (0x8000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: SEQ_COMPLETE_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_COMPLETE_F             MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_COMPLETE_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_ACTIONTIMEOUT_F_Pos    (14UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: SEQ_ACTIONTIMEOUT_F (Bit 14) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_ACTIONTIMEOUT_F_Msk    (0x4000UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: SEQ_ACTIONTIMEOUT_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_ACTIONTIMEOUT_F        MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_SEQ_ACTIONTIMEOUT_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALAMP_ERROR_F_Pos     (11UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_CALAMP_ERROR_F (Bit 11) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALAMP_ERROR_F_Msk     (0x800UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_CALAMP_ERROR_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALAMP_ERROR_F         MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALAMP_ERROR_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALFREQ_ERROR_F_Pos    (10UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_CALFREQ_ERROR_F (Bit 10) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALFREQ_ERROR_F_Msk    (0x400UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_CALFREQ_ERROR_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALFREQ_ERROR_F        MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_CALFREQ_ERROR_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_UNLOCK_F_Pos           (9UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_UNLOCK_F (Bit 9) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_UNLOCK_F_Msk           (0x200UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_UNLOCK_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_UNLOCK_F               MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_UNLOCK_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_LOCK_FAIL_F_Pos        (8UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_LOCK_FAIL_F (Bit 8) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_LOCK_FAIL_F_Msk        (0x100UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: PLL_LOCK_FAIL_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_LOCK_FAIL_F            MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_PLL_LOCK_FAIL_F_Msk
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_DBM_FIFO_ERROR_F_Pos       (5UL)        /*!<MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: DBM_FIFO_ERROR_F (Bit 5) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_DBM_FIFO_ERROR_F_Msk       (0x20UL)        /*!< MR_SUBG_GLOB_STATUS RFSEQ_STATUS_DETAIL: DBM_FIFO_ERROR_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_DBM_FIFO_ERROR_F           MR_SUBG_GLOB_STATUS_RFSEQ_STATUS_DETAIL_DBM_FIFO_ERROR_F_Msk

/* =====================================================    RADIO_FSM_INFO    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos             (0UL)        /*!<MR_SUBG_GLOB_STATUS RADIO_FSM_INFO: RADIO_FSM_STATE (Bit 0) */
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Msk             (0x1fUL)        /*!< MR_SUBG_GLOB_STATUS RADIO_FSM_INFO: RADIO_FSM_STATE (Bitfield-Mask: 0x1f) */
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE                 MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Msk
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_0               (0x1U << MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_1               (0x2U << MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_2               (0x4U << MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_3               (0x8U << MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_4               (0x10U << MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE_Pos)

/* =====================================================    RX_INDICATOR    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_ANT_SELECT_Pos                    (31UL)        /*!<MR_SUBG_GLOB_STATUS RX_INDICATOR: ANT_SELECT (Bit 31) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_ANT_SELECT_Msk                    (0x80000000UL)        /*!< MR_SUBG_GLOB_STATUS RX_INDICATOR: ANT_SELECT (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_ANT_SELECT                        MR_SUBG_GLOB_STATUS_RX_INDICATOR_ANT_SELECT_Msk
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Pos                      (24UL)        /*!<MR_SUBG_GLOB_STATUS RX_INDICATOR: AGC_WORD (Bit 24) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Msk                      (0xf000000UL)        /*!< MR_SUBG_GLOB_STATUS RX_INDICATOR: AGC_WORD (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD                          MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Msk
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_0                        (0x1U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_1                        (0x2U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_2                        (0x4U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_3                        (0x8U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_AGC_WORD_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos                (12UL)        /*!<MR_SUBG_GLOB_STATUS RX_INDICATOR: RSSI_LEVEL_RUN (Bit 12) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Msk                (0x1ff000UL)        /*!< MR_SUBG_GLOB_STATUS RX_INDICATOR: RSSI_LEVEL_RUN (Bitfield-Mask: 0x1ff) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN                    MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Msk
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_0                  (0x1U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_1                  (0x2U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_2                  (0x4U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_3                  (0x8U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_4                  (0x10U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_5                  (0x20U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_6                  (0x40U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_7                  (0x80U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_8                  (0x100U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos            (0UL)        /*!<MR_SUBG_GLOB_STATUS RX_INDICATOR: RSSI_LEVEL_ON_SYNC (Bit 0) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Msk            (0x1ffUL)        /*!< MR_SUBG_GLOB_STATUS RX_INDICATOR: RSSI_LEVEL_ON_SYNC (Bitfield-Mask: 0x1ff) */
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC                MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Msk
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_0              (0x1U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_1              (0x2U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_2              (0x4U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_3              (0x8U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_4              (0x10U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_5              (0x20U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_6              (0x40U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_7              (0x80U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_8              (0x100U << MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC_Pos)

/* =====================================================    RX_INFO_REG    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos                 (0UL)        /*!<MR_SUBG_GLOB_STATUS RX_INFO_REG: RX_PCKTLEN_OUT (Bit 0) */
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Msk                 (0xffffUL)        /*!< MR_SUBG_GLOB_STATUS RX_INFO_REG: RX_PCKTLEN_OUT (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT                     MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Msk
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_0                   (0x1U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_1                   (0x2U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_2                   (0x4U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_3                   (0x8U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_4                   (0x10U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_5                   (0x20U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_6                   (0x40U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_7                   (0x80U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_8                   (0x100U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_9                   (0x200U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_10                  (0x400U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_11                  (0x800U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_12                  (0x1000U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_13                  (0x2000U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_14                  (0x4000U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_15                  (0x8000U << MR_SUBG_GLOB_STATUS_RX_INFO_REG_RX_PCKTLEN_OUT_Pos)

/* =====================================================    RX_CRC_REG    =====================================================*/
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos                      (0UL)        /*!<MR_SUBG_GLOB_STATUS RX_CRC_REG: RX_CRC_OUT (Bit 0) */
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Msk                      (0xffffffffUL)        /*!< MR_SUBG_GLOB_STATUS RX_CRC_REG: RX_CRC_OUT (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT                          MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Msk
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_0                        (0x1U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_1                        (0x2U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_2                        (0x4U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_3                        (0x8U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_4                        (0x10U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_5                        (0x20U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_6                        (0x40U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_7                        (0x80U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_8                        (0x100U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_9                        (0x200U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_10                       (0x400U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_11                       (0x800U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_12                       (0x1000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_13                       (0x2000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_14                       (0x4000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_15                       (0x8000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_16                       (0x10000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_17                       (0x20000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_18                       (0x40000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_19                       (0x80000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_20                       (0x100000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_21                       (0x200000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_22                       (0x400000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_23                       (0x800000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_24                       (0x1000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_25                       (0x2000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_26                       (0x4000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_27                       (0x8000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_28                       (0x10000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_29                       (0x20000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_30                       (0x40000000U << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_31                       (0x80000000UL << MR_SUBG_GLOB_STATUS_RX_CRC_REG_RX_CRC_OUT_Pos)

/* =====================================================    QI_INFO    =====================================================*/
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos                     (16UL)        /*!<MR_SUBG_GLOB_STATUS QI_INFO: AFC_CORRECTION (Bit 16) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Msk                     (0xff0000UL)        /*!< MR_SUBG_GLOB_STATUS QI_INFO: AFC_CORRECTION (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION                         MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Msk
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_0                       (0x1U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_1                       (0x2U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_2                       (0x4U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_3                       (0x8U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_4                       (0x10U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_5                       (0x20U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_6                       (0x40U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_7                       (0x80U << MR_SUBG_GLOB_STATUS_QI_INFO_AFC_CORRECTION_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_SEC_Pos                            (14UL)        /*!<MR_SUBG_GLOB_STATUS QI_INFO: SQI_SEC (Bit 14) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_SEC_Msk                            (0x4000UL)        /*!< MR_SUBG_GLOB_STATUS QI_INFO: SQI_SEC (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_SEC                                MR_SUBG_GLOB_STATUS_QI_INFO_SQI_SEC_Msk
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos                           (8UL)        /*!<MR_SUBG_GLOB_STATUS QI_INFO: SQI_INFO (Bit 8) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Msk                           (0x3f00UL)        /*!< MR_SUBG_GLOB_STATUS QI_INFO: SQI_INFO (Bitfield-Mask: 0x3f) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO                               MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Msk
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_0                             (0x1U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_1                             (0x2U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_2                             (0x4U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_3                             (0x8U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_4                             (0x10U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_5                             (0x20U << MR_SUBG_GLOB_STATUS_QI_INFO_SQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos                           (0UL)        /*!<MR_SUBG_GLOB_STATUS QI_INFO: PQI_INFO (Bit 0) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Msk                           (0xffUL)        /*!< MR_SUBG_GLOB_STATUS QI_INFO: PQI_INFO (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO                               MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Msk
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_0                             (0x1U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_1                             (0x2U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_2                             (0x4U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_3                             (0x8U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_4                             (0x10U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_5                             (0x20U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_6                             (0x40U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)
#define MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_7                             (0x80U << MR_SUBG_GLOB_STATUS_QI_INFO_PQI_INFO_Pos)

