stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    RF_FSM5_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos                      (0UL)        /*!<MR_SUBG_RADIO RF_FSM5_TIMEOUT: EN_PA_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Msk                      (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM5_TIMEOUT: EN_PA_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER                          MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_0                        (0x1U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_1                        (0x2U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_2                        (0x4U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_3                        (0x8U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_4                        (0x10U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_5                        (0x20U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_6                        (0x40U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_7                        (0x80U << MR_SUBG_RADIO_RF_FSM5_TIMEOUT_EN_PA_TIMER_Pos)

/* =====================================================    RF_FSM6_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos                 (0UL)        /*!<MR_SUBG_RADIO RF_FSM6_TIMEOUT: PA_DWN_ANA_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Msk                 (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM6_TIMEOUT: PA_DWN_ANA_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER                     MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_0                   (0x1U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_1                   (0x2U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_2                   (0x4U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_3                   (0x8U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_4                   (0x10U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_5                   (0x20U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_6                   (0x40U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_7                   (0x80U << MR_SUBG_RADIO_RF_FSM6_TIMEOUT_PA_DWN_ANA_TIMER_Pos)

/* =====================================================    RF_FSM7_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos                     (0UL)        /*!<MR_SUBG_RADIO RF_FSM7_TIMEOUT: EN_LNA_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Msk                     (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM7_TIMEOUT: EN_LNA_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER                         MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_0                       (0x1U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_1                       (0x2U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_2                       (0x4U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_3                       (0x8U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_4                       (0x10U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_5                       (0x20U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_6                       (0x40U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_7                       (0x80U << MR_SUBG_RADIO_RF_FSM7_TIMEOUT_EN_LNA_TIMER_Pos)

/* =====================================================    AFC0_CONFIG    =====================================================*/
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Pos                   (4UL)        /*!<MR_SUBG_RADIO AFC0_CONFIG: AFC_FAST_GAIN_LOG2 (Bit 4) */
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Msk                   (0xf0UL)        /*!< MR_SUBG_RADIO AFC0_CONFIG: AFC_FAST_GAIN_LOG2 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2                       MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Msk
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_0                     (0x1U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_1                     (0x2U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_2                     (0x4U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_3                     (0x8U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_FAST_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Pos                   (0UL)        /*!<MR_SUBG_RADIO AFC0_CONFIG: AFC_SLOW_GAIN_LOG2 (Bit 0) */
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Msk                   (0xfUL)        /*!< MR_SUBG_RADIO AFC0_CONFIG: AFC_SLOW_GAIN_LOG2 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2                       MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Msk
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_0                     (0x1U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_1                     (0x2U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_2                     (0x4U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Pos)
#define MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_3                     (0x8U << MR_SUBG_RADIO_AFC0_CONFIG_AFC_SLOW_GAIN_LOG2_Pos)

/* =====================================================    AFC1_CONFIG    =====================================================*/
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos                      (0UL)        /*!<MR_SUBG_RADIO AFC1_CONFIG: AFC_FAST_PERIOD (Bit 0) */
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Msk                      (0xffUL)        /*!< MR_SUBG_RADIO AFC1_CONFIG: AFC_FAST_PERIOD (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD                          MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Msk
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_0                        (0x1U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_1                        (0x2U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_2                        (0x4U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_3                        (0x8U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_4                        (0x10U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_5                        (0x20U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_6                        (0x40U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)
#define MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_7                        (0x80U << MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD_Pos)

/* =====================================================    AFC2_CONFIG    =====================================================*/
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_FREEZE_ON_SYNC_Pos                   (7UL)        /*!<MR_SUBG_RADIO AFC2_CONFIG: AFC_FREEZE_ON_SYNC (Bit 7) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_FREEZE_ON_SYNC_Msk                   (0x80UL)        /*!< MR_SUBG_RADIO AFC2_CONFIG: AFC_FREEZE_ON_SYNC (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_FREEZE_ON_SYNC                       MR_SUBG_RADIO_AFC2_CONFIG_AFC_FREEZE_ON_SYNC_Msk
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_EN_Pos                               (6UL)        /*!<MR_SUBG_RADIO AFC2_CONFIG: AFC_EN (Bit 6) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_EN_Msk                               (0x40UL)        /*!< MR_SUBG_RADIO AFC2_CONFIG: AFC_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_EN                                   MR_SUBG_RADIO_AFC2_CONFIG_AFC_EN_Msk
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_MODE_Pos                             (5UL)        /*!<MR_SUBG_RADIO AFC2_CONFIG: AFC_MODE (Bit 5) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_MODE_Msk                             (0x20UL)        /*!< MR_SUBG_RADIO AFC2_CONFIG: AFC_MODE (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_MODE                                 MR_SUBG_RADIO_AFC2_CONFIG_AFC_MODE_Msk
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos                       (0UL)        /*!<MR_SUBG_RADIO AFC2_CONFIG: AFC_PD_LEAKAGE (Bit 0) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Msk                       (0x1fUL)        /*!< MR_SUBG_RADIO AFC2_CONFIG: AFC_PD_LEAKAGE (Bitfield-Mask: 0x1f) */
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE                           MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Msk
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_0                         (0x1U << MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos)
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_1                         (0x2U << MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos)
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_2                         (0x4U << MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos)
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_3                         (0x8U << MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos)
#define MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_4                         (0x10U << MR_SUBG_RADIO_AFC2_CONFIG_AFC_PD_LEAKAGE_Pos)

/* =====================================================    AFC3_CONFIG    =====================================================*/
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_Pos                    (6UL)        /*!<MR_SUBG_RADIO AFC3_CONFIG: AFC_REINIT_OPTION (Bit 6) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_Msk                    (0xc0UL)        /*!< MR_SUBG_RADIO AFC3_CONFIG: AFC_REINIT_OPTION (Bitfield-Mask: 0x03) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION                        MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_Msk
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_0                      (0x1U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_1                      (0x2U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_REINIT_OPTION_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Pos                     (2UL)        /*!<MR_SUBG_RADIO AFC3_CONFIG: AFC_TH_SIGN_PERM (Bit 2) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Msk                     (0x3cUL)        /*!< MR_SUBG_RADIO AFC3_CONFIG: AFC_TH_SIGN_PERM (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM                         MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Msk
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_0                       (0x1U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_1                       (0x2U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_2                       (0x4U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_3                       (0x8U << MR_SUBG_RADIO_AFC3_CONFIG_AFC_TH_SIGN_PERM_Pos)
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_SIGN_PERM_CHECK_Pos                  (1UL)        /*!<MR_SUBG_RADIO AFC3_CONFIG: AFC_SIGN_PERM_CHECK (Bit 1) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_SIGN_PERM_CHECK_Msk                  (0x2UL)        /*!< MR_SUBG_RADIO AFC3_CONFIG: AFC_SIGN_PERM_CHECK (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_SIGN_PERM_CHECK                      MR_SUBG_RADIO_AFC3_CONFIG_AFC_SIGN_PERM_CHECK_Msk
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_INIT_MODE_Pos                        (0UL)        /*!<MR_SUBG_RADIO AFC3_CONFIG: AFC_INIT_MODE (Bit 0) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_INIT_MODE_Msk                        (0x1UL)        /*!< MR_SUBG_RADIO AFC3_CONFIG: AFC_INIT_MODE (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AFC3_CONFIG_AFC_INIT_MODE                            MR_SUBG_RADIO_AFC3_CONFIG_AFC_INIT_MODE_Msk

