stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xxxx.h
/* =====================================================    AGC_ATTEN0    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN0: PGA_AGCGAIN_0 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN0: PGA_AGCGAIN_0 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0                             MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Msk
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN0_PGA_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN0: ATTEN_AGCGAIN_0 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN0: ATTEN_AGCGAIN_0 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0                           MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Msk
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN0_ATTEN_AGCGAIN_0_Pos)

/* =====================================================    AGC_ATTEN1    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN1: PGA_AGCGAIN_1 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN1: PGA_AGCGAIN_1 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1                             MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Msk
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN1_PGA_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN1: ATTEN_AGCGAIN_1 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN1: ATTEN_AGCGAIN_1 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1                           MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Msk
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN1_ATTEN_AGCGAIN_1_Pos)

/* =====================================================    AGC_ATTEN2    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN2: PGA_AGCGAIN_2 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN2: PGA_AGCGAIN_2 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2                             MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Msk
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN2_PGA_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN2: ATTEN_AGCGAIN_2 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN2: ATTEN_AGCGAIN_2 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2                           MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Msk
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN2_ATTEN_AGCGAIN_2_Pos)

/* =====================================================    AGC_ATTEN3    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN3: PGA_AGCGAIN_3 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN3: PGA_AGCGAIN_3 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3                             MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Msk
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN3_PGA_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN3: ATTEN_AGCGAIN_3 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN3: ATTEN_AGCGAIN_3 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3                           MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Msk
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN3_ATTEN_AGCGAIN_3_Pos)

/* =====================================================    AGC_ATTEN4    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN4: PGA_AGCGAIN_4 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN4: PGA_AGCGAIN_4 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4                             MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Msk
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN4_PGA_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN4: ATTEN_AGCGAIN_4 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN4: ATTEN_AGCGAIN_4 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4                           MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Msk
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN4_ATTEN_AGCGAIN_4_Pos)

/* =====================================================    AGC_ATTEN5    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN5: PGA_AGCGAIN_5 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN5: PGA_AGCGAIN_5 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5                             MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Msk
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN5_PGA_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN5: ATTEN_AGCGAIN_5 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN5: ATTEN_AGCGAIN_5 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5                           MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Msk
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN5_ATTEN_AGCGAIN_5_Pos)

/* =====================================================    AGC_ATTEN6    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN6: PGA_AGCGAIN_6 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN6: PGA_AGCGAIN_6 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6                             MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Msk
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN6_PGA_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN6: ATTEN_AGCGAIN_6 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN6: ATTEN_AGCGAIN_6 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6                           MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Msk
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN6_ATTEN_AGCGAIN_6_Pos)

/* =====================================================    AGC_ATTEN7    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN7: PGA_AGCGAIN_7 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN7: PGA_AGCGAIN_7 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7                             MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Msk
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN7_PGA_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN7: ATTEN_AGCGAIN_7 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN7: ATTEN_AGCGAIN_7 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7                           MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Msk
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN7_ATTEN_AGCGAIN_7_Pos)

/* =====================================================    AGC_ATTEN8    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN8: PGA_AGCGAIN_8 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN8: PGA_AGCGAIN_8 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8                             MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Msk
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN8_PGA_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN8: ATTEN_AGCGAIN_8 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN8: ATTEN_AGCGAIN_8 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8                           MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Msk
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN8_ATTEN_AGCGAIN_8_Pos)

/* =====================================================    AGC_ATTEN9    =====================================================*/
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Pos                         (4UL)        /*!<MR_SUBG_RADIO AGC_ATTEN9: PGA_AGCGAIN_9 (Bit 4) */
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Msk                         (0x70UL)        /*!< MR_SUBG_RADIO AGC_ATTEN9: PGA_AGCGAIN_9 (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9                             MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Msk
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_0                           (0x1U << MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_1                           (0x2U << MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_2                           (0x4U << MR_SUBG_RADIO_AGC_ATTEN9_PGA_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Pos                       (0UL)        /*!<MR_SUBG_RADIO AGC_ATTEN9: ATTEN_AGCGAIN_9 (Bit 0) */
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Msk                       (0xfUL)        /*!< MR_SUBG_RADIO AGC_ATTEN9: ATTEN_AGCGAIN_9 (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9                           MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Msk
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_0                         (0x1U << MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_1                         (0x2U << MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_2                         (0x4U << MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Pos)
#define MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_3                         (0x8U << MR_SUBG_RADIO_AGC_ATTEN9_ATTEN_AGCGAIN_9_Pos)

/* =====================================================    AGC1_ATTEN_TRIM    =====================================================*/
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos               (0UL)        /*!<MR_SUBG_RADIO AGC1_ATTEN_TRIM: AGC1_ATTEN_TRIM_IN (Bit 0) */
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Msk               (0xffUL)        /*!< MR_SUBG_RADIO AGC1_ATTEN_TRIM: AGC1_ATTEN_TRIM_IN (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN                   MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Msk
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_0                 (0x1U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_1                 (0x2U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_2                 (0x4U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_3                 (0x8U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_4                 (0x10U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_5                 (0x20U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_6                 (0x40U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_7                 (0x80U << MR_SUBG_RADIO_AGC1_ATTEN_TRIM_AGC1_ATTEN_TRIM_IN_Pos)

/* =====================================================    AGC2_ATTEN_TRIM    =====================================================*/
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos               (0UL)        /*!<MR_SUBG_RADIO AGC2_ATTEN_TRIM: AGC2_ATTEN_TRIM_IN (Bit 0) */
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Msk               (0xffUL)        /*!< MR_SUBG_RADIO AGC2_ATTEN_TRIM: AGC2_ATTEN_TRIM_IN (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN                   MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Msk
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_0                 (0x1U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_1                 (0x2U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_2                 (0x4U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_3                 (0x8U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_4                 (0x10U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_5                 (0x20U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_6                 (0x40U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_7                 (0x80U << MR_SUBG_RADIO_AGC2_ATTEN_TRIM_AGC2_ATTEN_TRIM_IN_Pos)

/* =====================================================    AGC3_ATTEN_TRIM    =====================================================*/
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos               (0UL)        /*!<MR_SUBG_RADIO AGC3_ATTEN_TRIM: AGC3_ATTEN_TRIM_IN (Bit 0) */
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Msk               (0xffUL)        /*!< MR_SUBG_RADIO AGC3_ATTEN_TRIM: AGC3_ATTEN_TRIM_IN (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN                   MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Msk
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_0                 (0x1U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_1                 (0x2U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_2                 (0x4U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_3                 (0x8U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_4                 (0x10U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_5                 (0x20U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_6                 (0x40U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_7                 (0x80U << MR_SUBG_RADIO_AGC3_ATTEN_TRIM_AGC3_ATTEN_TRIM_IN_Pos)

